{
    "title": "Breast Cancer Fact Sheet",
    "description": 
        "Breast cancer remains one of the most prevalent cancers worldwide, affecting millions of individuals each year. Despite advancements in diagnostics, treatment, and awareness, disparities in access to care, molecular testing, and specialized centers persist.",
    
    "long_discription": 
        "Breast cancer incidence: 25.6% of all female cancers Incidence rate: 36.8 per 100,000 women per year Total cases (2022): Approximately 29,929 new cases Daily diagnoses (2022): Around 82 women per day Breast cancer deaths (2021): About 7,900 women 5-year survival rate: 82% overall; 97% for early-stage disease, 82% for locally advanced disease, and 36% for metastatic disease Most affected age group: 50-69 years Screening participation (ages 50-69): 21.2%",
    
    "infrastructure": {
        "STRENGTH": "Centers like INCan and Hospital General de México provide high-quality care in major cities. HER2, ER, and PR testing are available in tertiary hospitals and integrated into standard care.",
        "WEAKNESSES": "Only ~35% of cancer patients access specialized centers; most rely on general hospitals with limited oncology capacity. Pathology and genetic testing infrastructure is underdeveloped in the public sector.",
        "OPPORTUNITIES": "Expand regional cancer centers and public investment in pathology. Improve access to BRCA and molecular testing beyond private sector availability.",
        "THREATS": "Rural and low-income patients are at risk of delayed diagnosis and under-treatment due to lack of infrastructure.",

        "legends": [
            "5 – Advanced nationwide infrastructure, widespread availability in public and private sectors, integration with clinical practice.",
            "4 – Strong infrastructure in major hospitals and cancer centers, some regional disparities.",
            "3 – Moderate infrastructure, primarily in private settings or research institutions.",
            "2 – Limited infrastructure, available only in select centers or for high-cost private testing.",
            "1 – Minimal or no infrastructure, testing mostly unavailable or sent abroad."

        ]
    },

    "TRFA": {
        "STRENGTH": "Advanced treatments like trastuzumab and pertuzumab are available in public formularies. October campaigns and NGOs like Fundación Cima boost public engagement and awareness.",
        "WEAKNESSES": "Medication shortages, long wait times, and coverage gaps persist in public hospitals. Research is underfunded—less than 5% of national health research is oncology-focused.",
        "OPPORTUNITIES": "Increase federal research grants and incentivize HER2-specific clinical trials. Localize and adapt awareness campaigns to rural and indigenous communities.",
        "THREATS": "Without strategic investment, awareness may be seasonal, and access inequities will deepen.",

        "legends": [
            "5 – Strong healthcare infrastructure with comprehensive treatment access, high research funding, and nationwide awareness campaigns. Patients have access to advanced therapies, clinical trials, and widespread early detection programs.",
            "4 – Well-developed system with good treatment availability, strong research funding, and effective but regionally focused awareness campaigns. Some disparities may exist in rural areas or between public and private sectors.",
            "3 – Moderate development, with specialized treatments available in major hospitals, research funding concentrated on specific cancers, and occasional but limited awareness efforts. Healthcare access may be restricted by cost or geography.",
            "2 – Limited system where cancer treatment is available only in select urban centers, research funding is minimal or sporadic, and awareness campaigns are rare or underfunded. Patients often face long wait times or financial barriers.",
            "1 – Poor infrastructure with severe barriers to treatment, little to no research funding, and lack of structured awareness campaigns. Cancer care is largely inaccessible, with many patients relying on out-of-pocket expenses or external aid."
        ]
    },

    "SEPC": {
        "STRENGTH": "5-year survival for early-stage breast cancer reaches 89%; public mammograms are free for women 40+. NOM-041 mandates organized screening every 2 years for women 40–69.",
        "WEAKNESSES": "Over 40% of cases are diagnosed at late stages (III or IV), with survival dropping to ~36%. Less than 15% of patients access structured palliative care; regional disparities are stark.",
        "OPPORTUNITIES": "Expand mobile screening units and integrate survivorship planning. Train general practitioners in early detection and palliative protocols.",
        "THREATS": "Without earlier diagnoses and supportive care, national survival rates will stagnate or decline.",

        "legends": [
            "5 – High survival rates, strong early detection programs, and well-established palliative care services. Patients have access to timely diagnosis, advanced treatments, and comprehensive end-of-life care.",
            "4 – Good survival rates, effective early detection efforts, and accessible but regionally limited palliative care. Some disparities may exist in rural areas or for specific cancer types.",
            "3 – Moderate survival rates, early detection available but not widespread, and palliative care services mainly in urban centers. Some patients experience delays in diagnosis or limited end-of-life care.",
            "2 – Low survival rates, early detection efforts are inconsistent or underfunded, and palliative care is minimal or only available in select hospitals. Cancer patients face significant access barriers.",
            "1 – Very low survival rates, poor early detection infrastructure, and almost no palliative care services. Many patients are diagnosed late and lack proper support for pain management and end-of-life care."
        ]
    },

    "utilization_biom": {
        "STRENGTH": "HER2, ER, and PR testing are part of institutional care standards. Testing is increasingly recognized in national clinical workflows.",
        "WEAKNESSES": "BRCA testing is cost-prohibitive ($800–$2,500 USD) and not reimbursed in the public system. Turnaround times are long due to limited pathology capacity in public hospitals.",
        "OPPORTUNITIES": "Standardize and reimburse HER2 and BRCA testing across public providers. Develop centralized labs to improve equity and efficiency.",
        "THREATS": "Unequal access to biomarker data undermines personalized treatment plans and precision care.",

        "legends": [
            "5 – >80% Biomarker testing is widely available and routinely performed as part of standard clinical practice. Strong integration into treatment decisions, with national coverage and reimbursement ensuring accessibility.",
            "4 – 61-80%. Biomarker testing is commonly used, but access may be limited in certain regions or patient groups. Some disparities exist in coverage or affordability, but it is still a crucial part of cancer diagnostics.",
            "3 – 41-60% Moderate utilization, often restricted to major hospitals or private healthcare settings. Some patients may not receive biomarker testing due to cost or limited availability in public healthcare systems.",
            "2 – 20-40% Biomarker testing is available but underutilized, with significant barriers such as high costs, lack of awareness, or limited infrastructure. Many patients may not receive recommended biomarker assessments.",
            "1 – <20% Biomarker testing is rarely performed, often due to lack of infrastructure, awareness, or financial barriers. Patients typically do not receive targeted therapies based on biomarker status."
        ]
    },

    "clinical_guide": {
        "STRENGTH": "NOM-041 provides a national standard for breast cancer management. Aligned with international principles (e.g., ASCO, ESMO).",
        "WEAKNESSES": "NOM-041 has not been updated since 2011; it excludes HER2-low and novel treatment pathways. Guideline adherence varies by institution and provider training.",
        "OPPORTUNITIES": "Update NOM-041 to include HER2-low and genomic diagnostics. Link continuous education (CME) to protocol adherence.",
        "THREATS": "Outdated guidelines risk clinical inertia and limit the uptake of new innovations.",

        "legends": [
            "No legend available"
        ]
    },

    "reimbursement": {
        "STRENGTH": "HER2-targeted therapies are part of public formularies. Previous reforms (Seguro Popular) showed that universal coverage is achievable.",
        "WEAKNESSES": "Transition to INSABI/IMSS-Bienestar caused disruptions in treatment continuity and reimbursement. ~50% of eligible HER2+ patients receive public-funded treatment; others pay out-of-pocket or abandon care.",
        "OPPORTUNITIES": "Secure long-term public funding for HER2 therapies and diagnostics. Expand IMSS-Bienestar to include all HER2-recommended treatments.",
        "THREATS": "Budget instability and regional disparities may exacerbate access gaps.",

        "legends": [
            "Yes – A structured reimbursement system exists, ensuring biomarker testing is covered through national healthcare systems, insurance, or public-private partnerships. Patients face no direct financial burden.",
            "Partial – A reimbursement framework is in place, but patients may still have out-of-pocket expenses such as co-pays, limited coverage, or financial caps on testing.",
            "No – No formal reimbursement system exists, meaning patients must fully cover the cost of biomarker testing out-of-pocket."

        ]
    },

    "screening": {
        "STRENGTH": "National guidelines offer free biennial mammograms for women aged 40–69. Public sector operates over 1,200 mammography units.",
        "WEAKNESSES": "Screening participation remains low (21.2%); opportunistic rather than organized in most states. Long wait times, stigma, and poor follow-up systems reduce program impact.",
        "OPPORTUNITIES": "Transition to organized, invitation-based screening models. Focus outreach on underserved populations using mobile and community-based programs.",
        "THREATS": "Continued low uptake will sustain high rates of late-stage diagnosis and mortality.",

        "legends": [
            "No legend available"
        ]
    }
}