[
    {
        "id": 122,
        "cancer_type": "colorectal",
        "country": "China",
        "country_shortForm": "CN",
        "introduction": "Colorectal cancer (CRC) is a growing public health concern in China, with incidence increasing due to aging population and lifestyle changes. Specialized cancer centers and molecular testing infrastructure are relatively well-developed in urban areas, though rural access remains limited. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available but primarily in tertiary hospitals and research settings. Clinical guidelines exist and are moderately implemented, with partial alignment to international standards. Reimbursement and no-cost access are limited, resulting in some out-of-pocket expenses. Screening is largely opportunistic, with pilot programs in urban areas using FIT and colonoscopy. Overall, colorectal cancer care in China shows moderate maturity, with strengths in urban infrastructure but gaps in organized screening, rural access, and biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Well-developed specialized cancer centers in urban areas.",
"Advanced molecular testing infrastructure in tertiary hospitals.",
"Standard treatment modalities (surgery, chemotherapy, targeted therapy) are available in major centers.",
"Research funding and awareness campaigns are active and growing."
],

            "Weaknesses":
                ["Limited access to molecular testing in rural and smaller hospitals.",
"Opportunistic screening predominates; population-based programs are minimal.",
"Clinical guideline implementation varies; engagement with updates is moderate.",
"Financial burden remains moderate due to limited reimbursement and subsidy programs."
],

            "Opportunities": 
                ["Expand organized screening programs nationally to improve early detection.",
"Increase molecular biomarker testing accessibility outside urban centers.",
"Leverage telemedicine to extend oncology expertise to underserved regions.",
"Promote participation in international clinical trials and research collaborations."
],

            "Threats": 
                ["Rising incidence may strain healthcare resources.",
"Unequal access between urban and rural areas could worsen disparities.",
"Budgetary constraints may limit adoption of advanced therapies and diagnostics.",
"Workforce shortages in oncology and pathology, especially in non-urban regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Well-developed centers in urban areas; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Advanced infrastructure in tertiary hospitals; urban-focused."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies widely available in urban centers; disparities in rural regions."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate funding; supports both local and collaborative studies."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Ongoing campaigns; moderate uptake in non-urban areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate; earlier detection improving in urban populations."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic and pilot urban programs using FIT/colonoscopy; no nationwide organized screening."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in urban centers; uneven coverage elsewhere."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "30%", "disc": "Tested mainly in tertiary centers; limited rural access."},
            "NRAS_mutations": {"score": "15%", "disc": "Low availability outside research settings."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Limited access."},
            "MSI/dMMR": {"score": "5%", "disc": "Rarely available; mostly research or tertiary centers."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Minimal testing, urban-focused."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderate adoption; varies across hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in well-equipped hospitals; limited in smaller centers."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Urban centers adopt updates; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Partially integrated; advanced care mostly in urban hospitals."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "/5", "disc": "Some coverage under national insurance; gaps for advanced therapies."},
            "No-cost_Access": {"score": "/5", "disc": "Limited subsidy programs; out-of-pocket costs remain."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic & pilot", "disc": "Opportunistic screening in clinics; pilot FIT/colonoscopy programs in urban areas; no national population-level program."}
        }
    },
    
    
    {
        "id": 123,
        "cancer_type": "colorectal",
        "country": "France",
        "country_shortForm": "FR",
        "introduction": "France has a well-established colorectal cancer (CRC) care system, with high-quality specialized centers and advanced molecular diagnostics widely accessible. Early detection is supported by a national organized screening program using FIT testing every two years for individuals aged 50–74. Treatment is advanced, including surgery, chemotherapy, radiotherapy, and targeted therapies, supported by national clinical guidelines fully aligned with international standards. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) is increasingly integrated into clinical decision-making. Reimbursement and no-cost access are moderate, with public insurance covering most standard therapies. Palliative care is well-structured, and awareness campaigns are actively conducted. Overall, CRC care in France demonstrates high maturity, though continuous improvement in biomarker adoption and access in remote regions is still relevant.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive network of specialized centers providing high-quality CRC care.",
"Advanced molecular testing widely available, supporting personalized treatment.",
"Strong national guidelines with full adoption of international standards (ESMO/NCCN).",
"Organized national screening program using FIT testing.",
"High survival rates due to early detection and advanced therapies."
],

            "Weaknesses":
                ["Biomarker testing is not universally applied in all regions; some disparities exist.",
"Reimbursement and no-cost access are moderate rather than full, creating some financial burden for rare advanced therapies.",
"Limited palliative care uptake in certain rural areas."
],

            "Opportunities": 
                ["Expand biomarker-guided precision oncology across all centers.",
"Enhance awareness campaigns in underserved regions.",
"Integrate emerging therapies into routine care more rapidly.",
"Further optimize follow-up care and survivorship programs."
],

            "Threats": 
                ["Increasing incidence due to aging population may stress healthcare resources.",
"Regional disparities in rural access could persist.",
"Budget constraints may limit adoption of novel therapies."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive network of high-quality centers nationwide."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Advanced therapies available; minor regional differences may exist."},
            "Research_Funding": {"score": "4/5", "disc": "Strong investment in CRC research and clinical trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Active campaigns nationwide; good public engagement."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and effective treatment."},
            "Early_Detection": {"score": "4/5", "disc": "National FIT-based organized screening program in place."},
            "Palliative_Care": {"score": "4/5", "disc": "Well-structured palliative care; some regional differences."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "80%", "disc": "Routinely tested to guide targeted therapy."},
            "NRAS_mutations": {"score": "45%", "disc": "Tested as part of standard molecular panels."},
            "BRAF_V600E_mutations": {"score": "40%", "disc": "Testing available; informs targeted therapy."},
            "MSI/dMMR": {"score": "30%", "disc": "Tested for immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "35%", "disc": "Increasingly used for research and treatment planning."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Full adoption across all centers."},
            "Feasibility": {"score": "5/5", "disc": "Easily integrated into clinical workflows."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Fully aligned with ESMO/NCCN recommendations."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Rapid incorporation of guideline updates."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully implemented for advanced and metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Public insurance covers most therapies; some gaps for rare treatments."},
            "No-cost_Access": {"score": "3/5", "disc": "Moderate; patients may face minor out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT-based organized screening", "disc": "Biennial FIT for ages 50–74; national coverage ensures early detection."}
        }
    },

    {
        "id": 124,
        "cancer_type": "colorectal",
        "country": "Algeria",
        "country_shortForm": "DZ",
        "introduction": "Colorectal cancer (CRC) is an emerging public health concern in Algeria, with incidence steadily increasing. Specialized centers exist but are limited in number and concentrated in major cities, leaving rural populations with reduced access. Molecular biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available at modest levels, mostly in tertiary hospitals, but overall coverage remains low compared to international standards. Clinical guidelines exist but are weakly implemented, with low integration of ESMO standards and limited engagement with updates. Treatment access is present but inconsistent, while research funding and awareness remain modest. Screening is opportunistic, with no formal national program, resulting in frequent late-stage diagnosis. Palliative care services exist but are insufficiently developed, particularly in rural areas. Overall, Algeria demonstrates moderate maturity (Level 3), with strengths in basic service provision but gaps in molecular diagnostics, screening, equitable access, and guideline adoption.",
        "swot_analysis": {
            "Strengths":
                ["Specialized oncology services available in urban hospitals.",
"Standard treatment modalities (surgery, chemotherapy, radiotherapy) accessible in tertiary centers.",
"Availability of some biomarker testing (KRAS, NRAS, BRAF).",
"Public health sector covers part of treatment, lowering costs compared to full out-of-pocket systems."
],

            "Weaknesses":
                ["Specialized cancer centers unevenly distributed; rural access remains poor.",
"Limited biomarker utilization; MSI/dMMR and PIK3CA testing rare.",
"Clinical guidelines weakly implemented; low engagement with international standards.",
"Palliative care infrastructure underdeveloped, opioid access restricted.",
"No organized national CRC screening program, leading to late-stage presentation.",
"Research capacity and funding are modest."
],

            "Opportunities": 
                ["Expand molecular diagnostics (especially MSI/dMMR testing) to guide immunotherapy.",
"Strengthen palliative care and integrate opioid availability through supportive health policies.",
"Establish pilot CRC screening initiatives (FOBT/FIT, colonoscopy) targeting high-risk populations.",
"Increase awareness campaigns to encourage earlier diagnosis.",
"Develop multicenter collaborations for regional clinical research and trial participation."
],

            "Threats": 
                ["Rising incidence may overwhelm limited oncology infrastructure.",
"Budgetary constraints could restrict adoption of advanced therapies and molecular testing.",
"Urban–rural disparity in access may exacerbate inequities.",
"Workforce shortages in oncology, gastroenterology, and pathology.",
"Continued absence of a national screening program risks maintaining high mortality."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Present in major cities, but rural areas underserved."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "KRAS/NRAS/BRAF somewhat available; MSI and PIK3CA testing rare."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in tertiary centers, limited in rural hospitals."},
            "Research_Funding": {"score": "2/5", "disc": "Modest, with limited national/academic initiatives."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Low awareness and cultural barriers hinder early diagnosis."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Outcomes below global standards due to late detection."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic testing only; no organized program."},
            "Palliative_Care": {"score": "2/5", "disc": "Weakly developed, opioid access challenges persist."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "45%", "disc": "Most common biomarker tested."},
            "NRAS_mutations": {"score": "15%", "disc": "Available in select tertiary centers."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Limited access."},
            "MSI/dMMR": {"score": "5%", "disc": "Rarely tested, despite clinical importance."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Minimal testing capacity."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Weakly applied in practice."},
            "Feasibility": {"score": "2/5", "disc": "Limited outside major hospitals."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Low adoption of NCCN/ESMO."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Very limited update integration."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Poor integration overall."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage under public insurance; advanced therapies less accessible."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients often incur out-of-pocket costs for advanced diagnostics/therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No organized CRC screening; testing available only in urban hospitals opportunistically."}
        }
    },


    {
        "id": 125,
        "cancer_type": "colorectal",
        "country": "Argentina",
        "country_shortForm": "AR",
        "introduction": "Colorectal cancer (CRC) is one of the leading cancers in Argentina, with incidence rising but early detection strategies beginning to expand. Specialized centers exist in major cities, but regional disparities remain. Molecular diagnostics (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) are available in tertiary and private hospitals, though access is uneven. Treatment access is limited in parts of the public sector, with better availability in private institutions. Research activity is ongoing, but funding is moderate. Clinical guidelines are well developed, with strong alignment to international standards such as ESMO and NCCN, and implementation is relatively strong in major hospitals. National screening exists through FIT testing every two years for adults aged 50–75, but program reach and uptake vary. Reimbursement and no-cost access are moderate, but inequities persist across socioeconomic and geographic lines. Overall, Argentina demonstrates maturity level 2 in colorectal cancer care, reflecting progress in guidelines and screening but major gaps in equitable treatment access and biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Specialized oncology centers exist in urban hubs with access to advanced diagnostics.",
"National colorectal cancer screening program using FIT is in place.",
"Clinical guidelines are well developed, with high feasibility and strong alignment to international standards.",
"Research activity present, contributing to Latin American oncology data."
],

            "Weaknesses":
                ["Treatment access limited in public hospitals, particularly outside major cities.",
"Biomarker utilization still modest (KRAS most common, others less widely adopted).",
"Unequal access between private and public sectors.",
"Palliative care services limited in scope and consistency."
],

            "Opportunities": 
                ["Expand uptake and geographic coverage of the national FIT screening program.",
"Increase access to molecular diagnostics (BRAF, MSI/dMMR) to guide precision medicine.",
"Leverage clinical trial participation to broaden therapy access.",
"Strengthen funding for colorectal cancer–specific research and capacity building."
],

            "Threats": 
                ["Rising CRC incidence risks overwhelming limited treatment capacity.",
"Budgetary constraints in the public sector restrict equitable access to advanced therapies.",
"Disparities between urban and rural populations may widen.",
"Low biomarker testing rates risk underutilization of precision oncology approaches."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Major urban hubs provide access; rural areas underserved."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Available for KRAS/NRAS/BRAF/MSI in tertiary/private hospitals; uneven nationwide."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard treatments available in private/urban centers; gaps in public system."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate, with local academic contributions."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Present but reach limited outside major cities."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Comparable to regional averages; early detection improving outcomes."},
            "Early_Detection": {"score": "3/5", "disc": "National FIT screening program exists, but uptake uneven."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available but not fully integrated nationwide."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "55%", "disc": "Most widely tested marker."},
            "NRAS_mutations": {"score": "25%", "disc": "Limited routine use."},
            "BRAF_V600E_mutations": {"score": "20%", "disc": "Available in select centers."},
            "MSI/dMMR": {"score": "15%", "disc": "Low uptake; largely tertiary/research settings."},
            "PIK3CA_mutations": {"score": "15%", "disc": "Minimal, restricted to advanced centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well implemented in tertiary hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Generally feasible across larger hospitals."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates adopted in major centers; slower in regional hospitals."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Broadly integrated for treatment planning."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Some therapies covered; gaps remain for advanced options."},
            "No-cost_Access": {"score": "3/5", "disc": "Public sector offers partial coverage; disparities persist."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT program", "disc": "Biennial FIT for adults 50–75; coverage and adherence uneven."}
        }
    },


    {
        "id": 126,
        "cancer_type": "colorectal",
        "country": "Australia",
        "country_shortForm": "AU",
        "introduction": "Australia has a well-established healthcare system with strong infrastructure for colorectal cancer (CRC) care. Specialized cancer centers and advanced molecular testing are widely available, predominantly in urban and regional tertiary hospitals. Screening is organized nationally through the Bowel Cancer Screening Program (ages 50–74), supporting early detection. Clinical guidelines are well implemented and regularly updated, closely aligned with international standards (ESMO, NCCN). Research funding is moderate, supporting both clinical and molecular studies. Reimbursement for therapies and access to no-cost care is partially covered, with some out-of-pocket costs for advanced interventions. Overall, CRC care in Australia shows a moderately high maturity level, though gaps remain in equitable access and comprehensive biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive specialized cancer centers and molecular testing infrastructure across major cities.",
"Organized national screening program (FIT-based) leading to earlier diagnosis.",
"High clinical guideline implementation and alignment with international standards.",
"Robust survival rates due to early detection and access to advanced therapies."
],

            "Weaknesses":
                ["Biomarker testing coverage for certain mutations (e.g., MSI/dMMR, PIK3CA) is not universal.",
"Some rural and remote populations may face barriers to specialized care.",
"Reimbursement coverage and no-cost access are partial, leading to occasional out-of-pocket costs."
],

            "Opportunities": 
                ["Expand biomarker testing in community and regional hospitals to improve targeted therapy.",
"Enhance public awareness campaigns to further increase early detection.",
"Strengthen telemedicine services to improve care in remote areas.",
"Increase patient participation in national and international clinical trials."
],

            "Threats": 
                ["Rising CRC incidence could strain existing healthcare resources.",
"Potential budget limitations for advanced molecular testing and therapies.",
"Workforce shortages in oncology and pathology, particularly in regional hospitals."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Widespread specialized centers across major cities."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced molecular diagnostics broadly available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "/5", "disc": "Standard therapies accessible; advanced therapies available in tertiary centers."},
            "Research_Funding": {"score": "/5", "disc": "Moderate funding; supports clinical and molecular studies."},
            "Awareness_Campaigns": {"score": "/5", "disc": "Effective awareness campaigns; high public knowledge."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "/5", "disc": "High survival due to early detection and effective treatment."},
            "Early_Detection": {"score": "/5", "disc": "National FIT-based screening program in place."},
            "Palliative_Care": {"score": "/5", "disc": "Palliative care services available; broadly integrated."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "80%", "disc": "Widely tested to guide targeted therapy."},
            "NRAS_mutations": {"score": "45%", "disc": "Moderate availability in tertiary centers."},
            "BRAF_V600E_mutations": {"score": "40%", "disc": "Moderate availability; guides targeted treatment."},
            "MSI/dMMR": {"score": "35%", "disc": "Limited coverage; mostly in tertiary centers."},
            "PIK3CA_mutations": {"score": "35%", "disc": "Limited access; emerging biomarker."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines fully implemented across major hospitals."},
            "Feasibility": {"score": "5/5", "disc": "Easily integrated in most clinical settings."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regularly updated and incorporated."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated into care pathways."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage; some out-of-pocket costs."},
            "No-cost_Access": {"score": "3/5", "disc": "Limited subsidies; most essential services accessible."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT-based program", "disc": "Organized national screening for ages 50–74 using FIT every 2 years."}
        }
    },


    {
        "id": 127,
        "cancer_type": "colorectal",
        "country": "Brazil",
        "country_shortForm": "BR",
        "introduction": "Colorectal cancer (CRC) is among the most prevalent cancers in Brazil and a leading cause of cancer-related deaths. While specialized cancer centers and advanced diagnostics exist in major cities, access across rural and underserved regions is limited. Opportunistic screening using FIT and colonoscopy is available, with some state-level organized programs, but no nationwide initiative. Treatment access is uneven, with strong capabilities in tertiary hospitals but delayed access in the public system. Molecular biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is increasingly recognized but limited outside select tertiary and private centers. National guidelines exist and are relatively well aligned with international standards, though smaller hospitals face challenges in integration. Reimbursement is partial, with gaps in access to advanced therapies and testing. Overall, colorectal cancer care in Brazil shows low-to-moderate maturity (level 2), with progress in biomarker adoption and guidelines, but major gaps in screening coverage, equitable access, and treatment distribution.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers established in urban regions with access to standard CRC therapies (surgery, chemotherapy, radiotherapy).",
"Biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR) increasingly available in tertiary/private settings.",
"National guidelines exist with strong alignment to ESMO/NCCN.",
"Active academic and clinical research programs with regional contributions."
],

            "Weaknesses":
                ["Unequal access between private and public sectors; delays in treatment initiation in public hospitals.",
"Molecular biomarker testing remains limited outside urban tertiary centers.",
"Screening largely opportunistic, with no national program.",
"Rural and low-income populations face systemic barriers to access specialized care.",
"Palliative care services insufficient and unevenly distributed."
],

            "Opportunities": 
                ["Scale up FIT and colonoscopy-based organized screening at national level.",
"Expand access to MSI/dMMR testing to enable immunotherapy use.",
"Leverage telehealth to improve oncology expertise access in underserved regions.",
"Increase government and international research collaborations for CRC-focused studies.",
"Enhance community-level awareness to improve early detection and reduce stigma."
],

            "Threats":
                ["Rising incidence of CRC may overwhelm existing system capacity.",
"Financial and resource constraints limit adoption of advanced therapies.",
"Regional disparities in access could exacerbate health inequities.",
"Workforce shortages in oncology and pathology in non-urban areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Established in major urban areas; rural access remains poor."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Available in tertiary/private hospitals; limited in smaller centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Available in tertiary centers; delays and inequities in public sector."},
            "Research_Funding": {"score": "3/5", "disc": "Active research programs; modest but ongoing contributions."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Public campaigns exist; uptake varies regionally."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; limited by late detection and treatment delays."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic FIT/colonoscopy; limited organized programs."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in urban centers; rural access insufficient."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "60%", "disc": "Relatively established in tertiary centers."},
            "NRAS_mutations": {"score": "30%", "disc": "Limited availability."},
            "BRAF_V600E_mutations": {"score": "25%", "disc": "Available but not routine."},
            "MSI/dMMR": {"score": "20%", "disc": "Low coverage; critical for immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "20%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines widely available and implemented in larger centers."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in urban hospitals; smaller hospitals face gaps."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers adopt updates; smaller centers lag."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Integrated in advanced care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage under SUS; advanced therapies limited."},
            "No-cost_Access": {"score": "3/5", "disc": "Public insurance covers some basics; out-of-pocket burden remains."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic FIT & colonoscopy", "disc": "Some state-level organized programs; no national coverage."}
        }
    },


    {
        "id": 128,
        "cancer_type": "colorectal",
        "country": "Canada",
        "country_shortForm": "CA",
        "introduction": "Colorectal cancer (CRC) is a major cancer diagnosis in Canada. Care is delivered through an extensive network of specialized cancer centres and provincial cancer agencies. Advanced diagnostics and molecular testing (KRAS/NRAS/BRAF, MSI/dMMR, PIK3CA) are widely available in tertiary centres and integrated into treatment decision-making. National and provincial clinical guidelines are robust and generally well implemented, with strong alignment to international standards (ESMO/NCCN). Organized screening programs using FIT/FOBT are established in most provinces and contribute to earlier detection and improved survival. Research funding and clinical trial activity are strong. Provincial variability in some access and reimbursement pathways, and rural/remote access barriers, remain. Overall maturity level: 4/5 (High).",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive, well-distributed specialized cancer centres with full multidisciplinary CRC services.",
"Wide availability and routine use of advanced molecular testing guiding targeted therapy.",
"Strong national/provincial guidelines and organized screening (FIT/FOBT) in most provinces.",
"Robust research funding and active clinical trials."
],

            "Weaknesses":
                ["Provincial variation in access/funding for some diagnostics and novel therapies.",
"Reimbursement/no-cost access for some advanced options inconsistent.",
"Rural/remote populations face travel and specialist-access barriers.",
"Some under-served groups have lower screening uptake."
],

            "Opportunities": 
                ["Harmonize provincial reimbursement and funding for diagnostics/targeted therapies.",
"Expand tele-oncology, navigation and outreach for rural/underserved groups.",
"Raise screening uptake through targeted campaigns.",
"Use real-world data to accelerate access and guideline updates."
],

            "Threats": 
                ["Rising incidence and survivorship needs may strain capacity and budgets.",
"Rapid innovation could outpace uniform funding decisions.",
"Persistent regional disparities could widen outcome gaps."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive specialised centres across provinces offering surgery, systemic therapy, radiotherapy, endoscopy, multidisciplinary care."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced molecular testing (KRAS/NRAS/BRAF, MSI/dMMR, PIK3CA) widely available in tertiary centres and integrated into care pathways."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced therapies broadly accessible; some provincial variability for novel agents."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national/provincial funding; active investigator-initiated and industry trials."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Sustained public health campaigns and provincial outreach supporting screening and early detection."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High relative survival reflecting early detection and comprehensive care."},
            "Early_Detection": {"score": "5/5", "disc": "Organized FIT/FOBT screening programs in most provinces (commonly starting at age 50) supporting earlier-stage diagnosis."},
            "Palliative_Care": {"score": "5/5", "disc": "Integrated palliative and supportive care services widely available; regional intensity may vary."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "80%", "disc": "High utilization for treatment decision-making."},
            "NRAS_mutations": {"score": "40%", "disc": "Moderate utilization depending on panel and setting."},
            "BRAF_V600E_mutations": {"score": "35%", "disc": "Moderate utilization; informs specific targeted strategies."},
            "MSI/dMMR": {"score": "38%", "disc": "Routinely tested in many centres; variability in reflex testing policies."},
            "PIK3CA_mutations": {"score": "35%", "disc": "Used in select contexts and panels."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "High adherence to provincial and national guidelines."},
            "Feasibility": {"score": "5/5", "disc": "Integration feasible across tertiary and many regional centres."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Active engagement; guidelines updated as evidence evolves."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "ESMO recommendations largely reflected in Canadian practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Core care covered by provincial plans, but coverage for some new targeted therapies/companion diagnostics varies by province."},
            "No-cost_Access": {"score": "2/5", "disc": "Universal coverage for many services; advanced diagnostics or novel agents may require special approvals or incur costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Organized FIT/FOBT", "disc": "Most provinces run organized screening programs (typically starting at age 50) with program maturity and follow-up coordination varying by province."}
        }
    },


    {
        "id": 129,
        "cancer_type": "colorectal",
        "country": "Chile",
        "country_shortForm": "CL",
        "introduction": "Colorectal cancer (CRC) is among the leading causes of cancer-related deaths in Chile. Specialized centers are established in major cities, but access outside urban areas remains uneven. Molecular testing infrastructure is developing, with moderate availability of key biomarkers (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) in tertiary hospitals and private facilities. Treatment access is limited in some regions, with advanced therapies not uniformly available. Clinical guidelines are well integrated and aligned with international standards (ESMO/NCCN), though challenges remain in translating them effectively across smaller hospitals. Screening efforts are stronger than in many regional peers, with a national FIT-based program for people aged 50–75 every two years. Palliative care services are present but vary in accessibility. Overall, colorectal cancer care in Chile demonstrates moderate maturity (level 3), with notable progress in guidelines and screening but gaps in equitable treatment access, reimbursement, and molecular testing utilization.",
        "swot_analysis": {
            "Strengths":
                ["National screening program (FIT) for people aged 50–75.",
"Moderate infrastructure for genetic and molecular testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA).",
"Clinical guidelines are well implemented and aligned with international standards.",
"Research funding is present, with local academic contributions.",
"Growing awareness campaigns supporting early detection."
],

            "Weaknesses":
                ["Treatment access limited in some regions, particularly for advanced therapies.",
"Reimbursement and no-cost access remain weak, leading to significant out-of-pocket costs.",
"Palliative care services unevenly distributed.",
"Rural populations face barriers to timely diagnosis and specialist treatment."
],

            "Opportunities": 
                ["Expand access to molecular diagnostics across all regions.",
"Strengthen palliative care integration into cancer services.",
"Improve equitable access to advanced therapies under public coverage.",
"Leverage telemedicine to expand oncology expertise to underserved areas.",
"Increase participation in international clinical trials for CRC."
],

            "Threats": 
                ["Rising CRC incidence could strain already limited oncology resources.",
"Socioeconomic disparities risk perpetuating unequal access between public and private sectors.",
"Limited reimbursement for advanced therapies may hinder adoption of innovations.",
"Workforce shortages in oncology, pathology, and gastroenterology outside major centers."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Centers in urban hubs; rural coverage weaker."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS, NRAS, BRAF, MSI/dMMR available, but uneven beyond tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Access limited in some regions; inequities in advanced therapies."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate; academic institutions engaged in CRC research."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Public health campaigns exist, but uptake varies."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate; improved by screening but challenged by late diagnoses in underserved areas."},
            "Early_Detection": {"score": "3/5", "disc": "National FIT program every 2 years (ages 50–75)."},
            "Palliative_Care": {"score": "3/5", "disc": "Services present but with uneven regional availability."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "55%", "disc": "Commonly tested in tertiary/private centers."},
            "NRAS_mutations": {"score": "25%", "disc": "Limited availability."},
            "BRAF_V600E_mutations": {"score": "20%", "disc": "Restricted to select centers."},
            "MSI/dMMR": {"score": "15%", "disc": "Mainly available in academic/research settings."},
            "PIK3CA_mutations": {"score": "15%", "disc": "Limited testing capacity."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well established in tertiary settings."},
            "Feasibility": {"score": "4/5", "disc": "Good feasibility in urban centers; smaller hospitals still lag."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Major centers update regularly; smaller hospitals slower."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Well integrated in advanced CRC care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; advanced therapies often excluded."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients face significant out-of-pocket expenses."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT-based", "disc": "FIT offered every 2 years for ages 50–75; no universal colonoscopy-based program."}
        }
    },


    {
        "id": 130,
        "cancer_type": "colorectal",
        "country": "Colombia",
        "country_shortForm": "CO",
        "introduction": "Colorectal cancer (CRC) is an emerging public health concern in Colombia, with incidence gradually increasing as life expectancy and lifestyle-related risk factors rise. While specialized oncology centers exist in major urban areas, rural and underserved regions face significant access barriers. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available but largely concentrated in tertiary and private centers. Treatment access is uneven, with strong disparities between public and private sectors. Clinical guidelines exist, partially aligned with international standards, and moderately implemented in well-equipped centers. Reimbursement mechanisms are limited, leaving patients with high out-of-pocket expenses. Screening is guided by national recommendations but remains opportunistic or regionally variable, without a cohesive national population-based program. Overall, Colombia demonstrates moderate but uneven maturity in colorectal cancer care, with key gaps in equitable treatment access, systematic early detection, and broad molecular diagnostic availability.",
        "swot_analysis": {
            "Strengths":
                ["Specialized oncology centers available in major cities.",
"National clinical guidelines exist and moderately align with international standards.",
"Availability of key biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) in tertiary/private facilities.",
"Growing awareness of CRC and its risk factors through public health messaging."
],

            "Weaknesses":
                ["Limited treatment access, particularly in public hospitals and rural regions.",
"Screening programs are not population-based, mainly opportunistic or fragmented.",
"Research funding is modest, with few large-scale national initiatives.",
"Palliative care remains limited in coverage and integration.",
"Financial barriers persist due to partial reimbursement and high out-of-pocket burden."
],

            "Opportunities": 
                ["Expansion of molecular diagnostics to guide targeted therapies more broadly.",
"Strengthen awareness campaigns focused on prevention, lifestyle changes, and early detection.",
"Development of regional pilots for organized CRC screening (FOBT/FIT/colonoscopy).",
"Broaden inclusion of Colombian patients in global and regional CRC clinical trials.",
"Expansion of telemedicine for specialist oncology consultations in underserved regions."
],

            "Threats": 
                ["Rising incidence could overwhelm current oncology capacity.",
"Budget limitations risk delaying adoption of novel therapies and diagnostics.",
"Growing disparity between public and private healthcare may worsen inequities.",
"Workforce shortages in oncology, gastroenterology, and pathology outside urban areas.",
"Weak screening infrastructure may lead to persistently high late-stage diagnosis rates."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Oncology centers exist in major urban hubs; rural access is weak."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS/NRAS/BRAF/MSI testing available in tertiary/private labs; access uneven."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Major disparities; access to modern therapies limited in public system."},
            "Research_Funding": {"score": "2/5", "disc": "Modest; some academic studies but limited large-scale investment."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Awareness present but fragmented; low impact in rural areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Lower than global averages due to late detection and treatment gaps."},
            "Early_Detection": {"score": "2/5", "disc": "National guidelines exist, but screening largely opportunistic/patchy."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited integration; opioid availability and access remain challenges."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "50%", "disc": "Moderately available in tertiary/private centers."},
            "NRAS_mutations": {"score": "25%", "disc": "Limited availability."},
            "BRAF_V600E_mutations": {"score": "20%", "disc": "Available in select advanced centers."},
            "MSI/dMMR": {"score": "15%", "disc": "Testing present but not routine; limited to advanced institutions."},
            "PIK3CA_mutations": {"score": "15%", "disc": "Rarely available; mainly research/private sector."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderate implementation in tertiary centers; weaker in smaller hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Possible in urban hubs; challenging in low-resource areas."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial adoption of ESMO/NCCN; varies by institution."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Some uptake of updates; smaller centers lag behind."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially integrated, mainly for advanced disease management."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited insurance coverage; advanced therapies underfunded."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket costs significant; few subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic/regional", "disc": "Guidelines exist, but implementation is fragmented; no national population-based program."}
        }
    },


    {
        "id": 131,
        "cancer_type": "colorectal",
        "country": "Egypt",
        "country_shortForm": "EG",
        "introduction": "Colorectal cancer (CRC) is an emerging public health concern in Egypt, with rising incidence due to lifestyle factors and increased longevity. Access to specialized oncology services exists in major urban centers such as Cairo and Alexandria, but rural areas face significant gaps in diagnostic and treatment access. Molecular testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available in some tertiary and private centers, but not widely accessible across the country. Clinical guidelines are in place, with moderate adoption, though integration with ESMO recommendations is partial. Awareness and early detection remain weak, with no organized screening program; opportunistic screening is limited to urban clinics. Reimbursement systems provide partial support, but patients often face substantial out-of-pocket costs. Palliative care is underdeveloped, particularly outside metropolitan areas. Overall, colorectal cancer care in Egypt demonstrates a moderate maturity (Level 3), with notable progress in guideline adoption and biomarker testing, but significant inequities in access, early detection, and financial protection.",
        "swot_analysis": {
            "Strengths":
                ["Specialized oncology centers in urban hubs (Cairo, Alexandria).",
"Availability of molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) in tertiary/private settings.",
"National clinical guidelines exist with moderate integration into practice.",
"Growing medical research activity, albeit limited in scale."
],

            "Weaknesses":
                ["Limited access to treatment outside major cities.",
"Awareness campaigns and public health education on CRC are underdeveloped.",
"Survival rates remain below global standards due to late-stage diagnoses.",
"Palliative care services are underfunded and unevenly distributed.",
"High out-of-pocket burden for diagnostics and advanced therapies."
],

            "Opportunities": 
                ["Expand molecular diagnostics across the public sector for precision therapy.",
"Establish pilot screening programs (fecal occult blood test, colonoscopy) for high-risk populations.",
"Enhance awareness campaigns to encourage early detection.",
"Increase participation in multinational clinical trials.",
"Strengthen palliative care integration into oncology pathways."
],

            "Threats": 
                ["Rising CRC incidence may outpace healthcare system capacity.",
"Financial constraints could limit adoption of newer therapies.",
"Persistent rural–urban disparities may worsen inequities.",
"Workforce shortages in oncology, pathology, and gastroenterology."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Present in major cities; rural access remains poor."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Available in tertiary/private centers; uneven national access."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in urban hospitals; rural inequities persist."},
            "Research_Funding": {"score": "2/5", "disc": "Limited funding; modest academic activity."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Weak public awareness; low screening uptake."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "/5", "disc": "Survival below global averages due to late diagnosis."},
            "Early_Detection": {"score": "/5", "disc": "Opportunistic only; no structured national program."},
            "Palliative_Care": {"score": "/5", "disc": "Limited coverage, especially outside urban hubs."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "%", "disc": "Most widely used molecular marker."},
            "NRAS_mutations": {"score": "%", "disc": "Limited to select centers."},
            "BRAF_V600E_mutations": {"score": "%", "disc": "Rare testing capacity."},
            "MSI/dMMR": {"score": "%", "disc": "Very limited, mostly academic or private sector."},
            "PIK3CA_mutations": {"score": "%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderately implemented in tertiary settings."},
            "Feasibility": {"score": "3/5", "disc": "Achievable in equipped centers; smaller hospitals face barriers."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with NCCN/ESMO."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Larger hospitals update; lag in smaller centers."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Only partial integration, mainly for advanced cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Some public coverage; advanced therapies underfunded."},
            "No-cost_Access": {"score": "2/5", "disc": "Many patients face high out-of-pocket burden."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "Screening limited to urban centers; no national program."}
        }
    },


    {
        "id": 132,
        "cancer_type": "colorectal",
        "country": "Ethiopia",
        "country_shortForm": "ET",
        "introduction": "Colorectal cancer (CRC) care in Ethiopia remains at a very early stage of maturity, with significant barriers across infrastructure, diagnostics, treatment, and access. Specialized centers are extremely limited, and advanced diagnostics such as molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) are scarcely available, often confined to research or pilot projects. Treatment access is constrained by limited oncology capacity, shortages in trained specialists, and urban–rural disparities. National clinical guidelines for CRC are lacking, and integration with international standards is minimal. Screening is absent at the population level, with very limited opportunistic detection. Financial protection is weak, with high out-of-pocket costs and minimal reimbursement support. Overall, colorectal cancer care in Ethiopia demonstrates very low maturity, but early initiatives in awareness, research partnerships, and capacity building create opportunities for gradual strengthening.",
        "swot_analysis": {
            "Strengths":
                ["Growing recognition of colorectal cancer as a rising health concern.",
"Some academic and research-driven initiatives beginning to generate local data.",
"Opportunity to build on existing tertiary cancer care hubs (e.g., Black Lion Hospital, Addis Ababa)."
],

            "Weaknesses":
                ["Extremely limited infrastructure for specialized cancer care.",
"Minimal availability of molecular diagnostics and biomarker testing.",
"Lack of population-based or organized screening programs.",
"Survival rates remain very low due to late presentation and delayed diagnosis.",
"Weak palliative care services, with limited opioid access and integration.",
"Absence of structured national CRC clinical guidelines and low feasibility of integration in current facilities"
],

            "Opportunities": 
                ["Strengthen cancer registry and surveillance for better policy planning.",
"Partnerships with international organizations for research, training, and capacity building.",
"Introduction of affordable biomarker testing (KRAS, MSI) to guide therapy decisions.",
"Leverage telemedicine and task-shifting models to expand oncology expertise.",
"Develop pilot screening projects targeting high-risk populations in urban areas."
],

            "Threats": 
                ["Rapidly rising CRC incidence may overwhelm fragile health infrastructure.",
"Severe budgetary constraints may limit access to therapies and diagnostics.",
"Workforce shortages in oncology and gastroenterology hinder service expansion.",
"Persistent urban–rural inequities in access to cancer care.",
"Dependence on external aid for diagnostics and treatment programs could restrict sustainability."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Only a few tertiary hospitals provide cancer care; rural access negligible."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Very limited; basic biomarker testing largely unavailable."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Minimal access; constrained by shortages in oncology workforce and therapies."},
            "Research_Funding": {"score": "1/5", "disc": "Very limited; mainly external collaborations."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Sparse and localized; public knowledge of CRC remains low."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Among the lowest globally; most cases diagnosed late."},
            "Early_Detection": {"score": "1/5", "disc": "No organized screening; opportunistic detection minimal."},
            "Palliative_Care": {"score": "1/5", "disc": "Very limited; opioid access and integration remain major barriers."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "20%", "disc": "Available in select pilot/research settings."},
            "NRAS_mutations": {"score": "5%", "disc": "Rarely available."},
            "BRAF_V600E_mutations": {"score": "5%", "disc": "Rarely tested."},
            "MSI/dMMR": {"score": "1%", "disc": "Almost unavailable."},
            "PIK3CA_mutations": {"score": "1%", "disc": "Extremely limited access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "/5", "disc": "No national CRC guidelines currently in use."},
            "Feasibility": {"score": "/5", "disc": "Integration not feasible in most facilities."},
            "Adoption_International_Guideline": {"score": "/5", "disc": "Very limited use of ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "/3", "disc": "Minimal; limited to international collaborations."},
            "ESMO_Guidelines": {"score": "/5", "disc": "Rarely applied."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Almost no insurance or subsidy for advanced CRC care."},
            "No-cost_Access": {"score": "1/5", "disc": "Patients pay out-of-pocket for most diagnostics and treatment."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "None", "disc": "No national screening; infrastructure highly limited."}
        }
    },


    {
        "id": 133,
        "cancer_type": "colorectal",
        "country": "Germany",
        "country_shortForm": "DE",
        "introduction": "Germany has a well-established colorectal cancer (CRC) care system with high levels of infrastructure, organized screening programs, and broad access to modern diagnostics and treatment. Specialized centers are widely available, and molecular biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) is routine in both urban and rural settings. Clinical guidelines are highly implemented and closely aligned with international standards. Screening is organized nationally, improving early detection and survival rates. Despite high reimbursement and insurance coverage, some out-of-pocket costs remain. Overall, colorectal cancer care in Germany shows high maturity, though continuous updates and technology adoption remain essential to maintain leadership in care standards.",
        "swot_analysis": {
            "Strengths":
                ["Extensive network of specialized centers across urban and rural areas.",
"High availability of molecular diagnostics and routine biomarker testing.",
"Well-established national clinical guidelines with strong implementation.",
"Organized population-based screening programs (FIT annually, colonoscopy every 10 years).",
"Strong research funding and active clinical trials contributing to innovations in care.",
"Comprehensive awareness campaigns improving early detection and patient engagement."
],

            "Weaknesses":
                ["Some out-of-pocket costs persist despite insurance coverage.",
"Uptake of novel therapies may lag slightly in smaller or rural hospitals.",
"Engagement with guideline updates requires continuous effort to maintain consistency across all centers."
],

            "Opportunities": 
                ["Expand personalized medicine approaches based on advanced biomarker profiling.",
"Leverage digital health and AI for risk stratification and predictive modeling.",
"Increase outreach in underserved populations to further improve early detection.",
"Integrate novel therapeutics and targeted therapies into standard care pathways."
],

            "Threats": 
                ["Rising incidence of colorectal cancer in aging populations could stress resources.",
"Budgetary constraints for cutting-edge treatments may create disparities if not managed.",
"Workforce shortages in oncology and gastroenterology could affect service delivery in some regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Extensive network in both urban and rural areas."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing widely available and routinely used."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Broad availability of standard and advanced therapies."},
            "Research_Funding": {"score": "5/5", "disc": "Strong, supporting local and international trials."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Comprehensive campaigns contributing to early detection."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and advanced therapies."},
            "Early_Detection": {"score": "5/5", "disc": "Organized national screening program (FIT, colonoscopy)."},
            "Palliative_Care": {"score": "5/5", "disc": "Well-developed services across the country."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "85%", "disc": "Routinely tested in relevant CRC patients."},
            "NRAS_mutations": {"score": "50%", "disc": "Standard practice in metastatic CRC evaluation."},
            "BRAF_V600E_mutations": {"score": "45%", "disc": "Frequently tested; informs therapy selection."},
            "MSI/dMMR": {"score": "35%", "disc": "Used for immunotherapy eligibility and prognosis."},
            "PIK3CA_mutations": {"score": "38%", "disc": "Tested in select cases for research and therapy guidance."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines fully integrated in most centers."},
            "Feasibility": {"score": "5/5", "disc": "Easily implementable across hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular updates adopted nationally."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Integrated across care levels."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Mostly covered, some minor gaps."},
            "No-cost_Access": {"score": "3/5", "disc": "Mostly accessible through insurance; minor out-of-pocket costs"}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Organized program", "disc": "FIT annually (50–54 years); colonoscopy every 10 years from 55."}
        }
    },


    {
        "id": 134,
        "cancer_type": "colorectal",
        "country": "Greece",
        "country_shortForm": "GR",
        "introduction": "Colorectal cancer (CRC) is a major public health concern in Greece, with incidence steadily increasing. Specialized cancer centers and molecular testing infrastructure are well-developed in urban areas, though rural access remains limited. Biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is improving but unevenly applied across hospitals. Clinical guidelines are widely implemented and aligned with international standards, though smaller centers may lag in adoption. Reimbursement and no-cost access are moderate, while screening remains opportunistic, with no organized national program. Overall, colorectal cancer care in Greece demonstrates moderate maturity, with strong urban infrastructure but gaps in screening, rural access, and consistent biomarker testing.",
        "swot_analysis": {
            "Strengths":
                ["Well-established specialized cancer centers and molecular testing infrastructure in urban areas.",
"Access to standard CRC therapies and supportive care.",
"Clinical guidelines are broadly implemented and aligned with ESMO/NCCN standards.",
"Awareness of CRC is improving; opportunistic screening is growing."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing outside urban centers.",
"Screening remains opportunistic; no population-based national program.",
"Rural populations may face barriers to specialized care and timely diagnosis.",
"Engagement with guideline updates is moderate, particularly in smaller hospitals."
],

            "Opportunities": 
                ["Expand organized screening programs for early CRC detection.",
"Strengthen molecular testing for biomarker-driven therapies across all hospitals.",
"Increase public awareness campaigns, particularly in underserved regions.",
"Integrate telemedicine and outreach programs for rural populations.",
"Encourage participation in international clinical trials to access innovative treatments."
],

            "Threats": 
                ["Rising incidence of CRC may strain existing healthcare infrastructure.",
"Budgetary constraints could limit adoption of advanced diagnostics and therapies.",
"Unequal access between urban and rural centers could widen disparities.",
"Workforce shortages in oncology, pathology, and genetic counseling may impact care quality."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Strong urban centers; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Advanced biomarker testing available in tertiary hospitals; still uneven in smaller centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies accessible; some regional disparities."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate; local studies support clinical practice."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Opportunistic campaigns exist; awareness increasing."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; early detection improving in urban areas."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic screening; no organized program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available; generally accessible in tertiary centers."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "70%", "disc": "Widely tested in urban tertiary centers."},
            "NRAS_mutations": {"score": "35%", "disc": "Limited access outside major hospitals."},
            "BRAF_V600E_mutations": {"score": "30%", "disc": "Restricted to tertiary hospitals."},
            "MSI/dMMR": {"score": "25%", "disc": "Limited, mainly in specialized centers."},
            "PIK3CA_mutations": {"score": "25%", "disc": "Low access; mostly in research/tertiary hospitals."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well-implemented across urban centers."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in major hospitals; smaller centers may face challenges."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Aligned with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Moderate; smaller centers slower to adopt updates."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Broadly integrated, especially for advanced/metastatic CRC."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate coverage under national insurance; some gaps for advanced care."},
            "No-cost_Access": {"score": "3/5", "disc": "Available in part; some out-of-pocket costs remain."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic", "disc": "No organized national program; awareness and opportunistic screening are increasing."}
        }
    },


    {
        "id": 135,
        "cancer_type": "colorectal",
        "country": "India",
        "country_shortForm": "IN",
        "introduction": "Colorectal cancer (CRC) is an emerging cancer burden in India, with increasing incidence linked to urbanization, dietary changes, and lifestyle risk factors. Specialized cancer centers exist in most major metros, supported by tertiary hospitals and regional oncology institutes, though rural populations remain underserved. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available but largely restricted to advanced tertiary centers and private laboratories, limiting equitable access. Clinical guidelines exist and are moderately implemented, partially aligned with international standards (NCCN, ESMO), but implementation varies widely across the country. Screening is opportunistic, mostly via colonoscopy or FOBT/FIT in private settings, with no national program in place. Treatment access is fair in cities, with surgery, chemotherapy, and radiotherapy widely available, but significant disparities remain in rural and lower-resource areas. Research funding is modest, with several academic studies contributing to regional datasets. Reimbursement coverage is very limited, and high out-of-pocket spending remains a major barrier. Overall, colorectal cancer care in India demonstrates moderate maturity (level 3) — with strengths in specialized centers, research presence, and treatment infrastructure, but major gaps in reimbursement, systematic screening, and equitable access to molecular diagnostics.",
        "swot_analysis": {
            "Strengths":
                ["Wide availability of tertiary cancer centers in major metros (AIIMS, Tata Memorial, regional institutes).",
"Standard CRC treatments (surgery, radiotherapy, chemotherapy) available in most urban hospitals.",
"National and institutional guidelines exist, with moderate adherence in larger centers.",
"Biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR) increasingly available in advanced centers.",
"Active academic research presence, generating local CRC epidemiological and molecular data."
],

            "Weaknesses":
                ["No organized national screening program; early detection remains opportunistic.",
"Limited penetration of advanced biomarker testing outside urban hubs.",
"Rural and low-income populations face major access and affordability barriers.",
"Reimbursement and no-cost access are minimal; patients rely heavily on out-of-pocket payments.",
"Palliative care coverage remains patchy, with uneven opioid access."
],

            "Opportunities": 
                ["Expand biomarker and genetic testing to secondary and regional centers.",
"Establish population-based CRC screening programs (e.g., FIT or colonoscopy for high-risk groups).",
"Integrate palliative care into national cancer programs with stronger opioid accessibility.",
"Leverage India’s strong digital health ecosystem for CRC awareness and early detection outreach.",
"Encourage inclusion of Indian patients in international CRC clinical trials."
],

            "Threats": 
                ["Rising incidence of CRC may overburden already stretched tertiary hospitals.",
"Inequity between public and private sector care could widen further.",
"High costs of advanced therapies (targeted agents, immunotherapy) may remain unaffordable without stronger reimbursement.",
"Workforce gaps in oncology and gastroenterology, particularly in non-metro regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Major metros have strong oncology hubs; rural areas underserved."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS/NRAS/BRAF/MSI testing available in tertiary/private labs; limited access outside cities."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies widely available in cities; inequities in rural regions."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing academic activity; modest international trial participation."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Growing but limited national reach; awareness higher in urban settings."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate; survival impacted by late-stage diagnosis."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic colonoscopy/FOBT/FIT; no organized national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services exist in larger hospitals; rural coverage limited."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "40%", "disc": "Most widely used biomarker."},
            "NRAS_mutations": {"score": "15%", "disc": "Limited testing."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Minimal access."},
            "MSI/dMMR": {"score": "5%", "disc": "Rarely tested; mainly research/tertiary settings."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Very limited testing."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderate adherence in tertiary centers."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in larger centers; limited elsewhere."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with NCCN/ESMO."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Major centers update regularly; others lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Limited integration, especially outside advanced centers."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal coverage; patients often pay out-of-pocket."},
            "No-cost_Access": {"score": "1/5", "disc": "Very limited subsidy schemes; inequitable access."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No national CRC screening program; testing largely private-sector driven."}
        }
    },


    {
        "id": 136,
        "cancer_type": "colorectal",
        "country": "Indonesia",
        "country_shortForm": "ID",
        "introduction": "Colorectal cancer (CRC) is an emerging health challenge in Indonesia, with increasing incidence due to lifestyle changes and aging populations. Specialized cancer centers are limited and concentrated in major urban areas, leaving rural populations underserved. Advanced diagnostics and molecular testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) are available only in select tertiary or private hospitals. Clinical guidelines exist but adoption is moderate and often limited by infrastructure and training gaps. Reimbursement coverage is partial, and out-of-pocket expenses are common. Screening is opportunistic, mainly through FIT or colonoscopy in private hospitals, with no organized national program. Overall, CRC care in Indonesia shows low to moderate maturity, with gaps in infrastructure, molecular testing, early detection, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers exist in major cities, providing standard treatments.",
"Molecular testing for KRAS, NRAS, and BRAF is available in tertiary/private centers.",
"Some awareness campaigns and opportunistic screening exist in urban populations"
],

            "Weaknesses":
                ["Limited access to specialized centers in rural regions.",
"Low uptake of molecular diagnostics outside major hospitals.",
"Screening is opportunistic; no national population-based program.",
"Clinical guideline implementation is inconsistent across hospitals.",
"Partial reimbursement coverage; high out-of-pocket burden for patients."
],

            "Opportunities": 
                ["Expand access to molecular diagnostics for precision therapy.",
"Develop national colorectal cancer screening programs.",
"Strengthen public awareness and early detection initiatives.",
"Improve training and adoption of international guidelines in regional hospitals.",
"Leverage telemedicine for rural patient access to oncology expertise."
],

            "Threats": 
                ["Rising incidence may strain limited healthcare resources.",
"Budgetary constraints could restrict access to advanced diagnostics and therapies.",
"Inequities between public and private sectors may persist or worsen.",
"Workforce shortages in oncology and gastroenterology outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Centers concentrated in major cities; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Available only in tertiary/private hospitals; uneven access."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in urban centers; rural coverage limited."},
            "Research_Funding": {"score": "2/5", "disc": "Limited local research; few clinical studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Low public awareness; campaigns mainly urban-focused."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival lower than regional benchmarks; late diagnosis common."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic FIT/colonoscopy in private hospitals; no organized program."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited services; rural areas underserved."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "45%", "disc": "Moderate availability in tertiary/private centers."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited access."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Rarely available."},
            "MSI/dMMR": {"score": "5%", "disc": "Minimal access; mostly research or private hospitals."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Very limited access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Moderate adoption; inconsistent across hospitals"},
            "Feasibility": {"score": "2/5", "disc": "Feasible in tertiary centers; limited in smaller hospitals."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Slow uptake of updates."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Limited integration; mainly urban centers."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial; many patients pay out-of-pocket."},
            "No-cost_Access": {"score": "2/5", "disc": "Minimal; subsidies limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic FIT/colonoscopy", "disc": "No national program; mainly offered through private hospitals."}
        }
    },


    {
        "id": 137,
        "cancer_type": "colorectal",
        "country": "Italy",
        "country_shortForm": "IT",
        "introduction": "Italy has a relatively advanced colorectal cancer (CRC) care system, with strong infrastructure, high-quality specialized centers, and widespread access to diagnostics and treatment. Molecular biomarker testing is well established in tertiary centers, supporting personalized therapy approaches. Clinical guidelines are fully implemented, and screening programs are in place regionally using FIT tests. Reimbursement and no-cost access are moderate, with some regional differences. Overall, colorectal cancer care in Italy shows high capability in urban and regional hubs but with room for improvement in harmonizing access across all regions, thus reflecting a moderate maturity level.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive specialized centers with high-quality CRC care.",
"Full implementation of national and international clinical guidelines (ESMO, NCCN).",
"Availability of advanced molecular biomarker testing for personalized therapy.",
"Regional colorectal screening programs using FIT every 2 years (ages 50–69).",
"Strong survival rates and relatively early detection due to organized screening."
],

            "Weaknesses":
                ["Access to care and screening can vary regionally.",
"Some biomarkers (MSI/dMMR, PIK3CA) less consistently applied outside tertiary centers.",
"Reimbursement and no-cost access are moderate, leading to potential out-of-pocket costs in some areas."
],

            "Opportunities": 
                ["Expand uniform national coverage of screening programs across all regions.",
"Increase access to advanced molecular testing in smaller or rural centers.",
"Strengthen public awareness campaigns on CRC risk factors and early detection.",
"Enhance integration of emerging biomarkers into routine clinical practice."
],

            "Threats": 
                ["Regional disparities in care delivery may affect equity.",
"Rising incidence of CRC could challenge resource allocation.",
"Budget constraints could limit access to emerging therapies or diagnostic innovations."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "High-quality centers widely available in urban and regional hubs."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing infrastructure in tertiary and major centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Broad access to standard and advanced therapies; some regional variation."},
            "Research_Funding": {"score": "4/5", "disc": "Strong research support; clinical trials integrated into tertiary care."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Public campaigns ongoing; variable uptake regionally."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and treatment quality."},
            "Early_Detection": {"score": "4/5", "disc": "Regional FIT screening programs in place; age-targeted."},
            "Palliative_Care": {"score": "4/5", "disc": "Good coverage; integrated into cancer care pathways."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "80%", "disc": "Widely tested for therapy selection."},
            "NRAS_mutations": {"score": "45%", "disc": "Moderate testing; mainly in tertiary centers."},
            "BRAF_V600E_mutations": {"score": "40%", "disc": "Available in selected centers."},
            "MSI/dMMR": {"score": "30%", "disc": "Limited outside tertiary care."},
            "PIK3CA_mutations": {"score": "35%", "disc": "Testing mainly in specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines fully adopted across hospitals."},
            "Feasibility": {"score": "5/5", "disc": "Highly feasible in all major centers."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Full alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Updates rapidly integrated."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated in advanced care pathways."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial national coverage; some out-of-pocket costs remain."},
            "No-cost_Access": {"score": "3/5", "disc": "Available in most regions; disparities exist."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT every 2 years", "disc": "Regional programs for ages 50–69; coverage varies."}
        }
    },


    {
        "id": 138,
        "cancer_type": "colorectal",
        "country": "Japan",
        "country_shortForm": "JP",
        "introduction": "Colorectal cancer is one of the most common malignancies in Japan, and the country has built a highly advanced system for its detection, treatment, and management. National colorectal cancer screening using annual fecal occult blood testing (FOBT) followed by colonoscopy is well established, contributing to higher survival outcomes compared to global averages. Specialized centers and advanced molecular diagnostics are widely available in urban and regional hubs. Japan has strong investment in research and awareness campaigns, coupled with robust palliative care. However, reimbursement gaps remain for advanced therapies and molecular testing, which can impose financial burdens on some patients. Overall, colorectal cancer care in Japan demonstrates high maturity, with notable strengths in screening, infrastructure, survival outcomes, and awareness, but moderate challenges in reimbursement and equitable access to next-generation targeted therapies.",
        "swot_analysis": {
            "Strengths":
                ["Extensive network of specialized cancer centers with advanced diagnostic and treatment facilities.",
"National organized screening program (annual FOBT + colonoscopy).",
"High survival rates due to early detection and strong treatment protocols.",
"Robust research funding and innovation in oncology.",
"Strong public awareness campaigns leading to high participation in screening.",
"Well-established palliative care services."
],

            "Weaknesses":
                ["Limited reimbursement coverage for some molecular and targeted therapies.",
"Out-of-pocket costs remain a concern despite universal health coverage.",
"Engagement with international guidelines is partial, with slower uptake in certain updates.",
"Rural areas may face longer waiting times for advanced testing and specialist consultations."
],

            "Opportunities": 
                ["Expand reimbursement for next-generation sequencing and targeted therapies.",
"Increase use of molecular biomarkers (KRAS, NRAS, BRAF, MSI/dMMR) in standard care pathways.",
"Strengthen integration with international guideline updates (ESMO, NCCN).",
"Further leverage Japan’s strong clinical trial ecosystem for global innovation leadership."
],

            "Threats": 
                ["Aging population leading to rising colorectal cancer incidence and system burden.",
"Increasing cost pressures on the health system with adoption of novel therapies.",
"Workforce strain in oncology and gastroenterology due to high demand."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive network of advanced centers across Japan."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Widely available; strong infrastructure in tertiary and regional centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "High access to surgery, chemo, radiotherapy; some gaps in novel drug reimbursement."},
            "Research_Funding": {"score": "4/5", "disc": "Strong national funding and clinical trial participation."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Extensive campaigns drive high screening participation."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "Among the best globally due to early detection and advanced care."},
            "Early_Detection": {"score": "4/5", "disc": "National FOBT program effective; colonoscopy access strong but not universal."},
            "Palliative_Care": {"score": "5/5", "disc": "Well-integrated services with high opioid accessibility."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "20%", "disc": "Increasingly used for therapy guidance."},
            "NRAS_mutations": {"score": "15%", "disc": "Available in tertiary centers."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Used in targeted treatment planning."},
            "MSI/dMMR": {"score": "5%", "disc": "rowing role in immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "3%", "disc": "Rarely tested; mainly research or advanced cases."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Strong implementation in major hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in most facilities."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates adopted with some delay."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially integrated; Japanese guidelines remain dominant."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited for advanced diagnostics/targeted therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Universal coverage exists, but patient co-payments still apply."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Yes (annual FOBT + colonoscopy follow-up)", "disc": "Strong program with high participation and impact on early detection."}
        }
    },


    {
        "id": 139,
        "cancer_type": "colorectal",
        "country": "Kenya",
        "country_shortForm": "KE",
        "introduction": "Colorectal cancer is an emerging health concern in Kenya, with incidence steadily rising due to lifestyle changes, urbanization, and improved detection in urban hospitals. However, systematic detection and equitable access to care remain very limited. Specialized oncology centers are concentrated in Nairobi and select urban areas, while rural regions lack adequate infrastructure. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is rarely available outside a few private and tertiary facilities. Treatment options are constrained by limited availability of surgical oncology expertise, chemotherapy, and radiotherapy, particularly in public hospitals. Clinical guideline implementation is weak and only partially aligned with international standards, with major gaps in integration and regular updates. Screening is opportunistic and mostly limited to urban clinics, with no national screening program. Overall, colorectal cancer care in Kenya demonstrates low-to-moderate maturity (Level 2), with significant challenges in early detection, biomarker utilization, treatment access, and affordability.",
        "swot_analysis": {
            "Strengths":
                ["Presence of oncology services and tertiary hospitals in Nairobi and select cities.",
"Availability of some standard therapies (surgery, chemotherapy, radiotherapy) in higher-tier facilities.",
"Emerging diagnostic capabilities, with limited access to molecular biomarkers (KRAS, NRAS).",
"Growing awareness of cancer burden at national policy level."
],

            "Weaknesses":
                ["Limited specialized cancer centers, especially outside urban hubs.",
"Minimal biomarker testing (low availability of BRAF, MSI, PIK3CA).",
"No national screening program; early detection is rare.",
"Survival outcomes poor due to late-stage presentation.",
"Weak palliative care integration and opioid accessibility.",
"Low research funding and minimal participation in international trials.",
"High financial burden due to lack of reimbursement and subsidies."
],

            "Opportunities": 
                ["Expansion of molecular diagnostic services to improve targeted therapy access.",
"Development of cost-effective screening initiatives, e.g., fecal occult blood testing (FOBT) or FIT in high-risk groups.",
"Integration of colorectal cancer awareness campaigns into broader cancer control efforts.",
"Use of telemedicine to expand oncology expertise beyond urban hubs.",
"Regional collaboration with East African countries to pool expertise and resources."
],

            "Threats": 
                ["Rising incidence may strain already under-resourced health systems.",
"Workforce shortages in oncology, gastroenterology, and pathology.",
"Budgetary constraints limiting adoption of advanced diagnostics and therapies.",
"Persistent disparities between public and private sector access.",
"Risk of worsening late-stage diagnosis due to absent national screening program."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Oncology services concentrated in Nairobi and major cities; rural access minimal."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "KRAS and NRAS testing available in limited private/tertiary centers; others rare."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Standard therapies available only in select tertiary hospitals; rural access very limited."},
            "Research_Funding": {"score": "1/5", "disc": "Very modest, with minimal contribution to local or global data."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Limited campaigns; low public awareness, especially in rural areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Poor survival due to late-stage diagnosis and weak access to treatment."},
            "Early_Detection": {"score": "1/5", "disc": "No national program; opportunistic screening in urban/private clinics only."},
            "Palliative_Care": {"score": "1/5", "disc": "Weak coverage, poor opioid access, and limited integration into cancer care."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "30%", "disc": "Most commonly tested biomarker; available in few private facilities."},
            "NRAS_mutations": {"score": "10%", "disc": "Rarely performed; limited to select tertiary centers."},
            "BRAF_V600E_mutations": {"score": "5%", "disc": "Minimal availability."},
            "MSI/dMMR": {"score": "5%", "disc": "Rarely tested; mostly in research or pilot projects."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Very limited availability."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but weakly applied across facilities."},
            "Feasibility": {"score": "2/5", "disc": "Feasible only in major centers; rural facilities lack capacity."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN, limited in practice."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Minimal engagement; most smaller hospitals lag significantly."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Very limited, mostly in research or select tertiary settings."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal insurance coverage; most patients pay out-of-pocket."},
            "No-cost_Access": {"score": "1/5", "disc": "Very limited subsidy programs; access mostly self-funded."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No organized program; screening limited to urban/private settings."}
        }
    },


    {
        "id": 140,
        "cancer_type": "colorectal",
        "country": "Malaysia",
        "country_shortForm": "MY",
        "introduction": "Colorectal cancer (CRC) is a growing health concern in Malaysia, reflecting global trends in incidence. Specialized cancer centers and tertiary hospitals provide diagnosis and treatment predominantly in urban areas, while rural populations face limited access. Genetic and molecular testing for CRC (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is gradually expanding but unevenly available. Clinical guidelines exist and are moderately implemented, though engagement with guideline updates is limited. Reimbursement and no-cost access are insufficient, contributing to out-of-pocket costs for patients. Screening is opportunistic, mainly through FIT (fecal immunochemical test) or colonoscopy, with no organized national program. Overall, CRC care in Malaysia shows moderate maturity, with gaps in systematic early detection, molecular testing access, and equitable service distribution.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers exist in urban areas providing standard CRC treatment.",
"Moderate adoption of clinical guidelines and partial integration of international recommendations.",
"Molecular testing (KRAS, NRAS, BRAF, MSI/dMMR) is available in tertiary/private centers.",
"Opportunistic awareness campaigns contribute to early detection in urban populations."
],

            "Weaknesses":
                ["Limited access to advanced molecular diagnostics in smaller or rural hospitals.",
"Opportunistic rather than organized CRC screening programs.",
"Rural and lower-income populations face barriers to timely diagnosis and treatment.",
"Engagement with updates to clinical guidelines is low.",
"Financial burden remains moderate due to limited reimbursement and subsidies."
],

            "Opportunities": 
                ["Expand molecular testing access to improve personalized therapy.",
"Develop organized screening programs for high-risk and general populations.",
"Increase public awareness campaigns and community outreach.",
"Leverage telemedicine to extend oncology expertise to underserved areas.",
"Encourage participation in international clinical trials."
],

            "Threats": 
                ["Rising incidence could strain healthcare resources.",
"Budget constraints may restrict access to advanced diagnostics and targeted therapies.",
"Inequities between urban/private and rural/public healthcare sectors could worsen outcomes.",
"Workforce shortages in oncology and gastroenterology in non-urban regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Available in urban centers; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA testing available mostly in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available; regional disparities exist."},
            "Research_Funding": {"score": "2/5", "disc": "Modest funding; limited local clinical trials."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Campaigns exist; uptake varies across regions."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; late detection still common in rural areas."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic FIT/colonoscopy screening; no national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Available but unevenly distributed."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "65%", "disc": "Widely tested in tertiary/private centers."},
            "NRAS_mutations": {"score": "55%", "disc": "Available but not universal."},
            "BRAF_V600E_mutations": {"score": "50%", "disc": "Limited but emerging access."},
            "MSI/dMMR": {"score": "45%", "disc": "Available in select centers; aids treatment decisions."},
            "PIK3CA_mutations": {"score": "30%", "disc": "Limited access; mainly research settings."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderate adoption across hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in tertiary hospitals; smaller centers face challenges."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Slow uptake in smaller hospitals."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially integrated, especially for advanced/metastatic CRC."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage under national insurance; gaps remain."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket costs common; limited subsidies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic FIT/colonoscopy", "disc": "No organized national program; offered mainly through clinics."}
        }
    },


    {
        "id": 141,
        "cancer_type": "colorectal",
        "country": "Mexico",
        "country_shortForm": "MX",
        "introduction": "Colorectal cancer (CRC) is an increasing public health concern in Mexico, with rising incidence driven by lifestyle risk factors and aging populations. Specialized cancer centers exist in major cities, but rural populations face significant barriers to access. Advanced diagnostics such as molecular profiling (KRAS, NRAS, BRAF, MSI, PIK3CA) are available in select tertiary and private hospitals but are not widely distributed. Clinical guidelines exist and show moderate alignment with international standards, though uptake varies across healthcare tiers. Screening remains largely opportunistic, with growing but uneven use of fecal immunochemical test (FIT) in urban areas. Treatment and palliative care coverage remain limited, with reimbursement gaps creating financial strain. Overall, colorectal cancer care in Mexico shows low-to-moderate maturity (Level 2), with major gaps in early detection, treatment equity, and biomarker access across the population.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major metropolitan regions.",
"Access to molecular diagnostics (KRAS, NRAS, BRAF, MSI) in tertiary and private facilities.",
"National clinical guidelines exist, with moderate integration of ESMO standards.",
"Awareness campaigns gradually improving public understanding of CRC.",
"Research activity present in academic institutions."
],

            "Weaknesses":
                ["Treatment access uneven, with rural and low-income populations underserved.",
"No national organized screening program; detection relies on opportunistic testing.",
"Palliative care capacity is weak, with rural service shortages.",
"Financial burden remains high due to limited reimbursement and no-cost access.",
"Survival rates remain low compared to high-income countries, largely due to late-stage diagnoses."
],

            "Opportunities": 
                ["Expand organized CRC screening using FIT, especially for high-risk and underserved groups.",
"Broaden access to molecular diagnostics for personalized treatment.",
"Strengthen palliative care integration within the public health system.",
"Increase participation in international CRC clinical trials.",
"Leverage telehealth to extend oncology support to rural regions."
],

            "Threats": 
                ["Rising incidence may overwhelm limited oncology capacity.",
"Public–private disparities could deepen health inequities.",
"Budget constraints limit access to advanced therapies.",
"Workforce shortages in oncology and gastroenterology, especially outside urban areas.",
"Delayed adoption of guideline updates may affect quality of care."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Cancer centers exist in major cities; rural access remains weak."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS, NRAS, BRAF, MSI, PIK3CA testing available in tertiary/private centers but not widely distributed."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Significant inequities between urban and rural areas."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing but modest; mainly academic-driven."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Public campaigns increasing, but stigma and rural awareness gaps persist."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Lower than global benchmarks; late diagnosis common."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic FIT/colonoscopy; no national program."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited availability, particularly outside major hospitals."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "55%", "disc": "Most frequently tested biomarker in CRC."},
            "NRAS_mutations": {"score": "25%", "disc": "Available in tertiary hospitals."},
            "BRAF_V600E_mutations": {"score": "20%", "disc": "Limited access; mostly in specialized centers."},
            "MSI/dMMR": {"score": "15%", "disc": "Available in select tertiary/research settings."},
            "PIK3CA_mutations": {"score": "15%", "disc": "Limited access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines moderately adopted in tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in major centers; smaller hospitals face limitations."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Uptake improving, but smaller centers lag behind."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Integrated in part, especially in higher-tier hospitals."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; advanced therapies not widely included."},
            "No-cost_Access": {"score": "2/5", "disc": "High out-of-pocket burden; subsidies limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic", "disc": "No organized CRC screening program; FIT use growing in urban clinics."}
        }
    },


    {
        "id": 142,
        "cancer_type": "colorectal",
        "country": "Morocco",
        "country_shortForm": "MA",
        "introduction": "Colorectal cancer (CRC) is an increasing public health concern in Morocco, with rising incidence but still limited systematic detection and access to advanced diagnostics. Specialized cancer centers exist in major urban hubs (Casablanca, Rabat, Marrakech), but rural access remains weak. Advanced biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available only in select tertiary centers and private laboratories, restricting precision oncology access. National clinical guidelines exist but are weakly implemented, with limited alignment to international standards and poor engagement with updates. Reimbursement is partial, and patients often face out-of-pocket expenditures for advanced testing and therapies. Screening programs remain pilot-level, mainly using fecal occult blood test (FOBT), with no national population-based program. Overall, colorectal cancer care in Morocco shows moderate maturity (level 3), with strengths in established infrastructure and access to basic therapies, but major gaps in early detection, biomarker integration, and equity of care.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major urban hubs.",
"Basic diagnostic and treatment services (surgery, chemotherapy) available in tertiary hospitals.",
"Pilot screening initiatives (FOBT) in select regions.",
"Some biomarker testing (KRAS, NRAS, BRAF) available in tertiary/private centers."
],

            "Weaknesses":
                ["Limited access to molecular testing outside urban hubs.",
"No nationwide screening program; detection mainly late-stage.",
"Weak guideline implementation and low integration of ESMO/NCCN standards.",
"Insufficient funding for research and clinical trials.",
"Palliative care integration and opioid access remain limited."
],

            "Opportunities": 
                ["Scale up FOBT-based national screening for early detection.",
"Expand biomarker testing (especially MSI/dMMR) for immunotherapy eligibility.",
"Improve clinical guideline adoption and continuous updates.",
"Increase research collaborations and participation in international CRC trials.",
"Expand awareness campaigns for CRC prevention and early detection."
],

            "Threats": 
                ["Rising CRC incidence may overwhelm limited oncology capacity.",
"Inequalities between private and public sector services may widen.",
"Financial constraints and weak reimbursement limit patient access to modern therapies.",
"Workforce shortages, particularly in oncology and pathology, outside urban areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Centers available in major cities; rural areas underserved."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS/NRAS/BRAF available in tertiary/private centers; MSI and PIK3CA limited."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Basic therapies accessible; inequities remain outside urban hubs."},
            "Research_Funding": {"score": "2/5", "disc": "Limited national funding; few local CRC trials."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Sporadic campaigns; low public awareness."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Lower than global standards due to late-stage diagnosis."},
            "Early_Detection": {"score": "2/5", "disc": "Pilot FOBT screening only; no organized national program."},
            "Palliative_Care": {"score": "2/5", "disc": "Weakly integrated; opioid access limited."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "45%", "disc": "Moderately available in tertiary centers."},
            "NRAS_mutations": {"score": "15%", "disc": "Limited access."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Available in select centers."},
            "MSI/dMMR": {"score": "5%", "disc": "Very limited testing; restricts immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Rarely tested; research settings."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Weakly implemented; inconsistent adherence."},
            "Feasibility": {"score": "2/5", "disc": "Limited by infrastructure gaps."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial and inconsistent use of ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Very limited adoption of updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Minimal integration."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial; gaps remain for advanced therapies/diagnostics."},
            "No-cost_Access": {"score": "2/5", "disc": "High out-of-pocket burden persists."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Pilot FOBT programs", "disc": "Screening not nationwide; limited to pilot regions."}
        }
    },


    {
        "id": 143,
        "cancer_type": "colorectal",
        "country": "Netherlands",
        "country_shortForm": "NL",
        "introduction": "The Netherlands has one of the most advanced colorectal cancer (CRC) care systems in Europe. Specialized centers are widely available, and advanced molecular diagnostics (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) are integrated into clinical practice. Standard treatments—including surgery, chemotherapy, targeted therapies, and radiotherapy—are accessible across the country. Clinical guidelines are rigorously implemented with strong alignment to international standards such as ESMO. Screening is organized at the national level via a biennial fecal immunochemical test (FIT) program with follow-up colonoscopy, supporting early detection and improved survival. Overall, CRC care in the Netherlands demonstrates high maturity, though reimbursement and no-cost access have minor limitations, reflecting moderate out-of-pocket involvement for some patients.",
        "swot_analysis": {
            "Strengths":
                ["Highly organized specialized cancer centers throughout the country.",
"Comprehensive molecular testing integrated into routine clinical care.",
"Standard treatment modalities widely accessible.",
"National clinical guidelines well implemented with continuous updates.",
"Organized national screening program (FIT) supporting early detection.",
"High survival rates due to early diagnosis and advanced care."
],

            "Weaknesses":
                ["Some gaps in reimbursement and full no-cost access may lead to minor financial burden.",
"Complex molecular testing may still be concentrated in high-tier centers, though broadly accessible."
],

            "Opportunities": 
                ["Expansion of precision medicine programs utilizing biomarker data for targeted therapy.",
"Further integration of real-world data for treatment optimization and policy development.",
"Strengthening public awareness campaigns to increase FIT uptake in under-screened populations"
],

            "Threats": 
                ["Rising CRC incidence due to aging population could increase system burden.",
"Potential workforce shortages in specialized oncology and pathology if demand rises.",
"Rapid evolution of molecular diagnostics could challenge smaller centers’ integration speed."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Highly developed, nationwide coverage."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Full access to surgery, chemotherapy, radiotherapy, targeted therapies."},
            "Research_Funding": {"score": "5/5", "disc": "Robust funding supports clinical trials and translational research."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Strong public and professional awareness initiatives."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and advanced treatment."},
            "Early_Detection": {"score": "5/5", "disc": "Organized national FIT screening with colonoscopy follow-up."},
            "Palliative_Care": {"score": "5/5", "disc": "Widely available and integrated into cancer care pathways."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "85%", "disc": "Routinely tested to guide targeted therapy."},
            "NRAS_mutations": {"score": "50%", "disc": "Standard testing in relevant patient groups."},
            "BRAF_V600E_mutations": {"score": "45%", "disc": "Integrated into clinical decision-making."},
            "MSI/dMMR": {"score": "35%", "disc": "Widely applied for prognosis and therapy selection."},
            "PIK3CA_mutations": {"score": "38%", "disc": "Increasing use in precision medicine."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Strong nationwide adherence."},
            "Feasibility": {"score": "5/5", "disc": "Easily implemented in all centers."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Full alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Rapid adoption of guideline updates."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated in clinical practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Mostly covered; minor gaps exist."},
            "No-cost_Access": {"score": "3/5", "disc": "Limited out-of-pocket costs for some services."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Organized FIT Program", "disc": "National biennial FIT screening for ages 55–75, with colonoscopy follow-up for positive tests."}
        }
    },


    {
        "id": 144,
        "cancer_type": "colorectal",
        "country": "New Zealand",
        "country_shortForm": "NZ",
        "introduction": "Colorectal cancer is one of the most common cancers in New Zealand, with a high incidence but relatively strong health system readiness for detection and treatment. Specialized cancer centers and advanced molecular testing are widely available. The country has introduced a national colorectal cancer screening program using FIT (phased rollout, every 2 years for adults aged 60–74), significantly improving early detection. Clinical guideline adherence is strong, with full alignment to international standards and high engagement with updates. Biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is widely utilized, reflecting advanced integration of precision oncology. Access is generally good, although disparities remain for rural and Māori populations. Reimbursement and no-cost access are moderate, with partial public coverage but some out-of-pocket burden for advanced therapies. Overall, colorectal cancer care in New Zealand demonstrates high maturity (Level 4/5), with strong infrastructure, clinical governance, and screening, though equity challenges persist.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive national screening program (FIT, 2-yearly for ages 60–74).",
"Universal access to specialized cancer centers with advanced infrastructure.",
"Full alignment with international guidelines (NCCN/ESMO).",
"High utilization of molecular biomarkers supporting targeted therapy.",
"Strong survival outcomes due to earlier detection and guideline-based care."
],

            "Weaknesses":
                ["Treatment access still uneven in rural and remote areas.",
"Financial burden persists for some advanced therapies due to partial reimbursement.",
"Awareness campaigns are present but not as intensive as in some other countries.",
"Palliative care services, while available, vary by region in terms of integration and capacity."
],

            "Opportunities": 
                ["Further expansion of screening participation, particularly among Māori and Pacific populations.",
"Strengthen equity in rural and underserved communities through telehealth and outreach.",
"Increase investment in research funding for colorectal cancer, especially genomics.",
"Enhance awareness efforts targeting high-risk groups and young-onset CRC."
],

            "Threats": 
                ["Rising incidence of colorectal cancer among younger populations may increase demand for resources.",
"Workforce constraints in oncology and gastroenterology could challenge sustainability.",
"Financial pressures on the public health system may affect adoption of next-generation therapies."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "High-quality cancer centers accessible nationwide."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Comprehensive infrastructure; broad biomarker availability."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies widely available; some inequities in remote areas."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing, with modest but steady clinical research output."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Campaigns present but not universal in reach."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Strong outcomes due to effective detection and treatment."},
            "Early_Detection": {"score": "4/5", "disc": "FIT-based national screening in rollout, improving early diagnosis."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available, but regional variations exist."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "%", "disc": "Routinely tested in advanced cases."},
            "NRAS_mutations": {"score": "%", "disc": "Available in major centers."},
            "BRAF_V600E_mutations": {"score": "%", "disc": "Integrated into precision care protocols."},
            "MSI/dMMR": {"score": "%", "disc": "Widely used for immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "%", "disc": "Available, though not universal."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "/5", "disc": "Fully integrated across hospitals."},
            "Feasibility": {"score": "/5", "disc": "Strong infrastructure supports universal adoption."},
            "Adoption_International_Guideline": {"score": "/5", "disc": "High alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "/3", "disc": "Strong update adoption nationally."},
            "ESMO_Guidelines": {"score": "/5", "disc": "Fully embedded in practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "/5", "disc": "Public insurance covers standard care; gaps in advanced therapies."},
            "No-cost_Access": {"score": "/5", "disc": "Many treatments subsidized; some out-of-pocket costs remain."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT every 2 years (ages 60–74)", "disc": "National program being phased in, expected to improve early detection significantly."}
        }
    },


    {
        "id": 145,
        "cancer_type": "colorectal",
        "country": "Nigeria",
        "country_shortForm": "NG",
        "introduction": "Colorectal cancer is an emerging public health challenge in Nigeria, with rising incidence but very limited capacity for early detection, treatment, and research. Specialized centers are scarce and concentrated in a few urban hubs, while rural access remains minimal. Advanced diagnostics, including molecular testing, are only available in select tertiary hospitals and research facilities. Screening is virtually absent at the population level, with low awareness and limited access to colonoscopy. Clinical guidelines exist but have weak implementation and limited integration of international standards. Reimbursement and no-cost access are almost absent, placing a heavy financial burden on patients. Overall, colorectal cancer care in Nigeria demonstrates low-to-moderate maturity (level 2), constrained by weak infrastructure, limited biomarker testing, poor screening uptake, and significant inequities in access.",
        "swot_analysis": {
            "Strengths":
                ["Presence of tertiary hospitals in urban areas offering some level of colorectal cancer care.",
"Small but emerging capacity for molecular diagnostics (KRAS, NRAS, BRAF testing in research/private labs).",
"Some national and regional health initiatives addressing cancer awareness broadly."
],

            "Weaknesses":
                ["Very limited specialized centers and diagnostic facilities, especially outside cities.",
"Poor access to treatment; chemotherapy, surgery, and radiotherapy availability is minimal and uneven.",
"Lack of population-level screening programs; detection relies on symptomatic presentation.",
"Research activity is weak, with minimal local funding.",
"Clinical guideline implementation is low, and international alignment is poor.",
"Reimbursement and financial protection are almost nonexistent, creating high out-of-pocket burden."
],

            "Opportunities": 
                ["Expand awareness and prevention programs targeting lifestyle-related colorectal cancer risk.",
"Build colonoscopy capacity and pilot early detection programs in high-risk groups.",
"Leverage partnerships with international agencies for biomarker testing and clinical trials.",
"Introduce context-adapted national guidelines and strengthen oncology training.",
"Integrate colorectal cancer into broader non-communicable disease strategies."
],

            "Threats": 
                ["Rising incidence due to changing lifestyle and diet patterns may overwhelm fragile health systems.",
"Lack of trained oncology workforce and gastroenterologists.",
"Urban-rural health disparities may worsen access inequalities.",
"Budgetary and infrastructure limitations hinder scaling of advanced therapies.",
"Continued low awareness may perpetuate late-stage diagnosis and poor survival outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Few tertiary centers provide colorectal care; rural access very limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "KRAS, NRAS, BRAF, MSI testing possible but only in select labs."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Very limited availability of surgery, chemotherapy, and radiotherapy."},
            "Research_Funding": {"score": "1/5", "disc": "Minimal; most data from small academic projects."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Very limited public education; low awareness of colorectal cancer."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Poor outcomes due to late presentation and lack of treatment."},
            "Early_Detection": {"score": "1/5", "disc": "No organized screening; colonoscopy access is scarce."},
            "Palliative_Care": {"score": "1/5", "disc": "Services underdeveloped; opioids remain difficult to access."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "30%", "disc": "Available in limited tertiary/private labs."},
            "NRAS_mutations": {"score": "10%", "disc": "Rarely tested."},
            "BRAF_V600E_mutations": {"score": "5%", "disc": "Very limited access."},
            "MSI/dMMR": {"score": "5%", "disc": "Rare; mostly research-based."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Minimal availability."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but weakly implemented."},
            "Feasibility": {"score": "2/5", "disc": "Limited by infrastructure and workforce gaps."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial, mostly in tertiary centers."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Poor; smaller hospitals rarely adopt updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Minimal integration."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Almost no coverage under national schemes."},
            "No-cost_Access": {"score": "1/5", "disc": "Patients bear high out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "", "disc": "No organized screening; colonoscopy is scarce and costly."}
        }
    },


    {
        "id": 146,
        "cancer_type": "colorectal",
        "country": "Philippines",
        "country_shortForm": "PH",
        "introduction": "Colorectal cancer (CRC) is an emerging public health concern in the Philippines, with incidence increasing due to lifestyle changes and aging population. Specialized centers exist primarily in urban areas, while rural access remains limited. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available but not widespread, mostly restricted to private and tertiary hospitals. Clinical guidelines exist and are moderately implemented, with partial alignment to international standards. Reimbursement and no-cost access are limited, and patients often incur out-of-pocket costs. Screening programs are mostly NGO-driven or private initiatives, with no organized national program. Overall, colorectal cancer care in the Philippines shows low-to-moderate maturity, with major gaps in infrastructure, biomarker access, and equitable service distribution.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers available in major urban areas.",
"Standard treatments for colorectal cancer accessible in tertiary hospitals.",
"Clinical guidelines exist and are implemented moderately.",
"Some awareness and screening initiatives by NGOs and private hospitals."
],

            "Weaknesses":
                ["Limited access to molecular diagnostics outside urban centers.",
"Biomarker utilization is low and inconsistent.",
"No national colorectal cancer screening program; opportunistic detection dominates.",
"Palliative care services are limited, with barriers in rural areas.",
"Financial burden remains high due to limited reimbursement."
],

            "Opportunities": 
                ["Expand molecular testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) in public hospitals.",
"Develop a national colorectal cancer screening program.",
"Strengthen public awareness and community outreach on early detection.",
"Integrate palliative care services more broadly.",
"Encourage participation in regional and international clinical trials."
],

            "Threats": 
                ["Increasing CRC incidence may strain healthcare resources.",
"Budgetary constraints limit adoption of advanced diagnostics and therapies.",
"Inequitable access between private and public sectors may worsen disparities.",
"Workforce shortages in oncology and gastroenterology, especially outside urban centers."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Available mainly in urban areas; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Limited availability; mostly in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available; regional disparities exist."},
            "Research_Funding": {"score": "2/5", "disc": "Modest; few local studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Limited campaigns; mainly NGO/private initiatives."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival below global standards due to late diagnosis."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic screening via clinics and private initiatives."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited services; rural access challenges persist."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "45%", "disc": "Available but limited to select centers."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited availability."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Very limited access."},
            "MSI/dMMR": {"score": "5%", "disc": "Minimal testing; mostly in research settings."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderately implemented across tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in urban hospitals; smaller centers face challenges."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Moderate uptake in major centers."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially integrated in tertiary hospitals."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; out-of-pocket costs common."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited subsidies; high financial burden persists."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic / NGO", "disc": "No organized national program; limited private/NGO initiatives."}
        }
    },


    {
        "id": 147,
        "cancer_type": "colorectal",
        "country": "Poland",
        "country_shortForm": "PL",
        "introduction": "Colorectal cancer (CRC) is a major public health concern in Poland. The country has well-developed specialized cancer centers and advanced molecular testing infrastructure, primarily concentrated in urban regions. Standard treatments, including surgery, chemotherapy, and radiotherapy, are broadly available. Screening programs exist, with national initiatives using colonoscopy from age 50 and fecal immunochemical tests (FIT) in some areas, contributing to early detection. Molecular biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is increasing but is mostly concentrated in tertiary centers. Clinical guidelines are well implemented and largely aligned with international standards, although engagement with updates varies. Reimbursement is moderate, with some out-of-pocket costs for advanced therapies. Overall, colorectal cancer care in Poland shows moderate maturity, with strengths in infrastructure and guideline adherence, but opportunities remain in biomarker access and nationwide screening coverage.",
        "swot_analysis": {
            "Strengths":
                ["Strong network of specialized cancer centers in urban areas.",
"Well-developed molecular diagnostic infrastructure for key CRC biomarkers.",
"Standard treatments widely available.",
"National screening programs (colonoscopy and FIT) contributing to early detection.",
"Clinical guidelines well implemented with alignment to ESMO standards."
],

            "Weaknesses":
                ["Molecular testing still limited outside tertiary hospitals.",
"Screening uptake may vary regionally, particularly in rural areas.",
"Some patients face out-of-pocket costs for advanced diagnostics or therapies.",
"Engagement with updates to international guidelines is moderate."
],

            "Opportunities": 
                ["Expand biomarker testing (NRAS, BRAF, MSI, PIK3CA) to more regional hospitals.",
"Increase awareness campaigns to improve screening participation.",
"Implement targeted therapies based on molecular profiling more systematically.",
"Enhance telemedicine and remote consultation for underserved areas.",
"Encourage participation in international clinical trials for CRC."
],

            "Threats": 
                ["Rising incidence of CRC may strain health resources.",
"Regional disparities in access to advanced diagnostics and treatment.",
"Financial constraints could limit expansion of targeted therapies.",
"Workforce shortages in oncology and gastroenterology in non-urban regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Strong network in urban areas; rural coverage less developed."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Advanced infrastructure available in tertiary centers; expanding access."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies widely available; some regional disparities."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate support for local studies and clinical research."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Campaigns exist; moderate reach across the country."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; early detection improving outcomes."},
            "Early_Detection": {"score": "3/5", "disc": "National screening via colonoscopy/FIT; regional uptake varies."},
            "Palliative_Care": {"score": "3/5", "disc": "Services present and accessible in most urban centers."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "75%", "disc": "Widely tested in tertiary centers."},
            "NRAS_mutations": {"score": "35%", "disc": "Moderate availability in advanced centers."},
            "BRAF_V600E_mutations": {"score": "30%", "disc": "Limited but available in tertiary hospitals."},
            "MSI/dMMR": {"score": "25%", "disc": "Available in specialized centers; limited outreach."},
            "PIK3CA_mutations": {"score": "30%", "disc": "Limited access outside tertiary centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well implemented across major hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Integration feasible in well-equipped centers."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Largely aligned with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Moderate; smaller hospitals slower to adopt updates."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Broadly integrated into clinical practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate; most standard care covered."},
            "No-cost_Access": {"score": "2/5", "disc": "Advanced therapies may require out-of-pocket payment."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Colonoscopy/FIT", "disc": "Organized national screening program; regional uptake varies."}
        }
    },


    {
        "id": 148,
        "cancer_type": "colorectal",
        "country": "Russia",
        "country_shortForm": "RU",
        "introduction": "Colorectal cancer (CRC) is a growing public health concern in Russia, with rising incidence rates due to aging populations and lifestyle risk factors. Specialized centers exist in major cities, providing standard treatments and diagnostics, but rural coverage is limited. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available in tertiary and private hospitals, though access remains uneven. Clinical guidelines are well established and largely implemented in urban hospitals, with moderate alignment to international standards. Reimbursement coverage is moderate, and no-cost access exists but is incomplete, creating out-of-pocket costs for some patients. Screening is opportunistic, with colonoscopy primarily available in urban areas and no organized national program. Overall, colorectal cancer care in Russia demonstrates moderate maturity, with key gaps in rural access, organized screening, and uniform biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major urban areas provide standard treatment and diagnostics.",
"Clinical guidelines are well established and implemented in higher-tier hospitals.",
"Biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available in tertiary/private centers.",
"Moderate reimbursement coverage reduces financial barriers for some patients."
],

            "Weaknesses":
                ["Rural areas have limited access to specialized centers and advanced diagnostics.",
"Opportunistic rather than organized screening limits early detection.",
"Awareness campaigns are relatively weak, particularly outside major cities.",
"Biomarker utilization is uneven, with low coverage for some mutations.",
"No national population-based screening program for CRC."
],

            "Opportunities": 
                ["Expand access to molecular testing for personalized therapy eligibility.",
"Develop organized, population-level CRC screening programs.",
"Strengthen awareness campaigns and patient education, especially in rural regions.",
"Increase inclusion of Russian patients in international clinical trials.",
"Leverage telemedicine to improve diagnostic and follow-up care outside urban centers."
],

            "Threats": 
                ["Increasing CRC incidence may strain urban tertiary centers and health budgets.",
"Budgetary constraints may limit adoption of advanced diagnostics and therapies.",
"Disparities between public and private sector access may widen.",
"Workforce shortages in oncology, gastroenterology, and surgery in non-urban regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Urban centers equipped; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS, NRAS, BRAF, MSI, PIK3CA available in tertiary/private centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard treatments accessible in urban hospitals; rural gaps persist."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate funding; local clinical studies contribute to regional data."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Limited public awareness and outreach efforts."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Relatively good survival in urban centers with early-stage diagnosis."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic colonoscopy in urban hospitals; no national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available but unevenly distributed."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "70%", "disc": "Widely tested in tertiary centers."},
            "NRAS_mutations": {"score": "30%", "disc": "Limited access in smaller centers."},
            "BRAF_V600E_mutations": {"score": "20%", "disc": "Rarely tested outside major hospitals"},
            "MSI/dMMR": {"score": "20%", "disc": "Limited testing availability."},
            "PIK3CA_mutations": {"score": "20%", "disc": "Sparse availability; mostly research/tertiary centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well implemented in urban hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in well-equipped hospitals; smaller centers face challenges."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Mostly aligned with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Uptake of guideline updates varies between hospitals."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Largely integrated in tertiary hospitals."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate coverage under public insurance."},
            "No-cost_Access": {"score": "3/5", "disc": "Some out-of-pocket costs remain."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic colonoscopy", "disc": "No national program; colonoscopy mainly offered in urban centers."}
        }
    },


    {
        "id": 149,
        "cancer_type": "colorectal",
        "country": "Rwanda",
        "country_shortForm": "RW",
        "introduction": "Colorectal cancer (CRC) care in Rwanda is at an early stage of development. Specialized cancer centers are scarce, and access to advanced diagnostics and molecular testing is extremely limited. Clinical guidelines exist in principle but are poorly implemented, and awareness campaigns are minimal. Screening is largely absent, with very limited access to colonoscopy or other diagnostic tools. Treatment access is constrained, particularly in rural areas, and reimbursement or no-cost care is minimal. Overall, CRC care in Rwanda shows low maturity, with major gaps across infrastructure, diagnostics, treatment, and early detection.",
        "swot_analysis": {
            "Strengths":
                ["Awareness of colorectal cancer exists among healthcare providers in major hospitals.",
"Small-scale initiatives for diagnosis and care are present in tertiary centers."
],

            "Weaknesses":
                ["Very limited specialized centers and oncology infrastructure.",
"Molecular testing for KRAS, NRAS, BRAF, MSI/dMMR, and PIK3CA is minimal.",
"Clinical guideline implementation is poor; uptake of international standards is low.",
"Screening programs are absent; colonoscopy access is extremely limited.",
"Palliative care and survivorship services are weak.",
"High financial burden on patients; minimal reimbursement or no-cost care."
],

            "Opportunities": 
                ["Develop national screening initiatives, particularly for high-risk groups.",
"Invest in molecular diagnostics and pathology capacity.",
"Train oncology workforce and integrate clinical guidelines into routine care.",
"Leverage telemedicine and regional partnerships for expertise sharing.",
"Expand public awareness campaigns to improve early detection."
],

            "Threats": 
                ["Rising incidence of colorectal cancer may overwhelm limited resources.",
"Inequities in access between urban and rural populations.",
"Budgetary constraints may delay adoption of modern therapies and diagnostics.",
"Workforce shortages in oncology, pathology, and gastroenterology."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Very few centers; rural access extremely limited."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Minimal testing for KRAS, NRAS, BRAF, MSI, PIK3CA."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Very limited access; mostly urban tertiary centers."},
            "Research_Funding": {"score": "1/5", "disc": "Negligible; few local studies or trials."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Minimal public awareness and education programs."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Low; late-stage diagnosis common."},
            "Early_Detection": {"score": "1/5", "disc": "No organized screening; very limited colonoscopy access."},
            "Palliative_Care": {"score": "1/5", "disc": "Weak services; minimal rural coverage."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "15%", "disc": "Very limited; mostly research/tertiary centers."},
            "NRAS_mutations": {"score": "5%", "disc": "Rarely tested."},
            "BRAF_V600E_mutations": {"score": "2%", "disc": "Minimal availability."},
            "MSI/dMMR": {"score": "1%", "disc": "Almost no testing outside research."},
            "PIK3CA_mutations": {"score": "1%", "disc": "Very limited."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Poor implementation; guidelines rarely followed."},
            "Feasibility": {"score": "1/5", "disc": "Limited by infrastructure and resources."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Very low; mostly theoretical."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Minimal; centers rarely adopt updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Not integrated in routine care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal; patients largely self-pay."},
            "No-cost_Access": {"score": "1/5", "disc": "Very limited subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "None", "disc": "No organized program; very limited colonoscopy availability."}
        }
    },



    {
        "id": 150,
        "cancer_type": "colorectal",
        "country": "Saudi Arabia",
        "country_shortForm": "SA",
        "introduction": "Colorectal cancer (CRC) is an increasing health concern in Saudi Arabia, with incidence rising due to aging population and lifestyle changes. Specialized cancer centers exist in major cities, and standard treatment modalities are widely available. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is partially implemented, mainly in tertiary and private hospitals. Clinical guidelines are well-established and largely integrated into practice in higher-tier hospitals. Reimbursement and no-cost access are moderate, reducing financial barriers for many patients. Screening remains opportunistic, primarily colonoscopy in urban hospitals, with no national organized program. Overall, colorectal cancer care in Saudi Arabia demonstrates moderate maturity, with opportunities to improve screening, biomarker utilization, and equitable access across regions.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers providing comprehensive CRC treatment in major cities.",
"Strong guideline implementation with high feasibility and alignment with international standards.",
"Partial molecular testing infrastructure available for key biomarkers.",
"Moderate reimbursement and no-cost access reduce patient financial burden."
],

            "Weaknesses":
                ["Limited access to molecular testing and advanced diagnostics outside urban centers.",
"Opportunistic screening only; lack of organized national program.",
"Rural and socioeconomically disadvantaged populations face care barriers.",
"Engagement with updates to international guidelines is moderate, slower in smaller hospitals."
],

            "Opportunities": 
                ["Expand biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) to all tertiary and regional hospitals.",
"Develop national organized colorectal cancer screening programs.",
"Leverage telemedicine and regional networks to improve rural access.",
"Increase patient awareness campaigns for early detection.",
"Enhance participation in international clinical trials."
],

            "Threats": 
                ["Rising CRC incidence may strain healthcare infrastructure.",
"Budgetary limitations could restrict adoption of advanced diagnostics and targeted therapies.",
"Regional disparities between urban and rural areas may widen.",
"Workforce shortages in oncology and gastroenterology could impact care delivery."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Centers exist in major cities; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Biomarker testing available in tertiary/private hospitals; access not universal."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies accessible; some regional disparities."},
            "Research_Funding": {"score": "2/5", "disc": "Limited local clinical studies; mostly academic collaborations."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Awareness campaigns exist; variable uptake in underserved areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate outcomes; early detection limited."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic colonoscopy screening; no national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in major centers; regional coverage varies."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "50%", "disc": "Moderate testing in tertiary centers."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited; mainly research or high-risk patients."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Minimal access; selective testing."},
            "MSI/dMMR": {"score": "10%", "disc": "Rare testing outside research settings."},
            "PIK3CA_mutations": {"score": "10%", "disc": "Limited access; mostly tertiary/private hospitals."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Strong adoption in tertiary centers."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in well-equipped hospitals."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Good alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Moderate uptake; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Integrated in major centers."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate coverage under national insurance."},
            "No-cost_Access": {"score": "3/5", "disc": "Partial no-cost access; some out-of-pocket expenses."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic colonoscopy", "disc": "No organized national program; limited to urban hospitals."}
        }
    },

    {
        "id": 151,
        "cancer_type": "colorectal",
        "country": "Serbia",
        "country_shortForm": "RS",
        "introduction": "Colorectal cancer (CRC) represents a significant burden in Serbia, with rising incidence partly due to lifestyle factors and aging population. Specialized cancer centers exist in urban areas, though rural access is limited. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is available in tertiary centers, mostly in urban hospitals. Clinical guidelines exist and are well implemented in major hospitals, with partial alignment to international standards. Reimbursement and no-cost access remain limited, resulting in some out-of-pocket costs. Screening is organized, with a national FIT-based program and follow-up colonoscopy for positive cases. Overall, colorectal cancer care in Serbia shows moderate maturity, with strong guideline implementation and screening, but gaps in rural access, biomarker utilization, and treatment equity.",
        "swot_analysis": {
            "Strengths":
                ["National FIT-based screening program with follow-up colonoscopy.",
"Specialized centers provide standard CRC treatment (surgery, chemotherapy, radiotherapy).",
"Clinical guidelines exist and are well implemented in tertiary centers.",
"Research funding and awareness campaigns are present and contribute to care improvement."
],

            "Weaknesses":
                ["Limited access to molecular testing outside urban tertiary centers.",
"Rural populations face challenges in accessing specialized care.",
"Palliative care services are limited.",
"Financial burden remains moderate due to partial reimbursement."
],

            "Opportunities": 
                ["Expand biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) to more regional hospitals.",
"Strengthen palliative care coverage and access in rural areas.",
"Increase participation in international clinical trials.",
"Enhance community awareness programs for early detection and lifestyle modification.",
"Leverage telemedicine to extend oncology expertise to underserved areas."
],

            "Threats": 
                ["Rising CRC incidence may strain existing healthcare resources.",
"Budgetary limitations may restrict access to advanced therapies and diagnostics.",
"Workforce shortages in oncology, pathology, and surgery outside major cities.",
"Inequities between public and private sector access could widen disparities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Urban centers equipped; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS, NRAS, BRAF, MSI, PIK3CA mostly available in tertiary centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in urban hospitals; rural inequities remain."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate; local studies contribute to care improvements."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Campaigns exist; uptake varies by region."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival lower than Western Europe due to late-stage diagnosis in some regions."},
            "Early_Detection": {"score": "3/5", "disc": "National FIT-based screening program in place; colonoscopy follow-up available."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited services; rural access and opioid availability challenges persist."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "55%", "disc": "Moderate coverage in tertiary hospitals."},
            "NRAS_mutations": {"score": "25%", "disc": "Limited to specialized centers."},
            "BRAF_V600E_mutations": {"score": "20%", "disc": "Rarely available outside urban centers."},
            "MSI/dMMR": {"score": "15%", "disc": "Minimal availability; mostly tertiary hospitals."},
            "PIK3CA_mutations": {"score": "15%", "disc": "Limited access; mostly in research/academic settings."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well implemented in tertiary hospitals."},
            "Feasibility": {"score": "4/5", "disc": "High feasibility in well-equipped centers."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Largely aligned with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers adopt updates; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Integrated in major hospitals, particularly for advanced CRC care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage under national insurance; gaps remain for advanced therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients face some out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT-based", "disc": "National organized FIT program with colonoscopy for positives."}
        }
    },


    {
        "id": 152,
        "cancer_type": "colorectal",
        "country": "Singapore",
        "country_shortForm": "SG",
        "introduction": "Singapore has a well-established colorectal cancer (CRC) care system, with advanced infrastructure, comprehensive molecular testing, and high awareness among the population. Specialized cancer centers are concentrated in urban hospitals, with strong public-private collaboration. Molecular biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) is widely integrated into clinical practice for targeted therapy selection. Clinical guidelines are fully implemented, closely aligned with international standards, and regularly updated. National screening programs using FIT (fecal immunochemical test) are in place, ensuring early detection and improved survival rates. Reimbursement and partial no-cost access are available, minimizing financial barriers. Overall, CRC care in Singapore demonstrates high maturity, with strong early detection, treatment access, and research integration.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers with advanced diagnostics and treatment options.",
"High-quality molecular testing integrated into routine care.",
"National screening program (FIT biennially from age 50) ensures early detection.",
"Strong clinical guideline implementation and adherence to ESMO/NCCN recommendations.",
"High survival rates due to early detection and comprehensive care.",
"Robust research infrastructure and funding."
],

            "Weaknesses":
                ["Some molecular biomarkers (e.g., MSI/dMMR, BRAF V600E) less frequently applied, though available.",
"Partial out-of-pocket costs may exist despite reimbursement schemes.",
"Rural areas (though limited in Singapore) have lower access compared to central hospitals."
],

            "Opportunities": 
                ["Expand precision medicine programs and clinical trial participation.",
"Increase biomarker testing uptake for less frequently assessed markers (e.g., MSI/dMMR).",
"Strengthen survivorship and post-treatment support programs.",
"Leverage AI and digital pathology for faster diagnosis and treatment planning."
],

            "Threats": 
                ["Rising CRC incidence could strain resources if population screening demand increases.",
"Evolving molecular targets require continuous guideline updates and clinician training.",
"Workforce capacity may be challenged with increasingly complex targeted therapies."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Highly advanced centers with comprehensive oncology services."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Full molecular testing integrated into routine care."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Broad availability of standard and advanced therapies; urban-focused."},
            "Research_Funding": {"score": "5/5", "disc": "Strong investment in local and international studies."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "High public awareness; well-coordinated campaigns."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "Excellent outcomes due to early detection and comprehensive treatment."},
            "Early_Detection": {"score": "5/5", "disc": "National FIT-based program with colonoscopy follow-up."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive services including pain management and support programs."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "70%", "disc": "Widely tested to guide therapy selection."},
            "NRAS_mutations": {"score": "30%", "disc": "Testing available but less frequent."},
            "BRAF_V600E_mutations": {"score": "25%", "disc": "Limited but accessible for advanced cases."},
            "MSI/dMMR": {"score": "20%", "disc": "Selective testing for immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "25%", "disc": "Applied mainly in research or advanced therapy selection."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Fully implemented across public and private centers."},
            "Feasibility": {"score": "5/5", "disc": "High feasibility; urban hospitals equipped for full integration."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Aligned with ESMO/NCCN recommendations."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular updates and adherence ensured."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Mostly integrated; minor gaps for advanced biomarker-driven therapies."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage; most therapies subsidized."},
            "No-cost_Access": {"score": "3/5", "disc": "Some out-of-pocket costs remain; public funding available for standard care."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT biennially from age 50", "disc": "Organized program ensures early detection; colonoscopy follow-up in place."}
        }
    },


    {
        "id": 153,
        "cancer_type": "colorectal",
        "country": "South Africa",
        "country_shortForm": "ZA",
        "introduction": "Colorectal cancer (CRC) is a growing health burden in South Africa, particularly in urban areas with increasing Westernized diets and aging populations. While specialized cancer centers exist in major cities such as Cape Town, Johannesburg, and Durban, access in rural regions remains weak. Molecular diagnostics (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) are available but limited mainly to tertiary hospitals and private facilities. Clinical guidelines are established, fairly well implemented in urban centers, and partially aligned with international standards. However, limited reimbursement, lack of a national screening program, and inequities in rural healthcare remain major challenges. Overall, CRC care in South Africa demonstrates moderate maturity (level 3/5), with strong foundations in tertiary hospitals but persistent inequities in screening, biomarker access, and service distribution.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized oncology centers in major metros.",
"Availability of standard treatments (surgery, chemotherapy, radiotherapy) in tertiary hospitals.",
"National clinical guidelines in place and relatively well implemented.",
"Some access to molecular biomarkers (KRAS, NRAS, BRAF, MSI/dMMR) to guide targeted therapy.",
"Local research and academic studies contributing to regional CRC data."
],

            "Weaknesses":
                ["Limited rural access to specialized CRC care and advanced diagnostics.",
"Molecular biomarker testing remains confined to tertiary/private hospitals.",
"No population-based national screening program; detection often at late stages.",
"Palliative care services insufficient, especially in non-urban areas.",
"High financial burden due to weak reimbursement and limited no-cost access."
],

            "Opportunities": 
                ["Expand access to molecular diagnostics nationwide.",
"Develop national screening pilots (e.g., FIT or colonoscopy) for high-risk groups.",
"Strengthen palliative care infrastructure and opioid availability.",
"Leverage telemedicine to expand oncology expertise to underserved regions.",
"Increase community-level awareness and early detection efforts.",
"Greater participation of South African patients in global CRC clinical trials"
],

            "Threats": 
                ["Rising incidence of CRC may overburden the strained public health system.",
"Budgetary and workforce limitations could slow adoption of advanced diagnostics and therapies.",
"Inequalities between private and public sectors risk widening care gaps.",
"Late-stage diagnoses will continue without organized screening programs."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Present in major metros; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "KRAS/NRAS/BRAF/MSI testing available in tertiary/private hospitals only."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; rural gaps remain."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing but modest; academic studies contribute to local evidence."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Present but uneven; limited impact in underserved communities."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Lower than global standards; late-stage diagnosis is common."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic colonoscopy/sigmoidoscopy in private sector; no national program."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited services, weak integration into rural settings."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "60%", "disc": "Most widely used in tertiary/private centers."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited access."},
            "BRAF_V600E_mutations": {"score": "15%", "disc": "Rarely available; tertiary hospitals only."},
            "MSI/dMMR": {"score": "10%", "disc": "Limited to academic/research settings."},
            "PIK3CA_mutations": {"score": "10%", "disc": "Very limited access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Fairly well adopted in tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in larger hospitals; smaller centers struggle."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with NCCN/ESMO."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers keep pace; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Integrated in part, especially for advanced CRC."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; advanced treatments often out-of-pocket."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited public subsidy programs; patient burden remains high."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "None", "disc": "No organized program; opportunistic colonoscopy available in private sector only."}
        }
    },


    {
        "id": 154,
        "cancer_type": "colorectal",
        "country": "South Korea",
        "country_shortForm": "KR",
        "introduction": "Colorectal cancer (CRC) is among the most common cancers in South Korea, with relatively strong infrastructure, national screening programs, and advanced treatment availability. Specialized cancer centers and widespread molecular testing facilities provide high-quality care. A well-structured National Cancer Screening Program supports early detection, though participation rates and follow-up adherence remain areas for further improvement. Research capacity is strong, with substantial government and academic involvement. Clinical guidelines are well integrated and closely aligned with international standards, though engagement with updates could be further optimized. Reimbursement is moderate, with partial but improving coverage for advanced therapies. Overall, South Korea demonstrates a high maturity level (4/5) in CRC care, with strengths in infrastructure, survival, and awareness, but with gaps in biomarker utilization beyond research and partial financial access challenges.",
        "swot_analysis": {
            "Strengths":
                ["Advanced infrastructure with specialized cancer centers nationwide.",
"Comprehensive National Cancer Screening Program (annual FIT, follow-up colonoscopy).",
"Strong research funding and participation in international studies.",
"High survival rates due to early detection and effective therapies.",
"High public awareness and government-led cancer control policies.",
"Well-developed clinical guidelines, aligned with ESMO and NCCN."
],

            "Weaknesses":
                ["Biomarker utilization (KRAS, NRAS, BRAF, MSI, PIK3CA) is still limited beyond major hospitals and research centers.",
"Out-of-pocket costs persist for some advanced therapies and molecular testing.",
"Guideline update adoption lags in smaller regional hospitals.",
"Palliative care services, while improving, remain variable across regions."
],

            "Opportunities": 
                ["Expand routine biomarker utilization in clinical practice beyond tertiary centers.",
"Enhance reimbursement for immunotherapy and targeted therapies.",
"Increase public awareness of hereditary colorectal cancer (e.g., Lynch syndrome).",
"Leverage AI and digital health tools for screening and risk stratification.",
"Promote wider participation in global CRC clinical trials."
],

            "Threats": 
                ["Rising CRC incidence with aging population could strain healthcare resources.",
"Cost of advanced therapies may create disparities in access.",
"Workforce pressures in oncology and gastroenterology.",
"Lifestyle risk factors (diet, obesity, sedentary lifestyle) may increase disease burden."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Strong nationwide network of specialized cancer centers."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced infrastructure with widespread molecular testing capacity."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Broad access to standard and advanced therapies, though costs remain a barrier."},
            "Research_Funding": {"score": "4/5", "disc": "Strong government and academic research support."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Extensive public health campaigns and education programs."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival rates due to early detection and advanced treatments."},
            "Early_Detection": {"score": "4/5", "disc": "National screening program effective, but participation varies."},
            "Palliative_Care": {"score": "4/5", "disc": "Services improving, but still uneven regionally."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "25%", "disc": "Available in tertiary centers, limited in smaller hospitals."},
            "NRAS_mutations": {"score": "20%", "disc": "Mostly tertiary/research settings."},
            "BRAF_V600E_mutations": {"score": "15%", "disc": "Limited routine clinical use."},
            "MSI/dMMR": {"score": "10%", "disc": "Used selectively, often in advanced cases."},
            "PIK3CA_mutations": {"score": "10%", "disc": "Mostly research-focused."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Widely adopted across major hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Strong in urban areas; smaller hospitals face challenges."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers adopt quickly, smaller ones lag."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially integrated, especially for advanced/metastatic cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage; gaps for advanced therapies."},
            "No-cost_Access": {"score": "3/5", "disc": "Out-of-pocket costs persist, subsidies limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT & colonoscopy", "disc": "National program: annual FIT for adults 50+, colonoscopy if positive."}
        }
    },


    {
        "id": 155,
        "cancer_type": "colorectal",
        "country": "Spain",
        "country_shortForm": "ES",
        "introduction": "Spain has a well-developed healthcare system, providing broad access to colorectal cancer (CRC) care. Specialized cancer centers and advanced molecular diagnostics are widely available, particularly in urban areas. Clinical guidelines are highly implemented, with strong alignment to international standards such as ESMO. Screening programs exist regionally, mainly using fecal immunochemical testing (FIT) every 2 years for adults aged 50–69. Survival rates are high due to organized early detection and timely treatment. Reimbursement and no-cost access are moderate, though some regional variation exists. Overall, colorectal cancer care in Spain demonstrates high maturity, with strong infrastructure and clinical adoption, though minor disparities remain across regions.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers widely available, providing access to surgery, chemotherapy, and radiotherapy.",
"Advanced molecular testing infrastructure (KRAS, NRAS, BRAF, MSI, PIK3CA) broadly accessible.",
"High implementation of clinical guidelines and strong alignment with ESMO standards.",
"Organized regional screening programs using FIT improve early detection.",
"Strong research funding and active clinical trial participation."
],

            "Weaknesses":
                ["Screening programs are regional rather than fully national, leading to some gaps in coverage.",
"Access to newer molecular-targeted therapies may vary by region.",
"Minor disparities exist between urban and rural healthcare delivery."
],

            "Opportunities": 
                ["Expand national coverage of organized CRC screening to improve equity.",
"Increase integration of next-generation sequencing (NGS) for personalized treatment.",
"Strengthen public awareness campaigns to improve early symptom recognition.",
"Enhance telemedicine and care coordination for rural populations."
],

            "Threats": 
                ["Aging population may increase CRC incidence and strain resources.",
"Regional budget differences could affect access to advanced therapies.",
"Workforce limitations in specialized oncology services in less populated regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Centers available nationwide, with strong urban coverage."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced molecular diagnostics broadly accessible."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies widely available; minor regional variations."},
            "Research_Funding": {"score": "4/5", "disc": "Active funding for clinical studies and trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Public campaigns and educational initiatives active across regions."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and advanced treatment."},
            "Early_Detection": {"score": "4/5", "disc": "Regional FIT-based programs; opportunity to expand nationally."},
            "Palliative_Care": {"score": "4/5", "disc": "Palliative care widely available, though minor regional disparities exist."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "80%", "disc": "Frequently tested for targeted therapy decisions."},
            "NRAS_mutations": {"score": "40%", "disc": "Available in specialized centers."},
            "BRAF_V600E_mutations": {"score": "35%", "disc": "Moderately accessed for clinical decision-making."},
            "MSI/dMMR": {"score": "30%", "disc": "Increasingly used for immunotherapy guidance."},
            "PIK3CA_mutations": {"score": "35%", "disc": "Limited but available in tertiary centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Widely adopted in practice across hospitals."},
            "Feasibility": {"score": "5/5", "disc": "Fully feasible in both urban and most regional hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular adoption of updates in clinical practice."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated, including molecular testing and therapy recommendations."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate; national insurance covers most treatments."},
            "No-cost_Access": {"score": "3/5", "disc": "Some out-of-pocket costs; regional differences exist."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Regional FIT programs", "disc": "Organized regional programs every 2 years for ages 50–69; coverage not fully national."}
        }
    },


    {
        "id": 156,
        "cancer_type": "colorectal",
        "country": "Sewden",
        "country_shortForm": "SE",
        "introduction": "Sweden has a well-developed colorectal cancer (CRC) care system, characterized by comprehensive infrastructure, widespread access to diagnostics and treatment, and organized screening programs. Specialized centers and molecular testing capabilities are highly developed, enabling precision medicine approaches. Clinical guidelines are fully implemented and regularly updated, with strong alignment to international standards such as ESMO. Public reimbursement systems support access, though some out-of-pocket costs remain for select services. Regional population-based screening programs using FIT (fecal immunochemical test) target adults aged approximately 60–74, enhancing early detection and improving survival outcomes. Overall, colorectal cancer care in Sweden is advanced, with high maturity in infrastructure, clinical practice, and population health management.",
        "swot_analysis": {
            "Strengths":
                ["Highly specialized cancer centers distributed across the country.",
"Advanced molecular diagnostics widely available (KRAS, NRAS, BRAF, MSI, PIK3CA).",
"Strong public health system with organized screening programs.",
"Clinical guidelines fully implemented with continuous engagement and updates.",
"High survival rates due to early detection and advanced treatments."
],

            "Weaknesses":
                ["Some disparities in access between regions, though minimal.",
"Small out-of-pocket costs persist for certain advanced therapies or diagnostics."
],

            "Opportunities": 
                ["Expand personalized therapy programs based on molecular profiling.",
"Increase public awareness to maximize participation in regional screening programs.",
"Integrate novel biomarkers and liquid biopsy approaches into routine care.",
"Enhance national data collection and research collaborations to inform precision care"
],

            "Threats": 
                ["Rising incidence with aging population may increase demand for services.",
"Budget constraints could affect adoption of the latest expensive therapies.",
"Workforce shortages in specialized oncology roles may emerge in rural areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive coverage; highly advanced centers across the country."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Extensive molecular testing available for precision treatment."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced therapies widely accessible."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national and international research contributions."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Effective public awareness and screening promotion."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and advanced care."},
            "Early_Detection": {"score": "5/5", "disc": "Organized regional FIT screening programs."},
            "Palliative_Care": {"score": "5/5", "disc": "Well-established palliative care integrated into oncology."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "85%", "disc": "Widely tested to guide therapy."},
            "NRAS_mutations": {"score": "50%", "disc": "Routinely tested in clinical practice."},
            "BRAF_V600E_mutations": {"score": "45%", "disc": "Standard biomarker for treatment stratification."},
            "MSI/dMMR": {"score": "35%", "disc": "Used for immunotherapy eligibility and prognosis."},
            "PIK3CA_mutations": {"score": "38%", "disc": "Emerging molecular marker for therapy selection."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Fully implemented nationwide."},
            "Feasibility": {"score": "5/5", "disc": "Easily integrated into all clinical settings."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO and other international standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular guideline updates adopted promptly."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated into national practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Public insurance covers majority; some gaps for advanced care."},
            "No-cost_Access": {"score": "3/5", "disc": "Mostly covered; minor patient co-payments exist."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Organized FIT programs", "disc": "Regional population-based screening for ages ~60–74; improves early detection."}
        }
    },


    {
        "id": 157,
        "cancer_type": "colorectal",
        "country": "Syria",
        "country_shortForm": "SY",
        "introduction": "Colorectal cancer (CRC) care in Syria is severely constrained due to prolonged conflict, limited healthcare infrastructure, and resource shortages. Specialized cancer centers are minimal and concentrated in urban areas, while rural and conflict-affected regions have almost no access. Advanced diagnostics, including molecular biomarker testing, are extremely limited. Clinical guidelines exist in theory but are rarely implemented. Reimbursement and no-cost access are minimal, leaving patients to bear most costs. Organized screening programs are non-existent, and early detection is largely absent. Overall, CRC care in Syria reflects very low maturity, with critical gaps across infrastructure, diagnostics, treatment, and population-level screening.",
        "swot_analysis": {
            "Strengths":
                ["Minimal but existent specialized centers in major cities.",
"Basic awareness of standard CRC management protocols in tertiary centers."
],

            "Weaknesses":
                ["Severe shortage of specialized centers, particularly in rural areas.",
"Very limited access to molecular diagnostics (KRAS, NRAS, BRAF, MSI, PIK3CA).",
"Clinical guideline implementation is virtually non-existent.",
"No organized CRC screening; early detection is extremely limited.",
"Palliative care infrastructure is minimal; opioid availability and integration are poor.",
"Financial burden is high due to almost no reimbursement."
],

            "Opportunities": 
                ["Rebuilding and strengthening oncology infrastructure in urban centers.",
"Gradual introduction of molecular diagnostics for targeted therapies.",
"Development of pilot screening programs in accessible urban populations.",
"Telemedicine to extend expertise to underserved areas once infrastructure allows."
],

            "Threats": 
                ["Ongoing conflict and instability continue to restrict healthcare delivery.",
"Limited funding may prevent adoption of advanced diagnostics or therapies.",
"High likelihood of late-stage diagnosis due to lack of screening and awareness.",
"Workforce shortages in oncology and surgical specialties."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Minimal centers in urban areas; rural access almost non-existent."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Very limited molecular diagnostics; mostly unavailable."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Standard therapies scarce; inequitable access."},
            "Research_Funding": {"score": "1/5", "disc": "Minimal local research; few studies conducted."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Almost no campaigns; low awareness in general population."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Low survival due to late diagnosis and inadequate care."},
            "Early_Detection": {"score": "1/5", "disc": "Opportunistic detection only; no organized screening."},
            "Palliative_Care": {"score": "1/5", "disc": "Minimal services; poor access to opioids."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "40%", "disc": "Limited testing in select facilities."},
            "NRAS_mutations": {"score": "15%", "disc": "Rarely available."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Very limited access."},
            "MSI/dMMR": {"score": "5%", "disc": "Almost unavailable."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Very rare; mostly unavailable."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Virtually no implementation."},
            "Feasibility": {"score": "1/5", "disc": "Not feasible in most centers."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Minimal to no adoption."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "No engagement with updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Not implemented."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Almost none; high out-of-pocket burden."},
            "No-cost_Access": {"score": "1/5", "disc": "Virtually absent."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "None", "disc": "No colorectal cancer screening program; infrastructure severely impacted."}
        }
    },


    {
        "id": 158,
        "cancer_type": "colorectal",
        "country": "Thailand",
        "country_shortForm": "TH",
        "introduction": "Colorectal cancer (CRC) is an emerging public health concern in Thailand. While specialized cancer centers exist in major cities, access in rural areas remains limited. Genetic and molecular testing infrastructure is moderately available in tertiary centers, supporting targeted therapies for select patients. Treatment access varies across regions, and research is ongoing but mostly concentrated in academic hospitals. Awareness campaigns are limited, contributing to delayed diagnosis. Thailand has organized fecal immunochemical test (FIT)–based screening for individuals aged 50–70 since 2018, with colonoscopy follow-up, which marks progress in systematic early detection. Overall, CRC care in Thailand demonstrates low-to-moderate maturity, with gaps in treatment access, rural coverage, palliative care, and biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers in major cities providing standard CRC care.",
"Organized national FIT-based screening program for adults aged 50–70.",
"Research activity and molecular testing capacity exist in tertiary hospitals.",
"Clinical guidelines are established and moderately implemented."
],

            "Weaknesses":
                ["Treatment access limited in rural and regional hospitals.",
"Awareness campaigns are underdeveloped, limiting early presentation.",
"Palliative care services remain insufficient and unevenly distributed.",
"Molecular biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) limited outside tertiary centers.",
"Partial alignment with international guidelines; engagement with updates is moderate."
],

            "Opportunities": 
                ["Expand molecular diagnostic testing to regional hospitals.",
"Strengthen public awareness and community outreach programs.",
"Enhance palliative care networks and opioid accessibility.",
"Extend organized screening to wider populations and integrate follow-up support.",
"Encourage participation in international clinical trials."
],

            "Threats": 
                ["Rising CRC incidence may strain limited healthcare resources.",
"Regional inequities in care access could worsen health outcomes.",
"Budget constraints may limit adoption of advanced diagnostics and therapies.",
"Workforce shortages in oncology and gastroenterology outside urban centers."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Urban centers well-equipped; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Infrastructure exists in tertiary centers; limited regional access."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in cities; rural coverage weak."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate; ongoing studies in academic centers."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Limited public education and outreach."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival below global benchmarks due to late-stage diagnosis."},
            "Early_Detection": {"score": "2/5", "disc": "FIT-based screening in place, but coverage and follow-up inconsistent."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited access; uneven distribution across regions."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "50%", "disc": "Available in tertiary centers; not widespread."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited access; mainly research/academic hospitals."},
            "BRAF_V600E_mutations": {"score": "15%", "disc": "Minimal access; tertiary centers only."},
            "MSI/dMMR": {"score": "10%", "disc": "Rare; mostly research settings."},
            "PIK3CA_mutations": {"score": "10%", "disc": "Very limited availability."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Moderate adoption; mainly in urban hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in well-equipped centers; limited in smaller hospitals."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Moderate uptake; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Limited integration, mainly for advanced cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage under national insurance."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket costs remain for many patients."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Organized FIT", "disc": "FIT-based screening for ages 50–70; colonoscopy follow-up; coverage incomplete."}
        }
    },

    {
        "id": 159,
        "cancer_type": "colorectal",
        "country": "UAE",
        "country_shortForm": "AE",
        "introduction": "Colorectal cancer (CRC) is a growing health concern in the UAE, with incidence rising due to lifestyle changes and aging population. Specialized centers and advanced molecular diagnostics are available in major cities, though rural and peripheral access remains limited. Clinical guidelines are well implemented in urban hospitals and largely aligned with international standards. Reimbursement and no-cost access are moderate, with some out-of-pocket costs. Screening is mainly opportunistic, offered in major hospitals, without a structured national program. Overall, colorectal cancer care in the UAE demonstrates moderate maturity, with strong urban services but gaps in population-level screening and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Well-established specialized centers with advanced diagnostic capabilities in urban areas.",
"Strong access to standard CRC treatments and supportive care.",
"Clinical guidelines implemented with good alignment to international standards.",
"Awareness campaigns are present and effective in urban populations.",
"Survival rates and early detection metrics are relatively high in tertiary centers."
],

            "Weaknesses":
                ["Opportunistic rather than organized national screening programs.",
"Rural and less affluent populations may face access barriers.",
"Molecular biomarker testing is limited outside tertiary/private hospitals.",
"Moderate reimbursement and partial no-cost access can lead to out-of-pocket expenses."
],

            "Opportunities": 
                ["Establish structured national CRC screening programs.",
"Expand access to molecular biomarker testing for targeted therapy and precision medicine.",
"Increase public awareness in rural and underserved communities.",
"Promote inclusion in international clinical trials.",
"Leverage telemedicine to extend oncology expertise to peripheral hospitals."
],

            "Threats": 
                ["Rising CRC incidence may increase demand on urban centers.",
"Unequal access between private and public hospitals could exacerbate disparities.",
"Budgetary constraints may limit expansion of advanced diagnostic services.",
"Workforce shortages in oncology and surgical specialties outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Advanced centers exist in major cities; limited coverage in smaller regions."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Infrastructure supports testing; widely available in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies widely accessible; good urban coverage."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate funding; some local and international studies ongoing."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Campaigns active; public awareness improving."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Relatively high, reflecting early diagnosis in urban centers."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic screening effective in major hospitals; no structured national program."},
            "Palliative_Care": {"score": "4/5", "disc": "Good coverage in urban areas; rural access may be limited."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "50%", "disc": "Widely tested in tertiary centers."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited access; mostly tertiary/private hospitals."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Minimal testing outside specialized centers."},
            "MSI/dMMR": {"score": "10%", "disc": "Limited availability; tertiary/private hospitals."},
            "PIK3CA_mutations": {"score": "10%", "disc": "Minimal; mostly in research/tertiary centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines well integrated in major hospitals."},
            "Feasibility": {"score": "4/5", "disc": "High feasibility in equipped hospitals."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Alignment with ESMO/NCCN; widely adopted."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Active participation in updates and guideline revisions."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Broad implementation for standard and advanced care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate coverage; some out-of-pocket costs remain."},
            "No-cost_Access": {"score": "3/5", "disc": "Partial coverage for patients; some costs borne personally."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic screening", "disc": "Available in major hospitals; no structured national program yet."}
        }
    },

    {
        "id": 160,
        "cancer_type": "colorectal",
        "country": "Uganda",
        "country_shortForm": "UG",
        "introduction": "Colorectal cancer (CRC) in Uganda faces significant challenges in detection, treatment, and care delivery. Specialized cancer centers are extremely limited, mostly concentrated in the capital and a few regional hubs. Molecular testing and biomarker utilization (KRAS, NRAS, BRAF, MSI/dMMR, PIK3CA) are minimal, largely confined to research or tertiary centers. Clinical guidelines exist in principle but are poorly implemented due to resource constraints and limited healthcare infrastructure. Reimbursement and no-cost access are minimal, with patients bearing most of the financial burden. Screening is almost nonexistent, with no organized national program, resulting in late-stage presentations and poor outcomes. Overall, colorectal cancer care in Uganda demonstrates low maturity, with severe gaps across all pillars of care.",
        "swot_analysis": {
            "Strengths":
                ["Small number of specialized centers provide some access to surgery and chemotherapy.",
"Awareness of CRC is gradually increasing in urban areas."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing.",
"Biomarker testing is extremely low (KRAS 20%, NRAS 5%, BRAF 2%, MSI/dMMR 1%, PIK3CA 1%).",
"No organized screening; most cases detected at late stages.",
"Clinical guideline implementation is poor, and updates are rarely adopted.",
"Palliative care coverage is minimal.",
"Severe inequities between urban and rural populations."
],

            "Opportunities": 
                ["Establish basic molecular diagnostic capacity in regional centers.",
"Develop pilot screening programs targeting high-risk groups.",
"Improve palliative care and integrate pain management policies.",
"Increase participation in regional or international clinical studies.",
"Raise public awareness through community outreach and education."
],

            "Threats": 
                ["Rising incidence may overwhelm limited healthcare capacity.",
"Budgetary constraints restrict access to standard and advanced therapies.",
"Workforce shortages in oncology, surgery, and pathology.",
"Persistent inequities between urban and rural populations.",
"Late-stage presentations lead to poor survival outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Very few centers, concentrated in Kampala; rural access negligible."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Minimal infrastructure; advanced biomarker testing mostly unavailable."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Standard therapies limited to few urban centers."},
            "Research_Funding": {"score": "1/5", "disc": "Very low; minimal local studies."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Limited public awareness; education campaigns scarce."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Very poor due to late-stage diagnosis and limited treatment."},
            "Early_Detection": {"score": "1/5", "disc": "No organized screening; only opportunistic detection."},
            "Palliative_Care": {"score": "1/5", "disc": "Minimal services; opioid access and integration are poor."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "20%", "disc": "Limited access in select tertiary centers."},
            "NRAS_mutations": {"score": "5%", "disc": "Rarely available."},
            "BRAF_V600E_mutations": {"score": "2%", "disc": "Almost entirely unavailable."},
            "MSI/dMMR": {"score": "1%", "disc": "Negligible availability."},
            "PIK3CA_mutations": {"score": "1%", "disc": "Minimal testing capacity."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Poor implementation; guidelines rarely followed."},
            "Feasibility": {"score": "1/5", "disc": "Limited feasibility due to resource constraints."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Rarely adopted."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Minimal; centers do not keep up with updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Almost no integration."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Very limited coverage; patients bear most costs."},
            "No-cost_Access": {"score": "1/5", "disc": "Almost none; out-of-pocket burden is high."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Extremely limited", "disc": "No formal national program; screening negligible."}
        }
    },


    {
        "id": 161,
        "cancer_type": "colorectal",
        "country": "United Kingdom",
        "country_shortForm": "GB",
        "introduction": "The United Kingdom has a well-established colorectal cancer (CRC) care infrastructure. National screening programs exist and coverage is high, leading to earlier detection compared to many countries. Specialized cancer centers and comprehensive molecular testing infrastructure support high-quality diagnosis and treatment. Clinical guidelines are fully implemented and aligned with international standards. Research funding and public awareness campaigns are robust, supporting innovation and patient engagement. Biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) is integrated into routine care for guiding targeted therapies. Reimbursement is moderate, with some out-of-pocket costs for advanced therapies, but access to national health services ensures broad coverage. Overall, colorectal cancer care in the UK demonstrates high maturity, with strong early detection, treatment, and research capabilities, though minor gaps remain in cost coverage for certain therapies.",
        "swot_analysis": {
            "Strengths":
                ["National bowel cancer screening program (FIT-based) ensures early detection.",
"Highly specialized cancer centers with comprehensive treatment options.",
"Strong molecular testing infrastructure for biomarker-driven therapy.",
"Full implementation of national and international clinical guidelines (ESMO/NCCN).",
"Substantial research funding and active public awareness campaigns."
],

            "Weaknesses":
                ["Reimbursement for some advanced therapies is partial, creating minor out-of-pocket costs.",
"Access disparities may exist in remote areas despite strong central infrastructure"
],

            "Opportunities": 
                ["Expand coverage of molecular testing in community hospitals.",
"Integrate novel biomarkers and targeted therapies as evidence evolves.",
"Continue public health campaigns to improve screening uptake among under-screened populations."
],

            "Threats": 
                ["Rising incidence and aging population may increase pressure on treatment services.",
"Budgetary constraints could impact adoption of newer high-cost targeted therapies.",
"Workforce shortages in oncology could limit care capacity in rural regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Highly developed cancer centers with broad regional coverage."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Extensive infrastructure; routine molecular profiling widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Comprehensive therapies available; minor disparities in advanced care access."},
            "Research_Funding": {"score": "5/5", "disc": "Robust funding supporting clinical trials and translational research."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Extensive public awareness and education programs."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and effective treatment."},
            "Early_Detection": {"score": "5/5", "disc": "National FIT-based screening program; high uptake."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive palliative care services integrated across regions."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "80%", "disc": "Widely tested; guides targeted therapy."},
            "NRAS_mutations": {"score": "40%", "disc": "Routinely tested in advanced CRC cases."},
            "BRAF_V600E_mutations": {"score": "35%", "disc": "Integrated into diagnostic workflow for therapy selection."},
            "MSI/dMMR": {"score": "30%", "disc": "Tested to identify immunotherapy candidates."},
            "PIK3CA_mutations": {"score": "35%", "disc": "Available in specialized centers for treatment decisions."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Fully integrated in national practice."},
            "Feasibility": {"score": "5/5", "disc": "Guidelines feasible in all specialized centers."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Rapid adoption of updates across hospitals."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated into clinical practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage for advanced therapies; most core treatments funded."},
            "No-cost_Access": {"score": "2/5", "disc": "Some out-of-pocket costs for high-cost targeted therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "FIT-based national program", "disc": "Ages 60–74; Scotland from 50; biennial testing."}
        }
    },


    {
        "id": 162,
        "cancer_type": "colorectal",
        "country": "United States",
        "country_shortForm": "US",
        "introduction": "Colorectal cancer (CRC) remains one of the most common cancers in the United States, but outcomes are among the best globally due to systematic screening, advanced diagnostics, and widespread treatment availability. Specialized cancer centers and comprehensive oncology networks provide nationwide coverage, though disparities persist by geography, income, and insurance status. Molecular biomarker utilization (KRAS, NRAS, BRAF V600E, MSI/dMMR, PIK3CA) is routine in tertiary and community cancer centers, enabling precision medicine approaches. Clinical guidelines are robustly implemented with full alignment to NCCN, ASCO, and ESMO standards. Research funding is strong, and survival rates are high due to early detection and advanced therapies. Reimbursement is robust for insured patients, but access remains inequitable for the uninsured or underinsured. Overall, the United States demonstrates a high maturity level (4/5) in CRC care, with ongoing challenges in equitable access and cost.",
        "swot_analysis": {
            "Strengths":
                ["Widespread availability of specialized cancer centers with multidisciplinary teams.",
"Comprehensive screening programs (colonoscopy, FIT, sigmoidoscopy) supported by insurance coverage.",
"Strong biomarker integration into clinical practice, enabling personalized therapy.",
"Well-established national guidelines (NCCN, ASCO) fully aligned with international standards.",
"High levels of research funding and global leadership in CRC clinical trials.",
"Palliative care and survivorship programs widely available."
],

            "Weaknesses":
                ["Significant disparities in outcomes between insured vs. uninsured populations.",
"Rural populations face barriers in accessing advanced centers.",
"High out-of-pocket costs for some therapies, despite insurance coverage.",
"Reimbursement is variable and often does not eliminate cost burden for patients."
],

            "Opportunities": 
                ["Expand telemedicine and outreach programs for rural and underserved populations.",
"Increase participation in screening programs among at-risk communities.",
"Strengthen initiatives to reduce financial toxicity of CRC treatment.",
"Enhance integration of real-world data into research and guideline development."
],

            "Threats": 
                ["Rising costs of advanced therapies may limit equitable access.",
"Insurance coverage gaps could exacerbate disparities.",
"Increasing incidence of early-onset CRC poses new prevention and treatment challenges."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Nationwide availability of NCI-designated cancer centers and community oncology networks."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Widely available; advanced biomarker testing is routine."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced therapies (surgery, chemo, immunotherapy, targeted agents) widely available."},
            "Research_Funding": {"score": "5/5", "disc": "Strong NIH/NCI investment; U.S. is a global leader in CRC research."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "National awareness programs (e.g., “Screen for Life”) well established."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "Among the highest globally; linked to systematic screening and treatment."},
            "Early_Detection": {"score": "5/5", "disc": "Organized national screening (colonoscopy, FIT, sigmoidoscopy) starting at age 45."},
            "Palliative_Care": {"score": "5/5", "disc": "Integrated across cancer centers with strong policy support."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "85%", "disc": "Routinely tested for treatment planning."},
            "NRAS_mutations": {"score": "45%", "disc": "Standard biomarker testing included."},
            "BRAF_V600E_mutations": {"score": "40%", "disc": "Tested in advanced/metastatic cases."},
            "MSI/dMMR": {"score": "35%", "disc": "Standardized for immunotherapy eligibility."},
            "PIK3CA_mutations": {"score": "38%", "disc": "Increasingly incorporated into practice."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Strong adherence to NCCN/ASCO."},
            "Feasibility": {"score": "5/5", "disc": "Fully feasible across major and community centers."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "High alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Rapid adoption of new standards."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated and aligned."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Insurance covers most costs, but gaps remain; uninsured patients face barriers."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited; financial toxicity remains a major issue."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Organized", "disc": "Organized screening programs with colonoscopy, FIT, or sigmoidoscopy starting at 45; insurance coverage mandated."}
        }
    },


    {
        "id": 163,
        "cancer_type": "colorectal",
        "country": "Vietnam",
        "country_shortForm": "VN",
        "introduction": "Colorectal cancer (CRC) is an emerging health concern in Vietnam, with increasing incidence in urban populations. Specialized centers exist mainly in major cities, while rural areas have limited access to diagnostics and treatment. Molecular biomarker testing (KRAS, NRAS, BRAF, MSI, PIK3CA) is available but largely restricted to tertiary or private hospitals. Clinical guidelines exist but adoption is inconsistent, and alignment with international standards is partial. Reimbursement and no-cost access are limited, creating financial barriers for patients. Screening is opportunistic, with pilot programs in urban areas, but no organized national screening program is in place. Overall, CRC care in Vietnam shows low-to-moderate maturity, with significant gaps in early detection, molecular testing, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Presence of specialized cancer and tertiary centers in major cities.",
"Availability of standard treatment modalities in urban centers.",
"Pilot screening programs provide early detection experience."

],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing outside urban areas.",
"Biomarker utilization (KRAS, NRAS, BRAF, MSI, PIK3CA) is low and inconsistent.",
"Opportunistic screening only; no organized national program.",
"Clinical guideline adoption and engagement with updates are limited.",
"Rural populations face major access barriers; financial burden is high."
],

            "Opportunities": 
                ["Expand molecular diagnostic capacity for KRAS, NRAS, BRAF, MSI, and PIK3CA.",
"Develop nationwide organized CRC screening programs.",
"Strengthen public awareness campaigns and early detection initiatives.",
"Enhance clinical guideline implementation and training in regional hospitals.",
"Leverage telemedicine and referral networks to extend oncology expertise."
],

            "Threats": 
                ["Rising CRC incidence may strain existing urban-focused healthcare infrastructure.",
"Limited budget may restrict adoption of advanced therapies and molecular testing.",
"Inequity between urban and rural populations may worsen outcomes.",
"Workforce shortages in oncology and gastroenterology outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Concentrated in major cities; rural coverage is poor."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Limited to tertiary/private hospitals; uneven access."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in urban centers; rural access limited."},
            "Research_Funding": {"score": "1/5", "disc": "Minimal local research and funding."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Some awareness activities; uptake limited outside urban areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Lower than global standards due to late diagnosis."},
            "Early_Detection": {"score": "1/5", "disc": "Opportunistic screening in urban areas; no national program."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited access and coverage; rural services are sparse."}
        },
        "biomarkers": {
            "KRAS_mutations":{"score": "50%", "disc": "Moderate access in tertiary/private centers."},
            "NRAS_mutations": {"score": "20%", "disc": "Limited availability."},
            "BRAF_V600E_mutations": {"score": "10%", "disc": "Rarely available."},
            "MSI/dMMR": {"score": "5%", "disc": "Minimal access, mainly in research or private labs."},
            "PIK3CA_mutations": {"score": "5%", "disc": "Very limited testing."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Low-to-moderate adoption; mainly urban hospitals."},
            "Feasibility": {"score": "2/5", "disc": "Challenging in smaller/rural centers."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Slow uptake, especially outside tertiary centers."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Partially applied in urban hospitals."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited national coverage; patients pay out-of-pocket."},
            "No-cost_Access": {"score": "2/5", "disc": "Very limited subsidy programs; financial burden persists."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic / Pilot", "disc": "Opportunistic testing in urban centers; pilot programs exist; no national policy."}
        }
    }
]