[
    {
        "id": 164,
        "cancer_type": "gastric",
        "country": "China",
        "country_shortForm": "CN",
        "introduction": "Gastric cancer remains a significant public health concern in China, with relatively high incidence rates in certain regions. Specialized cancer centers and advanced diagnostic infrastructure are well established, particularly in urban areas. Molecular and genetic testing is broadly available in tertiary hospitals. Treatment options, including surgery, chemotherapy, targeted therapy, and immunotherapy, are widely accessible. Awareness campaigns and research initiatives are strong, contributing to early detection and clinical guideline adoption. National screening programs are limited, though pilot and urban regional programs exist. Overall, gastric cancer care in China demonstrates high maturity with robust infrastructure, treatment access, and research capacity, though gaps remain in population-level screening and equitable rural access.",
        "swot_analysis": {
            "Strengths":
                ["Highly developed specialized cancer centers and tertiary hospitals in urban regions.",
"Advanced genetic and molecular testing widely available (HER2, MSI-H/dMMR, PD-L1).",
"Broad access to standard and advanced therapies, including targeted and immunotherapies.",
"Strong research funding and active clinical trial participation.",
"Public health awareness campaigns improving early detection in urban areas."
],

            "Weaknesses":
                ["Limited access to specialized care and diagnostics in rural regions.",
"National-level organized screening programs remain underdeveloped; mostly pilot or urban initiatives.",
"Some variability in implementation of clinical guidelines across smaller centers."
],

            "Opportunities": 
                ["Expand screening programs to high-risk populations nationwide.",
"Strengthen rural healthcare infrastructure and telemedicine oncology support.",
"Increase inclusion of Chinese patients in international clinical trials.",
"Enhance integration of biomarker-driven personalized therapy in smaller hospitals."
],

            "Threats": 
                ["Rising incidence may strain healthcare infrastructure in non-urban regions.",
"Regional disparities in access to advanced therapies may persist.",
"Budgetary constraints could limit widespread implementation of population-level screening."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Well-established specialized centers in major cities; strong tertiary hospital network."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarkers (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard and advanced therapies available, mostly in urban tertiary hospitals."},
            "Research_Funding": {"score": "5/5", "disc": "Strong research funding; active clinical trials and regional studies."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Awareness programs exist; urban populations better reached than rural."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Relatively high survival due to early detection in urban centers."},
            "Early_Detection": {"score": "4/5", "disc": "Pilot screening programs in urban regions; no nationwide population-level screening."},
            "Palliative_Care": {"score": "4/5", "disc": "Adequate palliative services in tertiary centers; expanding coverage."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Widely used for therapy guidance in advanced cases."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Used in tertiary centers for immunotherapy eligibility."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Commonly applied for checkpoint inhibitor treatment decisions."},
            "CLDN18.2": {"score": "40%", "disc": "Available in select advanced hospitals."},
            "FGFR2b": {"score": "30%", "disc": "Limited use; specialized facilities only."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines implemented in tertiary hospitals; smaller centers variable."},
            "Feasibility": {"score": "3/5", "disc": "Practical in well-equipped hospitals; limited elsewhere."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN guidelines."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers actively update; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Integrated in part for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage under national insurance; some out-of-pocket expenses remain."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited free/subsidized access; mostly urban patients benefit."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic/Pilot only", "disc": "Pilot programs in urban areas; no organized nationwide program."}
        }
    },
    
    {
        "id": 165,
        "cancer_type": "gastric",
        "country": "France",
        "country_shortForm": "FR",
        "introduction": "France has relatively advanced gastric cancer care, supported by robust healthcare infrastructure, high research activity, and widespread access to diagnostics and treatment. Early detection is improving, though population-level screening is limited to high-risk groups. Clinical guidelines are well established and largely aligned with international standards (ESMO). Advanced biomarker testing is widely available in tertiary centers, and awareness campaigns are moderately active. Reimbursement and access to care are generally strong, though some gaps remain in no-cost access. Overall, gastric cancer care in France demonstrates high maturity, with some areas for improvement in systematic screening and rural coverage.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive tertiary care centers with access to advanced diagnostics and treatments.",
"High research funding and active participation in clinical trials.",
"Strong clinical guideline implementation with alignment to ESMO standards.",
"Biomarker testing widely available in tertiary centers.",
"Moderate awareness campaigns increasing early detection in urban populations."
],

            "Weaknesses":
                ["No organized national screening program; limited to high-risk monitoring.",
"Rural access to specialized centers may still lag behind urban areas.",
"Some advanced therapies may require partial out-of-pocket costs."
],

            "Opportunities": 
                ["Expand targeted screening programs for high-risk populations.",
"Increase telemedicine integration to extend oncology expertise to underserved regions.",
"Strengthen public awareness campaigns for early detection.",
"Expand biomarker-driven personalized therapy adoption across all hospitals."
],

            "Threats": 
                ["Rising incidence of gastric cancer in aging populations may strain resources.",
"Health disparities between urban and rural populations could persist.",
"Budget limitations may affect adoption of latest targeted therapies."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Robust network of tertiary hospitals with specialized oncology units."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b) widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced treatments accessible across tertiary centers."},
            "Research_Funding": {"score": "5/5", "disc": "High investment; active participation in clinical trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Moderate public awareness; room for expansion in rural areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival rates due to early detection and advanced treatment."},
            "Early_Detection": {"score": "5/5", "disc": "Opportunistic and high-risk monitoring; no nationwide screening."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive services, widely accessible."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Standard biomarker for targeted therapy."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Widely tested in tertiary centers."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Routine testing for immunotherapy eligibility."},
            "CLDN18.2": {"score": "70%", "disc": "Increasing adoption in clinical practice."},
            "FGFR2b": {"score": "55%", "disc": "Available for select patients in specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines are robustly implemented across hospitals."},
            "Feasibility": {"score": "5/5", "disc": "High feasibility in all tertiary centers."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN recommendations."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "National centers consistently adopt updates."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated in clinical practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Mostly covered; some advanced therapies may require co-payment."},
            "No-cost_Access": {"score": "3/5", "disc": "Limited subsidies for certain high-cost treatments."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No national program; limited to high-risk monitoring."}
        }
    },

    {
        "id": 166,
        "cancer_type": "gastric",
        "country": "Algeria",
        "country_shortForm": "DZ",
        "introduction": "Gastric cancer care in Algeria is in an early-to-moderate stage of maturity. Specialized cancer centers exist in major urban areas, but rural access remains weak. Advanced molecular diagnostics (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) are available only in limited tertiary or private facilities. Treatment access covers standard options such as surgery, chemotherapy, and radiotherapy, but disparities exist in availability and quality across regions. Clinical guidelines exist but are poorly integrated, and alignment with ESMO/NCCN recommendations is partial. Awareness campaigns are modest, and no organized screening program is in place—detection is mainly opportunistic. Palliative care remains underdeveloped, with gaps in access and opioid availability. Overall, gastric cancer care in Algeria demonstrates moderate maturity, with key gaps in systematic early detection, biomarker utilization, and equitable service distribution.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major cities.",
"Access to standard therapies (surgery, chemotherapy, radiotherapy).",
"HER2 and MSI testing available in select tertiary centers.",
"Growing research interest in gastric cancer biomarkers."
],

            "Weaknesses":
                ["Uneven access between urban and rural populations.",
"Limited use of advanced biomarkers beyond HER2 and MSI.",
"No national screening program; diagnosis often at late stages.",
"Weak palliative care infrastructure and opioid access.",
"Low funding for gastric cancer–specific research."
],

            "Opportunities": 
                ["Expansion of molecular diagnostic infrastructure (PD-L1, CLDN18.2, FGFR2b).",
"Integration of ESMO-based guidelines into practice nationwide.",
"Development of tele-oncology and outreach programs to underserved regions.",
"Public awareness and education campaigns to encourage earlier diagnosis.",
"Inclusion of Algerian patients in international gastric cancer trials."
],

            "Threats": 
                ["Rising gastric cancer burden may overwhelm limited capacity.",
"Budgetary and infrastructure limitations restrict adoption of new therapies.",
"Persistent disparities between private and public sectors.",
"Workforce shortages in oncology, pathology, and gastroenterology."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Centers exist in major cities; rural regions underserved."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "HER2, MSI available in tertiary/private centers; other biomarkers limited."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies (surgery, chemo, radiotherapy) available in urban centers."},
            "Research_Funding": {"score": "2/5", "disc": "Limited funding; modest local studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Few awareness campaigns; stigma and low uptake persist."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Lower survival due to late diagnosis and treatment delays."},
            "Early_Detection": {"score": "2/5", "disc": "No national screening; opportunistic endoscopy/diagnosis only."},
            "Palliative_Care": {"score": "2/5", "disc": "Underdeveloped; opioid access challenges remain."}
        },
        "biomarkers": {
            "HER2":{"score": "40%", "disc": "Most widely tested biomarker in gastric cancer."},
            "MSI_H/dMMR": {"score": "30%", "disc": "Available in some tertiary centers."},
            "PDL_1_CPS>1": {"score": "30%", "disc": "Limited availability."},
            "CLDN18.2": {"score": "20%", "disc": "Rare; limited to research or specialized centers."},
            "FGFR2b": {"score": "15%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but poorly integrated into practice."},
            "Feasibility": {"score": "2/5", "disc": "Only feasible in well-equipped tertiary hospitals."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Minimal; updates slow to reach practice."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Limited integration, mostly in advanced centers."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Some therapies reimbursed; gaps for advanced diagnostics and novel drugs."},
            "No-cost_Access": {"score": "2/5", "disc": "High out-of-pocket burden; subsidies limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "--", "disc": "No program; opportunistic screening only."}
        }
    },


    {
        "id": 167,
        "cancer_type": "gastric",
        "country": "Argentina",
        "country_shortForm": "AR",
        "introduction": "Gastric cancer in Argentina shows moderate maturity in care delivery, with reasonable access in urban centers but notable gaps in rural areas. Specialized centers exist in major cities, but molecular testing and advanced diagnostics are limited outside tertiary hospitals. Clinical guidelines are available and partially implemented. Screening is opportunistic and largely urban-focused, with no national organized program. Awareness campaigns exist but are limited in scope. Reimbursement and no-cost access are partial, leaving some financial burden on patients.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers present in urban areas.",
"Access to standard treatment modalities (surgery, chemotherapy, radiotherapy) in tertiary hospitals.",
"National clinical guidelines exist and are fairly well implemented in major centers.",
"Some research activity on gastric cancer, contributing to local data."
],

            "Weaknesses":
                ["Limited access to molecular diagnostics (e.g., CLDN18.2, FGFR2b) outside major centers.",
"Screening is opportunistic; no organized national screening program.",
"Rural and socioeconomically disadvantaged populations face major barriers to care.",
"Palliative care services are limited, especially outside urban hubs.",
"Financial burden remains due to incomplete reimbursement and partial no-cost access."
],

            "Opportunities": 
                ["Expand molecular diagnostic availability to improve targeted therapy options.",
"Strengthen palliative care networks and access to supportive therapies.",
"Develop pilot programs for early detection in high-risk populations.",
"Increase awareness campaigns and community outreach.",
"Expand inclusion of Argentine patients in international clinical trials."
],

            "Threats": 
                ["Rising incidence could overwhelm healthcare infrastructure.",
"Budgetary constraints may limit adoption of new therapies.",
"Urban-rural disparities in care may widen.",
"Lack of organized screening risks late-stage diagnosis.",
"Workforce shortages in oncology, particularly in rural areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major cities; rural areas have limited access."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Limited molecular diagnostic infrastructure; advanced testing mostly in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in urban tertiary hospitals; inequities exist in rural regions."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing local studies; modest funding."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Awareness programs exist but coverage in underserved areas is limited."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival is lower than global benchmarks due to late diagnosis."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic detection only; no national screening program."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited coverage, especially outside urban centers."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Most commonly tested biomarker; available in many tertiary centers."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Testing available but limited outside specialized centers."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Partially available; mainly in research or urban hospitals."},
            "CLDN18.2": {"score": "40%", "disc": "Limited availability for targeted therapy."},
            "FGFR2b": {"score": "30%", "disc": "Rare; mostly research-focused testing."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines exist and are implemented in major centers."},
            "Feasibility": {"score": "4/5", "disc": "Implementation feasible in well-equipped hospitals."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Partial alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates adopted in tertiary centers; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Integrated in tertiary care, particularly for advanced/metastatic cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial reimbursement available; gaps remain."},
            "No-cost_Access": {"score": "3/5", "disc": "Some access through insurance or programs; out-of-pocket costs persist."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No organized screening; mostly urban-focused detection."}
        }
    },


    {
        "id": 168,
        "cancer_type": "gastric",
        "country": "Australia",
        "country_shortForm": "AU",
        "introduction": "Gastric cancer in Australia is relatively rare compared to other regions, but early detection and effective management are important due to poor prognosis at advanced stages. Specialized cancer centers and tertiary hospitals provide comprehensive care, including surgery, systemic therapy, and endoscopic interventions. Molecular biomarker testing (HER2, MSI, PD-L1) is widely available, mainly in tertiary hospitals and private facilities. Clinical guidelines are well established, closely aligned with international standards (ESMO/NCCN), and regularly updated. Population-level screening is not implemented; surveillance is focused on high-risk groups (e.g., those with hereditary gastric cancer or intestinal metaplasia). Overall, gastric cancer care in Australia demonstrates high maturity with strong infrastructure, biomarker utilization, and guideline adherence, though systematic national screening is lacking.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive cancer centers in all major metropolitan areas.",
"Access to multimodal treatment (surgery, chemotherapy, radiotherapy, targeted therapy).",
"Strong clinical guideline adoption (ESMO/NCCN) and frequent updates.",
"Advanced molecular testing widely available (HER2, MSI, PD-L1).",
"Research-active country with inclusion in international clinical trials."
],

            "Weaknesses":
                ["No population-based screening; detection relies on symptom presentation and high-risk surveillance.",
"Limited access to specialized care in rural/remote areas, though tele-oncology mitigates some gaps.",
"Palliative care largely concentrated in urban centers, though coverage is generally adequate."
],

            "Opportunities": 
                ["Develop pilot national screening programs for high-risk groups.",
"Expand outreach and telemedicine for rural and indigenous populations.",
"Increase public awareness campaigns for early symptom recognition.",
"Enhance integration of novel biomarkers into routine care."
],

            "Threats": 
                ["Rising incidence of gastric cancer among certain immigrant populations.",
"Health budget constraints could affect adoption of new therapies.",
"Workforce shortages in rural oncology services."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive cancer centers exist in major metros; strong urban coverage."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing (HER2, MSI, PD-L1) widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Full access to multimodal treatment across tertiary centers."},
            "Research_Funding": {"score": "5/5", "disc": "Strong research environment; active participation in international trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Moderate awareness programs; scope for improvement in early symptom recognition."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early-stage detection and advanced treatment options."},
            "Early_Detection": {"score": "4/5", "disc": "Surveillance for high-risk groups in place; no national screening."},
            "Palliative_Care": {"score": "5/5", "disc": "Robust services in urban centers; adequate opioid availability."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Widely tested in eligible gastric cancer patients."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Routinely tested in tertiary centers."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Standard in advanced/metastatic cases."},
            "CLDN18.2": {"score": "70%", "disc": "Available in selected centers for targeted therapy eligibility."},
            "FGFR2b": {"score": "55%", "disc": "Testing available in tertiary centers; limited coverage."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Well-implemented across tertiary centers."},
            "Feasibility": {"score": "5/5", "disc": "Fully feasible in equipped hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Closely aligned with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular updates incorporated nationally."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Integrated across advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Covered by national health insurance; some gaps for novel therapies."},
            "No-cost_Access": {"score": "3/5", "disc": "Out-of-pocket costs exist for targeted agents; overall accessible."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No program; surveillance for high-risk groups only", "disc": "Population-level screening not implemented; high-risk surveillance in place."}
        }
    },


    {
        "id": 169,
        "cancer_type": "gastric",
        "country": "Brazil",
        "country_shortForm": "BR",
        "introduction": "Gastric cancer remains a significant health concern in Brazil, particularly in southern and southeastern regions. Specialized care is concentrated in urban tertiary hospitals, while rural and remote areas have limited access. Diagnostic infrastructure exists but varies widely in availability, particularly for advanced molecular testing. Standard treatments (surgery, chemotherapy, radiotherapy) are accessible in major centers. Clinical guidelines are widely adopted in higher-tier hospitals, with partial alignment to international standards. National screening programs do not exist, though some state-level initiatives are underway. Overall, gastric cancer care in Brazil shows moderate maturity (level 3), with gaps in systematic early detection, rural access, and equitable biomarker availability.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized cancer centers in major cities (São Paulo, Rio de Janeiro, Porto Alegre).",
"Access to standard gastric cancer treatments in tertiary hospitals.",
"National clinical guidelines in place and fairly well implemented in major centers.",
"Research activity present, including clinical trials on molecular subtypes and targeted therapies."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing outside urban hubs.",
"Biomarker utilization (CLDN18.2, FGFR2b) remains low.",
"No population-level gastric cancer screening; detection is opportunistic or symptom-driven.",
"Rural and socioeconomically disadvantaged populations face barriers to specialized care.",
"High out-of-pocket costs for advanced diagnostics and targeted therapies."
],

            "Opportunities": 
                ["Expand access to molecular diagnostics and targeted therapy eligibility testing.",
"Develop regional centers to improve rural access.",
"Increase public awareness and community education on early gastric cancer symptoms.",
"Integrate state-level screening initiatives into broader national programs.",
"Expand participation in international clinical trials."
],

            "Threats": 
                ["Rising incidence of gastric cancer may challenge already strained healthcare resources.",
"Budgetary constraints could limit adoption of advanced molecular tests and therapies.",
"Unequal access between public and private healthcare could exacerbate disparities.",
"Late-stage diagnosis remains common without organized screening programs."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Specialized centers exist in major metros; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Moderate availability; advanced biomarkers (CLDN18.2, FGFR2b) limited."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies accessible in urban tertiary hospitals."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing research and clinical trials; moderate funding."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some campaigns and educational efforts; coverage uneven."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; influenced by late diagnosis."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic or state-level initiatives; no national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available in tertiary centers; rural access limited."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Commonly tested in eligible patients."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Moderate access in larger centers."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Available in selected urban centers."},
            "CLDN18.2": {"score": "40%", "disc": "Limited to tertiary hospitals and trials."},
            "FGFR2b": {"score": "30%", "disc": "Very limited testing."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines widely implemented in tertiary centers."},
            "Feasibility": {"score": "4/5", "disc": "Integration feasible in equipped centers; smaller hospitals lag."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Partial alignment with ESMO/NCCN; mostly urban centers."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers follow updates; smaller hospitals slower."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Implemented in advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Some coverage under national insurance; gaps exist for targeted therapies."},
            "No-cost_Access": {"score": "3/5", "disc": "Patients face some out-of-pocket costs; partial subsidies available."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No national program; some state-level initiatives.", "disc": "--"}
        }
    },


    {
        "id": 170,
        "cancer_type": "gastric",
        "country": "Canada",
        "country_shortForm": "CA",
        "introduction": "Gastric cancer in Canada is relatively rare compared to global hotspots, but outcomes are favorable due to timely diagnosis and access to modern treatment. Specialized centers exist mainly in urban tertiary hospitals, while rural access is limited. Molecular and genetic testing for actionable biomarkers is well established in academic centers. Clinical guidelines are comprehensive and closely aligned with international standards (ESMO, NCCN) and are actively implemented. Screening is limited to high-risk populations or symptomatic individuals; there is no organized national program. Overall, gastric cancer care in Canada demonstrates high maturity, with strong infrastructure and guideline implementation, though opportunities exist to expand early detection programs.",
        "swot_analysis": {
            "Strengths":
                ["Well-established specialized cancer centers in major cities.",
"Access to advanced surgical, medical, and targeted therapies.",
"High-quality guideline implementation with integration of ESMO/NCCN standards.",
"Strong research infrastructure, including biomarker-driven studies and clinical trials."
],

            "Weaknesses":
                ["No organized population-based gastric cancer screening program.",
"Limited access for rural and remote populations.",
"High costs for some advanced therapies may affect equitable access."
],

            "Opportunities": 
                ["Implement targeted screening in high-risk populations (e.g., immigrants from high-incidence regions).",
"Expand telemedicine and outreach to underserved regions.",
"Increase public awareness for early detection and lifestyle risk factors.",
"Enhance access to novel biomarker-based therapies through clinical trials."
],

            "Threats": 
                ["Rare incidence may lead to low prioritization in public health planning.",
"Potential disparities in access to advanced diagnostics and therapies in remote areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "High-quality centers available in major metropolitan areas; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Broad availability in academic/tertiary centers; actionable biomarker testing common."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard therapies (surgery, chemotherapy, targeted therapy) widely accessible."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national research funding; active participation in international trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Moderate awareness campaigns; general population knowledge of gastric cancer is limited."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival rates due to timely treatment."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic detection in high-risk groups; no organized national screening."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive palliative care services available nationwide."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Routinely tested in eligible patients for targeted therapy."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Widely assessed for immunotherapy eligibility."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Standard testing for advanced disease."},
            "CLDN18.2": {"score": "70%", "disc": "Increasing adoption in clinical trials."},
            "FGFR2b": {"score": "55%", "disc": "Limited to select research/academic centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines actively implemented in most tertiary centers."},
            "Feasibility": {"score": "5/5", "disc": "High feasibility due to well-resourced hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN recommendations."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regularly updated at national and provincial levels."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated into clinical practice for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Most therapies covered, some high-cost therapies may require supplemental insurance."},
            "No-cost_Access": {"score": "3/5", "disc": "Public insurance covers standard care; advanced therapies may have co-pays."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No national program; screening only in high-risk or symptomatic individuals."}
        }
    },


    {
        "id": 171,
        "cancer_type": "gastric",
        "country": "Chile",
        "country_shortForm": "CL",
        "introduction": "Gastric cancer in Chile is recognized as a significant public health issue, particularly in older adults and certain high-risk populations. While specialized centers exist in urban areas, rural populations face limited access. Advanced diagnostics such as molecular testing and targeted therapy selection are available in select tertiary hospitals, but adoption is not uniform. Clinical guidelines are in place and generally followed in higher-tier hospitals. Screening is largely opportunistic, with only occasional programs in urban centers. Public awareness campaigns exist but have limited penetration in rural regions. Overall, gastric cancer care shows moderate maturity, with gaps in systematic early detection, molecular testing, and equitable access to care.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized cancer centers in major cities.",
"Access to standard treatments (surgery, chemotherapy, radiotherapy) in tertiary hospitals.",
"Clinical guidelines exist and are well implemented in urban centers.",
"Some research activity on gastric cancer and molecular profiling."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics outside urban hubs.",
"No organized national screening program; only opportunistic or pilot programs in select cities.",
"Rural populations face barriers to care and specialized services.",
"Awareness campaigns do not reach all at-risk communities uniformly."
],

            "Opportunities": 
                ["Expand systematic early detection programs in high-risk populations.",
"Increase molecular testing (HER2, MSI-H/dMMR, PD-L1) to guide targeted therapies.",
"Strengthen rural oncology networks via telemedicine.",
"Enhance public awareness campaigns for early symptom recognition."
],

            "Threats": 
                ["Rising incidence in high-risk populations may strain existing infrastructure.",
"Budget constraints may limit access to advanced diagnostics and therapies.",
"Unequal care access between urban and rural populations could worsen outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major cities; rural access is limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Infrastructure exists in select tertiary hospitals; coverage is uneven."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in urban tertiary hospitals; rural inequities remain."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate funding; some local studies contribute to regional knowledge."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some campaigns exist; limited penetration in rural areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Outcomes are moderate; earlier detection could improve survival."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic detection in urban centers; no national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in tertiary hospitals; rural access remains limited."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Testing performed in most tertiary centers."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Moderate availability for therapy selection."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Used for immunotherapy decisions; urban-centric."},
            "CLDN18.2": {"score": "40%", "disc": "Limited availability, mainly research or select hospitals."},
            "FGFR2b": {"score": "30%", "disc": "Rarely available; pilot or research-focused testing."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines well implemented in tertiary centers."},
            "Feasibility": {"score": "4/5", "disc": "High feasibility in equipped hospitals; lower in rural areas."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Mostly aligned with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates adopted mainly in tertiary centers."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Integrated in part; especially for advanced cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited coverage; some therapies incur out-of-pocket costs."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients often face costs; limited subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic / occasional", "disc": "No organized national program; urban pilot efforts only."}
        }
    },


    {
        "id": 172,
        "cancer_type": "gastric",
        "country": "Colombia",
        "country_shortForm": "CO",
        "introduction": "Gastric cancer remains a significant health burden in Colombia, with incidence higher than in many Western countries. Access to specialized care is concentrated in urban centers, while rural populations face delays in diagnosis and treatment. Diagnostic infrastructure, including endoscopy and molecular testing, is growing but still unevenly distributed. Standard treatments (surgery, chemotherapy, radiotherapy) are available in tertiary centers, though access gaps exist outside major cities. National clinical guidelines are established, and partially align with international recommendations (ESMO/NCCN). Screening is largely opportunistic, with no organized national program. Overall, gastric cancer care in Colombia shows moderate maturity, with strengths in specialized infrastructure and treatment access, but gaps in equitable service distribution, early detection, and biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers concentrated in major cities.",
"Availability of standard treatments, including surgery, chemotherapy, and radiotherapy, in tertiary hospitals.",
"National clinical guidelines in place and partially implemented.",
"Moderate research activity and clinical trial participation."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing in rural areas.",
"Biomarker utilization (CLDN18.2, FGFR2b) remains low.",
"No national screening program; detection relies on opportunistic approaches.",
"Palliative care and supportive services are uneven, especially outside urban centers.",
"Socioeconomic and geographic inequities limit access to specialized care."
],

            "Opportunities": 
                ["Expand molecular diagnostic capabilities (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) to more centers.",
"Develop pilot early detection programs for high-risk populations.",
"Strengthen palliative care networks and integrate with oncology services.",
"Increase public awareness campaigns on gastric cancer symptoms and risk factors.",
"Promote participation in international clinical trials to improve access to innovative therapies."
],

            "Threats": 
                ["Rising incidence may strain health system capacity.",
"Budget constraints could limit adoption of advanced therapies and diagnostics.",
"Persistent inequalities between urban and rural care delivery.",
"Lack of organized screening risks continued late-stage diagnosis.",
"Workforce shortages in oncology, pathology, and surgery outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major cities, but rural coverage is limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Infrastructure exists mainly in tertiary hospitals; biomarker testing limited."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in urban centers; inequities in rural regions."},
            "Research_Funding": {"score": "2/5", "disc": "Modest research activity; some clinical trials available."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Limited public awareness; campaigns present but not widespread."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; better in urban tertiary centers."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic detection only; no national screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available but unevenly distributed; rural gaps remain."}
        },
        "biomarkers": {
            "HER2":{"score": "60%", "disc": "Most commonly tested biomarker; applied in tertiary hospitals."},
            "MSI_H/dMMR": {"score": "50%", "disc": "Limited testing, mainly in research or tertiary centers."},
            "PDL_1_CPS>1": {"score": "50%", "disc": "Available in select hospitals; guides immunotherapy."},
            "CLDN18.2": {"score": "30%", "disc": "Rarely tested; emerging biomarker."},
            "FGFR2b": {"score": "25%", "disc": "Very limited access; primarily research or specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines in place; partially implemented across centers."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in tertiary centers; limited in smaller hospitals."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Some alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Urban centers track updates; smaller centers lag behind."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Integrated partially, mainly in advanced care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Public insurance covers standard therapies; gaps exist for advanced treatments."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited subsidies; patients may face out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic", "disc": "No organized national program; detection relies on opportunistic exams."}
        }
    },


    {
        "id": 173,
        "cancer_type": "gastric",
        "country": "Egypt",
        "country_shortForm": "EG",
        "introduction": "Gastric cancer remains a significant but under-recognized cancer burden in Egypt, with detection often occurring at late stages due to the absence of organized national screening. Specialized cancer centers in Cairo and Alexandria provide advanced care, while smaller regional hospitals face diagnostic and therapeutic limitations. Access to molecular biomarkers (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is emerging but remains restricted to tertiary centers and research-focused facilities. Clinical guidelines exist and align partly with international standards, though adoption varies by institution. Treatment access is improving, yet inequities between urban and rural populations persist. Palliative care services are limited, and reimbursement mechanisms do not fully cover advanced therapies. Overall, gastric cancer care in Egypt reflects moderate maturity (Level 3), with strengths in tertiary care infrastructure but clear gaps in systematic early detection, equitable biomarker access, and financial protection.",
        "swot_analysis": {
            "Strengths":
                ["Presence of specialized cancer centers in Cairo, Alexandria, and other urban hubs.",
"Availability of standard treatment modalities (surgery, chemotherapy, radiotherapy) at tertiary hospitals.",
"National guidelines exist, with partial alignment to NCCN/ESMO.",
"Growing local research efforts, including biomarker studies.",
"Increasing awareness of targeted therapies (HER2, MSI-H testing)."
],

            "Weaknesses":
                ["No organized national screening program; diagnosis mostly at advanced stages.",
"Molecular testing (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b) available only in select tertiary centers.",
"Palliative care services remain underdeveloped, with opioid availability challenges.",
"Financial burden is high due to limited reimbursement and subsidy.",
"Disparities between public and private sector care."
],

            "Opportunities": 
                ["Expand molecular diagnostic infrastructure beyond urban centers.",
"Strengthen national awareness campaigns to improve early presentation.",
"Develop pilot gastric cancer screening initiatives in high-risk groups (e.g., family history, H. pylori).",
"Increase international collaborations and clinical trial participation.",
"Enhance integration of palliative care within oncology care pathways."
],

            "Threats": 
                ["Rising incidence of gastric cancer, compounded by late-stage diagnosis, may overwhelm resources.",
"High cost of targeted therapies and diagnostics limits accessibility.",
"Workforce shortages in oncology and pathology affect quality of care.",
"Persistent inequities between rural and urban health systems.",
"Slow policy uptake may delay systematic early detection measures."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Available in major urban areas (Cairo, Alexandria), but regional/rural access is weak."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Limited; HER2, MSI-H, PD-L1 testing mostly in tertiary/research hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; disparities in smaller facilities."},
            "Research_Funding": {"score": "2/5", "disc": "Ongoing but limited; some biomarker and H. pylori-related studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Modest efforts; gastric cancer awareness remains lower than for other cancers."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Outcomes improving but still below global averages due to late diagnosis."},
            "Early_Detection": {"score": "2/5", "disc": "No organized screening; endoscopy access mainly in urban hospitals."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited integration and weak opioid availability in rural areas."}
        },
        "biomarkers": {
            "HER2":{"score": "50%", "disc": "Most accessible biomarker; used for targeted therapy eligibility."},
            "MSI_H/dMMR": {"score": "40%", "disc": "Available in select tertiary hospitals."},
            "PDL_1_CPS>1": {"score": "40%", "disc": "Limited but increasing access for immunotherapy selection."},
            "CLDN18.2": {"score": "25%", "disc": "Minimal availability; mostly in research settings."},
            "FGFR2b": {"score": "20%", "disc": "Rarely available, limited to research."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines exist and implemented in tertiary centers."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in urban tertiary hospitals; limited in smaller centers."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with NCCN/ESMO, uneven adoption."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Major centers update regularly; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Integrated partially, especially for advanced/metastatic cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; gaps for advanced/targeted therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket costs remain significant."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "--", "disc": "No organized national screening; opportunistic endoscopy in urban centers only."}
        }
    },


    {
        "id": 174,
        "cancer_type": "gastric",
        "country": "Etiopia",
        "country_shortForm": "ET",
        "introduction": "Gastric cancer in Ethiopia remains largely underdiagnosed, with limited structured screening and treatment access. Specialized oncology services are concentrated in a few urban centers, leaving rural populations underserved. Advanced diagnostics, including molecular testing, are largely unavailable outside select research programs. Clinical guidelines exist but implementation is weak due to resource constraints. Reimbursement and no-cost access are minimal, leading to high out-of-pocket expenses. Awareness of gastric cancer is low, and early detection relies mainly on symptomatic presentation rather than proactive screening. Overall, gastric cancer care in Ethiopia shows low-to-moderate maturity, with major gaps in infrastructure, early detection, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Centralized tertiary hospitals provide some standard diagnostic and treatment services.",
"Presence of nascent oncology research initiatives.",
"Awareness of clinical guidelines exists in academic centers."
],

            "Weaknesses":
                ["Very limited specialized cancer centers and oncology infrastructure outside urban hubs.",
"Molecular biomarker testing is almost absent.",
"No national screening programs; diagnosis usually occurs at advanced stages.",
"Low public awareness and health-seeking behavior for gastric symptoms.",
"High out-of-pocket costs due to limited reimbursement.",
"Palliative care is scarce and poorly integrated."
],

            "Opportunities": 
                ["Expansion of specialized centers and oncology infrastructure.",
"Introduce pilot screening and early detection programs in high-risk populations.",
"Strengthen palliative care access, including opioid availability.",
"Increase public awareness campaigns for gastric cancer.",
"Participate in regional and international research collaborations."
],

            "Threats": 
                ["Rising gastric cancer burden could overwhelm limited health system capacity.",
"Budgetary constraints may delay adoption of advanced diagnostics and therapies.",
"Geographic inequities may worsen disparities between urban and rural populations.",
"Workforce shortages in oncology and gastroenterology."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Very few oncology centers concentrated in urban areas; rural access almost nonexistent."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Minimal infrastructure; biomarkers rarely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Limited to tertiary centers; rural patients have poor access."},
            "Research_Funding": {"score": "1/5", "disc": "Scarce funding; only small-scale academic studies exist."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Minimal public awareness; campaigns largely absent."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Late-stage diagnosis common; survival below global averages."},
            "Early_Detection": {"score": "1/5", "disc": "No systematic screening; detection mostly symptomatic."},
            "Palliative_Care": {"score": "1/5", "disc": "Very limited services; opioid and home-based care scarce."}
        },
        "biomarkers": {
            "HER2":{"score": "10%", "disc": "Rare testing, mostly research settings."},
            "MSI_H/dMMR": {"score": "5%", "disc": "Almost never tested outside research."},
            "PDL_1_CPS>1": {"score": "5%", "disc": "Very limited availability."},
            "CLDN18.2": {"score": "2%", "disc": "Experimental; almost no clinical use."},
            "FGFR2b": {"score": "2%", "disc": "Minimal access; research-only."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Guidelines exist but poorly implemented."},
            "Feasibility": {"score": "1/5", "disc": "Resource constraints hinder guideline integration."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Limited alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Minimal adoption of updates; mostly academic awareness."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Almost no structured implementation."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal coverage; high out-of-pocket costs."},
            "No-cost_Access": {"score": "1/5", "disc": "Almost no programs for subsidized care."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No screening infrastructure", "disc": "No organized national or regional screening; detection opportunistic."}
        }
    },


    {
        "id": 175,
        "cancer_type": "gastric",
        "country": "Germany",
        "country_shortForm": "DE",
        "introduction": "Germany has advanced infrastructure and care pathways for gastric cancer, particularly in urban tertiary hospitals. Specialized cancer centers and academic hospitals provide comprehensive diagnostics, multimodal treatments, and access to clinical trials. Molecular testing for biomarkers (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is widely available. Clinical guidelines are well established and consistently implemented across most centers, with strong alignment to ESMO/NCCN standards. Screening is not organized at a national level; however, high-risk patients may receive targeted endoscopic surveillance. Overall, gastric cancer care in Germany demonstrates high maturity, with minor gaps in universal screening and some reimbursement coverage.",
        "swot_analysis": {
            "Strengths":
                ["High density of specialized cancer centers and tertiary hospitals.",
"Comprehensive access to multimodal treatment options (surgery, chemotherapy, targeted therapy).",
"Robust molecular testing and biomarker-guided treatment.",
"Strong clinical guideline implementation and alignment with international standards.",
"Active participation in clinical trials and research."
],

            "Weaknesses":
                ["No national gastric cancer screening program.",
"Out-of-pocket costs exist for certain advanced therapies, despite good reimbursement.",
"Rural areas may have slightly lower access to specialized centers compared to urban centers."
],

            "Opportunities": 
                ["Develop national or regional screening programs for high-risk populations.",
"Expand telemedicine for remote regions to improve access to expertise.",
"Increase public awareness campaigns for early detection."
],

            "Threats": 
                ["Rising incidence in aging populations may strain tertiary centers.",
"Budgetary pressures could limit adoption of expensive targeted therapies.",
"Regional disparities in access may persist despite overall strong infrastructure."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "High number of specialized centers in urban and tertiary hospitals."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Full multimodal therapy available at tertiary centers."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national funding and active participation in international trials."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Public campaigns and professional awareness programs established."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early intervention and advanced therapies."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic detection and high-risk surveillance; no national screening."},
            "Palliative_Care": {"score": "5/5", "disc": "Integrated palliative care services widely accessible."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Standard testing in eligible gastric cancer patients."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Routinely tested in tertiary hospitals."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Widely implemented to guide immunotherapy."},
            "CLDN18.2": {"score": "70%", "disc": "Available in specialized centers; increasing adoption."},
            "FGFR2b": {"score": "55%", "disc": "Limited to selected tertiary hospitals; emerging adoption."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Well integrated and adhered to in most centers."},
            "Feasibility": {"score": "5/5", "disc": "Fully feasible in tertiary and specialized hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "National centers consistently update protocols."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully implemented for advanced and metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Good coverage for standard therapies; advanced therapies partially covered."},
            "No-cost_Access": {"score": "3/5", "disc": "Patients may incur some out-of-pocket costs for certain treatments."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic/high-risk only", "disc": "No organized national program; surveillance in high-risk populations."}
        }
    },


    {
        "id": 176,
        "cancer_type": "gastric",
        "country": "Greece",
        "country_shortForm": "GR",
        "introduction": "Gastric cancer in Greece has moderate care infrastructure with access concentrated in urban centers. Specialized centers provide standard treatments and adhere reasonably well to international guidelines. Early detection programs are limited, and no national screening exists, leading to late-stage diagnosis in some cases. Molecular testing is available but not uniformly applied. Awareness campaigns exist but uptake remains modest. Reimbursement is partial, and patients often face out-of-pocket costs for advanced therapies. Overall, gastric cancer care in Greece shows moderate maturity, with key gaps in screening, biomarker utilization, and equitable access outside major cities.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized centers in major cities.",
"Standard treatment modalities (surgery, chemotherapy, radiotherapy) available in tertiary hospitals.",
"National clinical guidelines exist and are reasonably implemented.",
"Molecular testing and biomarker analysis available in selected centers."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing outside urban centers.",
"No organized population-level screening program.",
"Awareness campaigns exist but coverage is uneven.",
"Rural and socioeconomically disadvantaged populations face barriers to care.",
"Partial reimbursement; high out-of-pocket costs for advanced treatments."
],

            "Opportunities": 
                ["Expand molecular diagnostics and biomarker-guided therapy access.",
"Develop pilot early detection programs for high-risk populations.",
"Increase public awareness campaigns and community outreach.",
"Strengthen palliative care coverage, especially in rural regions.",
"Foster inclusion of Greek patients in international clinical trials."
],

            "Threats": 
                ["Rising incidence could overwhelm existing health system capacity.",
"Budget limitations may restrict adoption of advanced therapies.",
"Unequal access between private and public sectors could worsen disparities.",
"Lack of organized screening risks continued late-stage presentation."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Established centers in urban areas; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Biomarker testing available in selected tertiary centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; rural inequities remain."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing but modest; contributes to regional and local data."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some campaigns exist; uptake limited outside cities."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Survival relatively good in tertiary centers; late-stage diagnosis still a concern."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic detection in symptomatic patients; no national program."},
            "Palliative_Care": {"score": "4/5", "disc": "Available in tertiary hospitals; rural coverage limited."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Widely tested in advanced/metastatic cases."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Available in select centers; informs immunotherapy use."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Moderate adoption; used in therapy decisions."},
            "CLDN18.2": {"score": "40%", "disc": "Limited availability; emerging biomarker."},
            "FGFR2b": {"score": "30%", "disc": "Limited; mostly in research or specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines implemented mostly in tertiary hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in well-equipped centers; smaller hospitals lag."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Alignment with ESMO/NCCN; partial implementation outside urban centers."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers update regularly; smaller centers slower."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Integrated in tertiary hospitals, particularly for advanced cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial reimbursement; some out-of-pocket costs remain."},
            "No-cost_Access": {"score": "3/5", "disc": "Limited subsidy; mostly for standard therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No national program", "disc": "Detection opportunistic; awareness campaigns limited."}
        }
    },


    {
        "id": 177,
        "cancer_type": "gastric",
        "country": "India",
        "country_shortForm": "IN",
        "introduction": "Gastric cancer in India presents moderate-to-high challenges, with disparities between urban and rural access. Specialized oncology centers are concentrated in major metros, while advanced diagnostics, including molecular testing (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b), are mostly available in private tertiary hospitals. Clinical guidelines exist and are moderately well implemented, with partial alignment to international standards. Public awareness and screening programs are limited, and opportunistic detection is the norm. Reimbursement coverage is low, and out-of-pocket costs remain a significant barrier. Overall, gastric cancer care in India shows relatively high maturity (level 4), with strong treatment and research capabilities but gaps in equitable access, screening, and biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Presence of specialized oncology centers in major cities (Delhi, Mumbai, Bengaluru).",
"Access to standard gastric cancer treatments (surgery, chemotherapy, radiotherapy, targeted therapy) in tertiary hospitals.",
"National and institutional clinical guidelines exist and are partially implemented.",
"Active research on gastric cancer, including biomarker-driven therapy trials."
],

            "Weaknesses":
                ["Limited molecular testing outside private or tertiary hospitals.",
"No national gastric cancer screening program; reliance on opportunistic detection.",
"Rural and socioeconomically disadvantaged populations face limited access.",
"Reimbursement coverage is minimal; high out-of-pocket burden persists."
],

            "Opportunities": 
                ["Expand molecular testing infrastructure for biomarkers such as HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b.",
"Develop national gastric cancer early detection initiatives.",
"Strengthen public awareness campaigns and community outreach.",
"Leverage tele-oncology to bridge urban-rural gaps.",
"Encourage participation in international clinical trials for novel therapies."
],

            "Threats": 
                ["Rising gastric cancer incidence could strain healthcare capacity.",
"Disparities between private and public sectors may widen.",
"Limited reimbursement could delay adoption of advanced therapies.",
"Workforce shortages in oncology may affect timely care delivery."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Specialized oncology centers available in major cities; rural coverage limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Advanced biomarkers mostly in private or tertiary hospitals; limited nationwide access."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies widely available in urban centers; some regional inequities."},
            "Research_Funding": {"score": "4/5", "disc": "Robust academic and clinical research, including biomarker studies."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some public awareness initiatives exist; uptake in rural areas is limited."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival due to late-stage diagnosis; improving in tertiary centers."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic detection; no organized national screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services improving in tertiary hospitals; rural access remains weak."}
        },
        "biomarkers": {
            "HER2":{"score": "50%", "disc": "Testing mainly in tertiary/private hospitals."},
            "MSI_H/dMMR": {"score": "40%", "disc": "Limited but available for eligible patients."},
            "PDL_1_CPS>1": {"score": "40%", "disc": "Increasing use in targeted therapy decisions."},
            "CLDN18.2": {"score": "20%", "disc": "Early-stage adoption; limited availability."},
            "FGFR2b": {"score": "15%", "disc": "Very limited; mostly research-driven."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines moderately implemented; tertiary hospitals perform best."},
            "Feasibility": {"score": "3/5", "disc": "Implementation feasible in well-equipped centers."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers engage; smaller centers lag."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Integrated for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Minimal coverage; mostly out-of-pocket."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited government subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No population-level program; mainly private sector opportunistic screening."}
        }
    },


    {
        "id": 178,
        "cancer_type": "gastric",
        "country": "Indonesia",
        "country_shortForm": "ID",
        "introduction": "Gastric cancer in Indonesia is a significant health burden, with high incidence in certain regions and late-stage presentation common. Specialized care is concentrated in urban tertiary hospitals, while rural access is limited. Molecular testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) exists but is restricted to selected centers. Clinical guidelines are available but inconsistently implemented. Screening programs are largely absent, except in some private urban centers. Treatment access, awareness campaigns, and palliative care are developing but unevenly distributed. Overall, gastric cancer care shows low-to-moderate maturity, with major gaps in early detection, biomarker testing, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Specialized oncology centers in major cities (Jakarta, Surabaya, Bandung).",
"Availability of standard treatments including surgery, chemotherapy, and radiotherapy in tertiary hospitals.",
"Some local research on gastric cancer biomarkers and therapies."
],

            "Weaknesses":
                ["Limited access to molecular diagnostics outside urban centers.",
"Biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is sparse.",
"No organized population-based screening program; detection mostly opportunistic.",
"Palliative care coverage is weak and uneven.",
"Rural and low-income populations face significant access and financial barriers."
],

            "Opportunities": 
                ["Expand molecular diagnostic access across tertiary and regional hospitals.",
"Strengthen palliative care infrastructure and opioid availability.",
"Launch awareness campaigns and community education on gastric cancer risk and symptoms.",
"Pilot systematic early detection programs in high-risk populations.",
"Inclusion of Indonesian patients in international clinical trials."
],

            "Threats": 
                ["Rising incidence may overwhelm limited oncology resources.",
"Budgetary constraints could restrict advanced treatment adoption.",
"Disparities between private and public sectors may worsen.",
"Workforce shortages in oncology and surgery, especially in rural regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major metros; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Biomarker testing limited to select tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in urban tertiary hospitals; inequities persist."},
            "Research_Funding": {"score": "2/5", "disc": "Local studies ongoing but modest; limited national funding."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Some campaigns exist; awareness and uptake remain low in underserved areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Survival lower than global standards due to late diagnosis."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic detection; no organized screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Limited services, especially in rural areas; opioid access challenges."}
        },
        "biomarkers": {
            "HER2":{"score": "40%", "disc": "Available in select urban centers."},
            "MSI_H/dMMR": {"score": "30%", "disc": "Sparse access; mostly in research or tertiary hospitals."},
            "PDL_1_CPS>1": {"score": "30%", "disc": "Limited use in select centers."},
            "CLDN18.2": {"score": "20%", "disc": "Minimal testing, available in research settings."},
            "FGFR2b": {"score": "15%", "disc": "Very limited access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but poorly implemented outside major centers."},
            "Feasibility": {"score": "2/5", "disc": "Integration feasible in well-equipped hospitals only."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Smaller centers lag behind updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Limited implementation, mostly in tertiary hospitals."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; many advanced therapies not covered."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients face out-of-pocket costs; subsidies limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No program", "disc": "Screening exists only in some urban private settings; no population-level program."}
        }
    },


    {
        "id": 179,
        "cancer_type": "gastric",
        "country": "Italy",
        "country_shortForm": "IT",
        "introduction": "Italy has a moderately mature gastric cancer care system, with strong tertiary centers and research infrastructure, yet some gaps exist in nationwide screening, early detection, and equitable access. Advanced diagnostics and biomarker testing are widely available in specialized hospitals, while smaller centers may have limited access. Clinical guidelines are well implemented, and treatment coverage is adequate, though reimbursement and population-level screening remain partial. Awareness campaigns are ongoing but uptake is variable across regions. Overall, Italy demonstrates moderate maturity in gastric cancer care, with strengths in clinical infrastructure and biomarker utilization but opportunities for expanded screening and public health engagement.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized cancer centers in major cities.",
"Access to advanced diagnostics and molecular biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b).",
"National clinical guidelines well implemented, aligned with ESMO recommendations.",
"Moderate public awareness campaigns and ongoing research programs."
],

            "Weaknesses":
                ["No organized population-level screening; risk-based surveillance only.",
"Some disparities in rural or smaller hospitals in access to advanced diagnostics and treatments.",
"Limited no-cost access for some advanced therapies.",
"Uptake of early detection programs varies regionally."
],

            "Opportunities": 
                ["Expand awareness campaigns to underserved regions.",
"Develop pilot organized screening for high-risk populations.",
"Strengthen integration of biomarkers into standard clinical pathways across all centers.",
"Improve reimbursement and no-cost access for advanced therapies."
],

            "Threats": 
                ["Rising incidence of gastric cancer in certain regions may strain specialized centers.",
"Budget constraints could limit adoption of novel targeted therapies.",
"Regional disparities in access may perpetuate inequities.",
"Late-stage diagnosis remains a risk due to lack of organized screening."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Strong tertiary centers in major cities; rural regions have limited access."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Advanced biomarker testing widely available in specialized hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies and targeted treatments accessible in urban hospitals."},
            "Research_Funding": {"score": "4/5", "disc": "Active clinical research programs and participation in international trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Moderate public awareness initiatives; uptake varies by region."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Outcomes above global averages due to early treatment in tertiary centers."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic or risk-based detection; no organized national screening."},
            "Palliative_Care": {"score": "4/5", "disc": "Comprehensive services in specialized centers; rural access limited."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Standardized testing in most tertiary centers."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Widely tested in advanced cases."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Incorporated in immunotherapy decisions."},
            "CLDN18.2": {"score": "70%", "disc": "Available in selected tertiary hospitals."},
            "FGFR2b": {"score": "55%", "disc": "Limited but available in specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Well implemented across tertiary hospitals."},
            "Feasibility": {"score": "5/5", "disc": "Easy integration in equipped hospitals; smaller centers less consistent."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Fully aligned with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "National centers actively incorporate updates."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated in advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage for advanced therapies."},
            "No-cost_Access": {"score": "3/5", "disc": "Some subsidies exist; out-of-pocket costs still apply."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic/risk-based", "disc": "No organized program; mainly surveillance for high-risk individuals."}
        }
    },


    {
        "id": 180,
        "cancer_type": "gastric",
        "country": "Japan",
        "country_shortForm": "JP",
        "introduction": "Japan has one of the most advanced gastric cancer care systems globally. Early detection is facilitated by a well-established national screening program using UGIS or endoscopy every 2 years for individuals aged 50+. Specialized centers and tertiary hospitals are widely accessible, and molecular testing is integrated into clinical decision-making. Treatment access is comprehensive, including surgery, chemotherapy, targeted therapy, and immunotherapy. Clinical guidelines are closely aligned with international standards and are widely implemented. Public insurance provides broad reimbursement, minimizing out-of-pocket costs. Research and awareness campaigns are robust, contributing to high survival rates. Overall, gastric cancer care in Japan demonstrates very high maturity, with strong infrastructure, equitable access, and systematic early detection.",
        "swot_analysis": {
            "Strengths":
                ["National gastric cancer screening program ensures early detection.",
"Specialized centers widely available with high treatment capabilities.",
"Advanced molecular and genetic testing is routinely used in treatment planning.",
"Clinical guidelines closely follow international standards (ESMO/NCCN).",
"High survival rates due to early detection and comprehensive treatment.",
"Strong public insurance coverage reduces financial burden on patients."
],

            "Weaknesses":
                ["Minor regional disparities may exist in rural access to endoscopy specialists.",
"High-volume screening requires continuous resource allocation and skilled personnel."
],

            "Opportunities": 
                ["Expand precision medicine initiatives for personalized therapy.",
"Further integration of AI-assisted diagnostics in screening programs.",
"Promote patient-centered care models, including survivorship programs."
],

            "Threats": 
                ["Aging population increases screening demand and treatment workload.",
"Healthcare workforce shortages could impact long-term sustainability."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive network of specialized hospitals and tertiary centers nationwide."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced molecular diagnostics routinely integrated in clinical care."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Full access to surgery, chemotherapy, targeted therapy, and immunotherapy."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national and international research programs."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "Ongoing public health campaigns promote early detection and prevention."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and treatment effectiveness."},
            "Early_Detection": {"score": "5/5", "disc": "National screening program with endoscopy every 2 years for adults 50+."},
            "Palliative_Care": {"score": "5/5", "disc": "Well-developed palliative care services integrated into cancer care."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Widely tested for targeted therapy decisions."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Routinely assessed in clinical practice."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Used to guide immunotherapy decisions."},
            "CLDN18.2": {"score": "60%", "disc": "Increasingly incorporated into therapy selection."},
            "FGFR2b": {"score": "50%", "disc": "Emerging biomarker with growing clinical use."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines consistently applied nationwide."},
            "Feasibility": {"score": "4/5", "disc": "Easily integrated into clinical workflow."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Aligned with ESMO/NCCN, minor local adaptations."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Regular updates adopted by centers"},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Advanced/metastatic care guided by international standards."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "5/5", "disc": "Comprehensive coverage under national health insurance."},
            "No-cost_Access": {"score": "5/5", "disc": "Minimal out-of-pocket expenses for patients."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "National program: UGIS or endoscopy every 2 years for people aged 50+", "disc": "Systematic, population-level screening in place."}
        }
    },


    {
        "id": 181,
        "cancer_type": "gastric",
        "country": "Kenya",
        "country_shortForm": "KE",
        "introduction": "Gastric cancer in Kenya is a rising concern, though it remains less prioritized compared to other cancers such as cervical and breast. Detection is typically late-stage due to the absence of systematic screening and limited public awareness. Specialized centers exist in Nairobi, Eldoret, and Mombasa, but rural populations face significant barriers. Access to advanced diagnostics and molecular testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is minimal, concentrated in tertiary hospitals and private labs. Standard treatment options (surgery, chemotherapy, limited radiotherapy) are available but unevenly distributed. Palliative care access is developing but remains inadequate, particularly in rural areas. Clinical guidelines exist but are inconsistently implemented, with partial alignment to international standards. Reimbursement and public insurance coverage are weak, resulting in high out-of-pocket costs. Overall, gastric cancer care in Kenya shows moderate maturity (Level 3), with significant gaps in early detection, biomarker access, and equitable service delivery.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer treatment centers exist in major cities (Nairobi, Eldoret, Mombasa).",
"Access to basic surgery, chemotherapy, and limited radiotherapy in tertiary hospitals.",
"Presence of a national cancer control strategy with some inclusion of gastric cancer.",
"Emerging local research capacity in oncology."
],

            "Weaknesses":
                ["Very limited biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b).",
"No organized screening or systematic early detection.",
"Survival rates remain poor due to late diagnosis.",
"Palliative care services and opioid accessibility remain underdeveloped.",
"High patient out-of-pocket burden with limited public coverage.",
"Scarcity of gastric cancer specialists (gastroenterologists, oncologists) outside cities."
],

            "Opportunities": 
                ["Expand HER2 and MSI-H/dMMR testing to enable access to targeted therapies.",
"Strengthen community-based awareness and early detection initiatives.",
"Integrate gastric cancer into national cancer screening pilots for high-risk groups.",
"Increase clinical trial participation and partnerships with global research bodies.",
"Leverage telemedicine for oncology consultations in rural areas."
],

            "Threats": 
                ["Rising gastric cancer incidence due to lifestyle and infection (H. pylori) risks.",
"Limited funding for cancer care may delay introduction of advanced therapies.",
"Persistent disparities between public and private healthcare sectors.",
"Workforce shortages may worsen with rising demand.",
"Late-stage diagnosis trend risks sustaining low survival outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Specialized centers exist in major cities, but rural access remains very limited."},
            "Genetic_Molecular_Testing": {"score": "/5", "disc": "Testing for HER2, MSI-H, and PD-L1 exists in few tertiary/private labs; CLDN18.2 and FGFR2b access minimal."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies available in urban centers; inequities persist in rural regions."},
            "Research_Funding": {"score": "1/5", "disc": "Limited research focus on gastric cancer compared to other cancers."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Low awareness; few initiatives targeting gastric cancer specifically."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival is poor, largely due to late presentation and limited treatment reach."},
            "Early_Detection": {"score": "2/5", "disc": "No organized national screening; diagnosis mostly symptom-driven."},
            "Palliative_Care": {"score": "2/5", "disc": "Expanding services but still inadequate, especially outside major cities."}
        },
        "biomarkers": {
            "HER2":{"score": "20%", "disc": "Limited availability, mainly in private tertiary labs."},
            "MSI_H/dMMR": {"score": "10%", "disc": "Minimal access; available only in select research/urban facilities."},
            "PDL_1_CPS>1": {"score": "10%", "disc": "Rarely available outside research/private centers."},
            "CLDN18.2": {"score": "5%", "disc": "Very limited, almost exclusively research settings."},
            "FGFR2b": {"score": "5%", "disc": "Almost no clinical access; restricted to pilot/research contexts."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but inconsistently implemented."},
            "Feasibility": {"score": "2/5", "disc": "Feasible in tertiary centers; not practical in rural settings."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial adoption of NCCN/ESMO, mostly in larger hospitals."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Limited engagement with updates beyond national referral centers."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Minimal integration, mostly for advanced-stage treatment reference."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "National insurance provides limited coverage; advanced therapies excluded."},
            "No-cost_Access": {"score": "1/5", "disc": "Patients pay out-of-pocket for most diagnostics and therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "--", "disc": "No formal gastric cancer screening; availability very limited and opportunistic."}
        }
    },


    {
        "id": 182,
        "cancer_type": "gastric",
        "country": "Malaysia",
        "country_shortForm": "MY",
        "introduction": "Gastric cancer remains a significant health concern in Malaysia, though its incidence is lower than in East Asian countries. Systematic detection and equitable access to care are underdeveloped, with diagnosis often occurring at later stages due to lack of organized screening. Specialized oncology centers are concentrated in major cities such as Kuala Lumpur and Penang, while rural populations face access challenges. Molecular biomarker utilization (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is emerging but limited, mostly available in tertiary hospitals and private facilities. Clinical guidelines exist and are partially aligned with international standards, but implementation across centers is uneven. Reimbursement remains weak, with high out-of-pocket burden for advanced therapies. Overall, gastric cancer care in Malaysia is at an early-intermediate maturity level (2/5), constrained by weak screening, limited biomarker adoption, and access inequities.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major urban hubs.",
"Access to standard treatments (surgery, chemotherapy, radiotherapy) in tertiary hospitals.",
"Availability of some biomarker testing (HER2, PD-L1, MSI-H) in select facilities.",
"National clinical guidelines in place with partial alignment to global standards."
],

            "Weaknesses":
                ["No organized population-based gastric cancer screening program.",
"Biomarker adoption (CLDN18.2, FGFR2b) remains very limited.",
"Rural and underserved populations face major access challenges.",
"Low awareness and late presentation remain common.",
"Limited reimbursement and lack of no-cost access for novel therapies."
],

            "Opportunities": 
                ["Develop pilot early detection programs in high-risk populations.",
"Expand molecular diagnostic infrastructure beyond tertiary hospitals.",
"Strengthen awareness and education campaigns to promote earlier detection.",
"Foster participation in international clinical trials to improve access to innovative therapies.",
"Integrate telemedicine solutions to extend oncology expertise to peripheral regions."],

            "Threats": 
                ["Rising burden of non-communicable diseases may strain cancer funding.",
"Inequities between public and private sectors risk widening disparities.",
"Workforce shortages in oncology and gastroenterology.",
"Delayed adoption of advanced targeted therapies due to budget constraints."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major cities, but rural access is poor."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Limited infrastructure; advanced biomarkers mainly in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard treatments available in tertiary hospitals; inequities persist."},
            "Research_Funding": {"score": "2/5", "disc": "Limited gastric cancer-specific research; modest academic activity."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Some campaigns exist, but awareness of gastric cancer remains low."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; late-stage diagnosis limits outcomes."},
            "Early_Detection": {"score": "2/5", "disc": "No organized screening; opportunistic endoscopy only."},
            "Palliative_Care": {"score": "3/5", "disc": "Services improving, but limited reach in rural settings."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Widely tested in advanced cases."},
            "MSI_H/dMMR": {"score": "40%", "disc": "Available in tertiary/private centers."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Used for immunotherapy eligibility."},
            "CLDN18.2": {"score": "20%", "disc": "Rarely available; limited to research/private labs."},
            "FGFR2b": {"score": "15%", "disc": "Minimal testing capacity."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Implemented in tertiary hospitals; weaker in smaller centers."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in better-resourced hospitals."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with NCCN/ESMO standards."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Limited uptake of frequent global updates."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Integrated for advanced/metastatic disease management."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "/5", "disc": "Partial coverage under public insurance; gaps for novel therapies."},
            "No-cost_Access": {"score": "/5", "disc": "High out-of-pocket burden; limited subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "", "disc": "No national screening program; opportunistic endoscopy only."}
        }
    },


    {
        "id": 183,
        "cancer_type": "gastric",
        "country": "Mexico",
        "country_shortForm": "MX",
        "introduction": "Gastric cancer remains a significant health challenge in Mexico, with incidence concentrated in specific regions and high mortality due to late-stage diagnosis. Specialized centers and oncology expertise are available mainly in major cities, while rural access is limited. Molecular testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is available in select private and tertiary facilities but not widely implemented. National clinical guidelines exist and show moderate implementation in tertiary centers, partially aligned with international standards. Reimbursement and no-cost access are limited, contributing to high out-of-pocket costs. Screening programs are absent at the population level, with most detection occurring opportunistically. Overall, gastric cancer care in Mexico demonstrates moderate maturity, with gaps in molecular diagnostics, screening, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Specialized oncology centers available in major cities (Mexico City, Monterrey, Guadalajara).",
"Standard treatment options (surgery, chemotherapy, targeted therapy) accessible in tertiary hospitals.",
"National clinical guidelines exist and are implemented in higher-tier hospitals.",
"Active participation in clinical research in some centers."
],

            "Weaknesses":
                ["Limited access to molecular and biomarker testing outside major urban centers.",
"Screening programs are absent; diagnosis mostly occurs at advanced stages.",
"Palliative care is unevenly available, with gaps in opioid access.",
"High financial burden due to partial reimbursement and limited subsidy programs.",
"Rural and low-income populations face significant barriers to specialized care"
],

            "Opportunities": 
                ["Expand molecular diagnostics (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b) for targeted therapies.",
"Develop pilot programs for systematic early detection in high-risk populations.",
"Strengthen palliative care and integrate it with national cancer policies.",
"Increase public awareness campaigns for gastric cancer prevention and early detection.",
"Include more Mexican patients in international clinical trials for advanced therapies."
],

            "Threats": 
                ["Rising incidence may strain the healthcare system.",
"Budgetary constraints could limit access to advanced diagnostics and treatments.",
"Socioeconomic disparities may exacerbate inequities in care.",
"Lack of organized screening risks continued late-stage diagnoses.",
"Workforce shortages in oncology, especially outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Centers exist in major cities, limited rural access."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Advanced biomarker testing (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b) limited to select tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; inequities in rural regions."},
            "Research_Funding": {"score": "2/5", "disc": "Modest research activity; some participation in clinical trials."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Awareness initiatives exist but uptake in underserved regions remains low."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival, affected by late diagnosis."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic detection; no national screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available in urban centers; limited in rural areas."}
        },
        "biomarkers": {
            "HER2":{"score": "60%", "disc": "Widely tested in eligible advanced cases."},
            "MSI_H/dMMR": {"score": "50%", "disc": "Limited but available in tertiary centers."},
            "PDL_1_CPS>1": {"score": "50%", "disc": "Moderate access in advanced/metastatic cases."},
            "CLDN18.2": {"score": "30%", "disc": "Rarely tested; emerging biomarker."},
            "FGFR2b": {"score": "25%", "disc": "Limited to research or specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines adopted in tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in well-equipped hospitals; limited elsewhere."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates integrated mainly in tertiary centers."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially implemented, especially for advanced care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited insurance coverage; gaps for targeted therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "High out-of-pocket burden; few subsidies available."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No organized program; early detection mostly opportunistic."}
        }
    },


    {
        "id": 184,
        "cancer_type": "gastric",
        "country": "Morocco",
        "country_shortForm": "MA",
        "introduction": "Gastric cancer in Morocco presents a growing public health challenge, with late-stage diagnosis being common due to the absence of national screening programs and limited early detection infrastructure. Specialized oncology services are concentrated in major cities, while rural populations face significant access barriers. Advanced diagnostics and molecular biomarker testing are gradually emerging but remain limited to select tertiary hospitals. Treatment options such as surgery, chemotherapy, and targeted therapy are available in urban centers, but reimbursement gaps and out-of-pocket costs restrict equitable access. Awareness campaigns are modest, and palliative care services remain underdeveloped. Overall, Morocco’s gastric cancer care system reflects an intermediate maturity level (3/5), with progress in infrastructure and diagnostics but major gaps in early detection, equitable access, and biomarker utilization.",
        "swot_analysis": {
            "Strengths":
                ["Oncology services established in key urban centers (Casablanca, Rabat, Marrakesh).",
                "Availability of standard therapies (surgery, chemotherapy, radiotherapy).",
"Growing integration of molecular testing (HER2, MSI-H/dMMR, PD-L1) in tertiary hospitals.",
"Existence of national oncology strategies within broader cancer control plans."
],

            "Weaknesses":
                ["Specialized care largely concentrated in cities; rural patients face geographic and financial barriers.",
"Very limited access to advanced biomarkers (CLDN18.2, FGFR2b).",
"Clinical guideline adoption is weak, with inconsistent alignment to ESMO recommendations.",
"Low public awareness and absence of gastric cancer–specific campaigns.",
"Palliative care coverage remains underdeveloped."
],

            "Opportunities": 
                ["Expansion of molecular testing and integration of HER2, PD-L1, and MSI-H testing into routine pathways.",
"Strengthening national reimbursement policies to reduce financial burden for advanced therapy.",
"Leveraging tele-oncology to bridge gaps between rural and urban centers.",
"Development of national awareness campaigns on gastric cancer risk factors (diet, H. pylori infection).",
"Participation in multinational gastric cancer clinical trials to expand treatment options."
],

            "Threats": 
                ["Rising burden of gastric cancer may overwhelm already strained oncology services.",
"Budgetary constraints may limit adoption of targeted therapies.",
"Continued late-stage diagnosis in absence of screening.",
"Urban–rural inequities risk widening treatment outcome disparities.",
"Limited oncology workforce outside major urban centers."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Oncology centers exist in major cities but limited in rural areas."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Basic testing available (HER2, MSI-H, PD-L1); CLDN18.2 and FGFR2b very limited."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Standard therapies accessible in tertiary hospitals; inequitable distribution."},
            "Research_Funding": {"score": "2/5", "disc": "Modest; some participation in academic/regional studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Minimal; gastric cancer–specific awareness lacking."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival rates below global averages due to late presentation."},
            "Early_Detection": {"score": "2/5", "disc": "No organized screening; diagnosis mainly at symptomatic stages."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited services and opioid availability, especially in rural areas."}
        },
        "biomarkers": {
            "HER2":{"score": "40%", "disc": "Increasingly available in tertiary centers."},
            "MSI_H/dMMR": {"score": "30%", "disc": "Limited access, mostly research-linked."},
            "PDL_1_CPS>1": {"score": "30%", "disc": "Gradual adoption, mostly for advanced disease."},
            "CLDN18.2": {"score": "20%", "disc": "Minimal access; restricted to select centers."},
            "FGFR2b": {"score": "15%", "disc": "Rarely available; limited infrastructure."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Weak integration into practice."},
            "Feasibility": {"score": "2/5", "disc": "Possible in tertiary centers; limited in smaller hospitals."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO, inconsistent application."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "National centers partially adopt updates; lag outside cities."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Minimal integration; particularly weak for advanced therapies."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; advanced therapies often excluded."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket expenses remain high; subsidy programs limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "--", "disc": "No national screening program; very limited access to opportunistic endoscopy."}
        }
    },


    {
        "id": 185,
        "cancer_type": "gastric",
        "country": "Netherlands",
        "country_shortForm": "NL",
        "introduction": "Gastric cancer in the Netherlands benefits from a well-resourced healthcare system with robust infrastructure, high treatment accessibility, and strong research integration. However, organized population-level screening is not in place, although research on H. pylori test-and-treat strategies is ongoing. Advanced molecular diagnostics are widely available, and clinical guidelines are closely aligned with international standards (ESMO). Access to treatment is generally equitable, though reimbursement gaps exist for some advanced therapies. Overall, gastric cancer care shows high maturity, with strong outcomes and early detection in clinical settings but limited organized screening programs.",
        "swot_analysis": {
            "Strengths":
                ["Comprehensive specialized cancer centers across the country.",
"Advanced molecular testing infrastructure widely available.",
"High standard of care with access to modern therapies.",
"Strong national clinical guidelines aligned with ESMO.",
"High research activity, contributing to international clinical trials."
],

            "Weaknesses":
                ["No population-based gastric cancer screening program.",
"Some gaps in reimbursement and no-cost access for specific advanced treatments.",
"Rural access is equitable but minor delays in diagnosis may occur in non-specialized hospitals."
],

            "Opportunities": 
                ["Implement organized screening based on risk stratification and H. pylori testing.",
"Expand biomarker-guided therapies and personalized treatment protocols.",
"Increase public awareness campaigns on gastric cancer risk factors and early symptoms."
],

            "Threats": 
                ["Rising incidence of gastric cancer due to aging population.",
"Budget constraints may affect adoption of cutting-edge therapies.",
"Inequities could emerge if new technologies are concentrated in tertiary centers."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive specialized centers across the country."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced molecular diagnostics widely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced therapies accessible to most patients."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national research and participation in international trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Ongoing awareness programs; some gaps in public knowledge persist."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival rates due to timely diagnosis and effective treatment."},
            "Early_Detection": {"score": "5/5", "disc": "Opportunistic detection effective; no organized national screening."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive palliative care coverage."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Widely tested in eligible patients."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Routinely tested in advanced disease."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Standard testing for immunotherapy eligibility."},
            "CLDN18.2": {"score": "70%", "disc": "Increasing adoption in clinical trials and therapy selection."},
            "FGFR2b": {"score": "55%", "disc": "Available in select specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines fully implemented nationally."},
            "Feasibility": {"score": "5/5", "disc": "High feasibility across all hospital types."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular updates integrated at national level."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated into clinical practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Most treatments reimbursed; some gaps remain."},
            "No-cost_Access": {"score": "3/5", "disc": "Patients face occasional out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No screening; research ongoing", "disc": "Opportunistic detection only; no population-level program."}
        }
    },


    {
        "id": 186,
        "cancer_type": "gastric",
        "country": "New Zealand",
        "country_shortForm": "NZ",
        "introduction": "New Zealand has a moderately advanced system for gastric cancer care. Specialized centers and tertiary hospitals provide access to surgery, chemotherapy, and radiotherapy. Molecular diagnostics and biomarkers are increasingly utilized in treatment decision-making. Clinical guidelines are well established and implemented, particularly in urban and tertiary centers. Screening is limited to high-risk groups, with no organized national program. Overall, gastric cancer care in New Zealand shows high maturity (Level 4), though gaps remain in systematic population-level screening and equitable access for remote populations.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers in major cities provide comprehensive care.",
"Standard treatment options widely available in tertiary hospitals.",
"National clinical guidelines in place and implemented effectively.",
"Good access to molecular and biomarker testing to guide therapy."
],

            "Weaknesses":
                ["No organized national screening program; early detection relies on risk-based surveillance.",
"Rural and remote populations may face access challenges.",
"Some high-cost therapies and advanced biomarker tests may have limited reimbursement."
],

            "Opportunities": 
                ["Expand screening for high-risk populations.",
"Improve rural access via telemedicine and outreach programs.",
"Increase integration of latest molecular biomarkers into clinical practice.",
"Participation in international clinical trials to expand treatment options."
],

            "Threats": 
                ["Rising incidence among high-risk groups may increase healthcare demand.",
"Budgetary limitations could restrict adoption of expensive targeted therapies.",
"Unequal access between urban and rural populations may persist."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Specialized centers available in major cities; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Advanced biomarker testing available, integrated in tertiary hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard treatments widely available; equitable access improving."},
            "Research_Funding": {"score": "4/5", "disc": "Strong national research and participation in international trials."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some public awareness and risk-based outreach; room to expand."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection in high-risk groups and effective therapy."},
            "Early_Detection": {"score": "5/5", "disc": "High-risk surveillance programs; no population-level screening."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive palliative care integrated in tertiary centers."}
        },
        "biomarkers": {
            "HER2":{"score": "85%", "disc": "Routinely used to guide targeted therapy."},
            "MSI_H/dMMR": {"score": "80%", "disc": "Increasingly applied in patient stratification."},
            "PDL_1_CPS>1": {"score": "80%", "disc": "Used in immunotherapy decision-making."},
            "CLDN18.2": {"score": "65%", "disc": "Available in select centers for advanced cases."},
            "FGFR2b": {"score": "50%", "disc": "Limited but available in tertiary hospitals."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "National guidelines well implemented across tertiary centers."},
            "Feasibility": {"score": "5/5", "disc": "Easily integrated in well-equipped hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Full alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Tertiary centers regularly update practices."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully incorporated for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage for targeted therapies; gaps remain."},
            "No-cost_Access": {"score": "3/5", "disc": "Some out-of-pocket costs; coverage improves in public hospitals."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Risk-based surveillance only; no organized population program.", "disc": "--"}
        }
    },


    {
        "id": 187,
        "cancer_type": "gastric",
        "country": "Nigeria",
        "country_shortForm": "NG",
        "introduction": "Gastric cancer in Nigeria represents a significant but under-recognized health burden. Access to specialized care is concentrated in a few tertiary centers, while rural areas face severe service gaps. Advanced diagnostics, including molecular and biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b), are available only in limited research or private facilities. Treatment options are restricted, with surgery and chemotherapy offered in select tertiary hospitals but minimal availability of targeted or immunotherapies. Clinical guideline implementation is weak, and alignment with international standards such as ESMO is partial. No organized screening program exists, leading to late-stage diagnosis and poor survival outcomes. Public awareness is minimal, and financial burden is high due to lack of reimbursement and no-cost access. Overall, gastric cancer care in Nigeria shows low-to-moderate maturity (level 3), with substantial challenges in early detection, equitable access, and integration of advanced therapies.",
        "swot_analysis": {
            "Strengths":
                ["Presence of tertiary hospitals offering basic surgical and chemotherapy options.",
"Some local research and academic interest in gastrointestinal cancers.",
"Availability of limited biomarker testing (HER2, MSI-H, PD-L1) in select urban/research facilities."
],

            "Weaknesses":
                ["Very limited specialized cancer centers across the country.",
"Poor access to molecular diagnostics (CLDN18.2, FGFR2b almost unavailable).",
"No national or organized screening programs; diagnoses occur late.",
"Weak clinical guideline implementation and low feasibility in resource-limited settings.",
"Palliative care availability is minimal, with opioid access heavily restricted.",
"Awareness campaigns are scarce, leading to low public recognition of gastric cancer risk."
],

            "Opportunities": 
                ["Scale up awareness and community-level education to improve early presentation.",
"Leverage regional and international partnerships for biomarker access and training.",
"Expand telemedicine and digital pathology to support diagnosis in underserved regions.",
"Pilot targeted gastric cancer screening in high-risk populations.",
"Enhance inclusion of Nigerian patients in international gastric cancer trials."
],

            "Threats": 
                ["Rising gastric cancer incidence without adequate health system preparedness.",
"Financial constraints may prevent access to advanced therapies.",
"Lack of reimbursement widens inequities between public and private sectors.",
"Workforce shortages in oncology, pathology, and gastroenterology.",
"Risk of continued late-stage diagnosis sustaining poor survival outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "2/5", "disc": "Few tertiary hospitals provide gastric cancer services; rural regions lack coverage."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Minimal infrastructure; biomarker testing very limited, mostly research-based."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "2/5", "disc": "Surgery and chemotherapy available in tertiary hospitals; advanced therapies mostly inaccessible."},
            "Research_Funding": {"score": "1/5", "disc": "Very limited; small-scale academic studies only."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Minimal awareness activities; low public engagement and knowledge."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival outcomes remain poor due to late-stage diagnosis."},
            "Early_Detection": {"score": "1/5", "disc": "No population-based or organized screening programs."},
            "Palliative_Care": {"score": "1/5", "disc": "Services are limited; opioid regulation further restricts access."}
        },
        "biomarkers": {
            "HER2":{"score": "20%", "disc": "Available in some research/private labs only."},
            "MSI_H/dMMR": {"score": "10%", "disc": "Very limited access."},
            "PDL_1_CPS>1": {"score": "10%", "disc": "Available sporadically in research/private centers."},
            "CLDN18.2": {"score": "5%", "disc": "Rarely available; research settings only."},
            "FGFR2b": {"score": "5%", "disc": "Rarely available; research settings only."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Weak implementation; limited to higher-tier hospitals."},
            "Feasibility": {"score": "2/5", "disc": "Feasible only in well-equipped tertiary hospitals."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial adoption; significant adaptation challenges."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Very limited; most smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Not systematically integrated."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal coverage under national insurance; most costs borne by patients."},
            "No-cost_Access": {"score": "1/5", "disc": "No structured programs; high out-of-pocket burden."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "--", "disc": "No national or organized screening program in place."}
        }
    },


    {
        "id": 188,
        "cancer_type": "gastric",
        "country": "Philippines",
        "country_shortForm": "PH",
        "introduction": "Gastric cancer in the Philippines is a significant health concern, though systematic detection and access to care remain limited. Specialized oncology centers are concentrated in urban areas, while rural access is weak. Advanced diagnostics and molecular testing are available only in select tertiary hospitals and private facilities. Clinical guidelines exist but are inconsistently implemented outside major centers. Reimbursement and no-cost access are limited, resulting in substantial out-of-pocket costs. Screening is largely opportunistic and fragmented, led by NGOs or hospital initiatives rather than a national program. Overall, gastric cancer care shows moderate maturity, with major gaps in early detection, biomarker utilization, and equitable service distribution.",
        "swot_analysis": {
            "Strengths":
                ["Presence of specialized cancer centers in major cities (Manila, Cebu, Davao).",
"Standard treatments (surgery, chemotherapy, targeted therapy) available in tertiary hospitals.",
"National clinical guidelines exist, particularly for advanced disease.",
"Some research activity, including regional studies on gastric cancer epidemiology and molecular profiling."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics and molecular testing outside urban hubs.",
"Biomarker testing coverage (HER2, MSI-H, PD-L1) is low.",
"No organized population-based screening; opportunistic detection dominates.",
"Palliative care is underdeveloped, with limited opioid availability.",
"Rural populations face significant barriers to specialized care.",
"Financial burden is high due to insufficient reimbursement and limited no-cost programs."
],

            "Opportunities": 
                ["Expand access to molecular diagnostics for HER2, MSI-H, PD-L1, CLDN18.2, and FGFR2b.",
"Strengthen palliative care networks and opioid accessibility.",
"Use telemedicine to extend oncology expertise to underserved regions.",
"Increase public awareness and early detection campaigns.",
"Develop pilot programs for systematic screening in high-risk populations.",
"Encourage participation in international clinical trials."
],

            "Threats": 
                ["Rising incidence of gastric cancer may overwhelm the healthcare system.",
"Budgetary constraints may limit adoption of advanced diagnostics and therapies.",
"Disparities between private and public sectors could worsen inequities.",
"Lack of organized screening may sustain late-stage diagnosis prevalence.",
"Oncology workforce shortages, particularly in rural areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Concentrated in major cities; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Limited; advanced biomarkers mainly in select tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; inequities exist."},
            "Research_Funding": {"score": "2/5", "disc": "Modest local research; limited funding."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Some initiatives, but low uptake in underserved areas."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Survival lower than global benchmarks due to late detection."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic screening; no national program."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited access and coverage; opioid availability challenges persist."}
        },
        "biomarkers": {
            "HER2":{"score": "40%", "disc": "Limited access; mainly tertiary/private hospitals."},
            "MSI_H/dMMR": {"score": "30%", "disc": "Available in select facilities."},
            "PDL_1_CPS>1": {"score": "30%", "disc": "Restricted to urban tertiary centers."},
            "CLDN18.2": {"score": "20%", "disc": "Very limited access."},
            "FGFR2b": {"score": "15%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but unevenly applied."},
            "Feasibility": {"score": "2/5", "disc": "Practical in tertiary centers; limited in smaller hospitals."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Smaller centers lag in guideline updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Limited integration, mostly in advanced disease care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Some national insurance coverage; gaps remain for advanced therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients often face out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic", "disc": "NGO/hospital-led initiatives; no organized national program."}
        }
    },


    {
        "id": 189,
        "cancer_type": "gastric",
        "country": "Poland",
        "country_shortForm": "PL",
        "introduction": "Gastric cancer in Poland is a notable health concern, though incidence has declined over recent decades due to improved diet and Helicobacter pylori management. Specialized cancer centers are available in major cities, but rural areas have limited access to advanced diagnostics and treatment. Molecular testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is relatively accessible in tertiary centers and private facilities. Clinical guidelines exist and are generally implemented in major hospitals, aligned with international standards. Public reimbursement is moderate, but out-of-pocket expenses persist for advanced therapies. Screening is largely absent, with some pilot programs in research settings. Overall, gastric cancer care in Poland demonstrates moderate maturity.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized centers in major urban areas.",
"Access to standard treatment modalities: surgery, chemotherapy, targeted therapy.",
"Molecular biomarker testing available in tertiary hospitals.",
"National clinical guidelines largely implemented in major centers."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics in rural regions.",
"No population-wide screening program; detection often occurs at later stages.",
"Financial burden for advanced therapies remains significant.",
"Palliative care integration outside urban centers is inconsistent"
],

            "Opportunities": 
                ["Expand molecular diagnostics and biomarker-guided therapy access.",
"Develop national screening or high-risk group programs.",
"Strengthen palliative care and supportive services in rural areas.",
"Increase public awareness campaigns on early detection."
],

            "Threats": 
                ["Rising incidence in aging populations may strain tertiary centers.",
"Budgetary constraints could limit adoption of new targeted therapies.",
"Disparities in access between urban and rural patients."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major cities, but rural access is limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) available in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; limited access in rural areas."},
            "Research_Funding": {"score": "3/5", "disc": "Ongoing research programs; moderate funding supports biomarker studies."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some public awareness and community outreach; room to expand."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Survival moderate; late-stage detection still an issue."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic detection; no organized national screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in major hospitals; rural coverage limited."}
        },
        "biomarkers": {
            "HER2":{"score": "80%", "disc": "Widely tested in advanced/metastatic cases."},
            "MSI_H/dMMR": {"score": "70%", "disc": "Available in tertiary centers for therapy selection."},
            "PDL_1_CPS>1": {"score": "70%", "disc": "Used for immunotherapy decisions in select hospitals."},
            "CLDN18.2": {"score": "50%", "disc": "Limited access; mostly tertiary/private centers."},
            "FGFR2b": {"score": "35%", "disc": "Emerging biomarker; few centers testing."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Guidelines widely adopted in tertiary hospitals."},
            "Feasibility": {"score": "4/5", "disc": "Practical integration in well-equipped centers."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates adopted mainly in national/tertiary centers."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Applied for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage under public insurance; gaps remain."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients face out-of-pocket costs for advanced therapy."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "1/5", "disc": "No formal national screening program; only pilot research ongoing."}
        }
    },


    {
        "id": 190,
        "cancer_type": "gastric",
        "country": "Russia",
        "country_shortForm": "RU",
        "introduction": "Gastric cancer remains a significant health concern in Russia, with higher incidence in certain regions (particularly the Far East and Siberia). While tertiary cancer centers provide advanced treatment, equitable access is uneven, especially in rural and remote areas. Diagnostic infrastructure, including endoscopy and molecular testing, has improved in urban centers but remains limited elsewhere. Clinical guideline implementation is strong in specialized facilities, with moderate alignment to international standards (ESMO, NCCN). Screening is opportunistic, without a national population-level program. Palliative care and reimbursement coverage are improving but remain insufficient. Overall, gastric cancer care in Russia demonstrates moderate maturity (Level 3), with strengths in infrastructure and guideline adoption but weaknesses in screening and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized cancer centers in major urban hubs (Moscow, St. Petersburg, Novosibirsk).",
"Access to standard treatments (gastrectomy, chemotherapy, radiotherapy, immunotherapy) in tertiary hospitals.",
"Strong implementation of national clinical guidelines with alignment to ESMO standards.",
"Availability of biomarker testing (HER2, MSI-H/dMMR, PD-L1) in larger centers.",
"Research output present, particularly in molecular oncology and regional epidemiology."
],

            "Weaknesses":
                ["No national gastric cancer screening program; detection remains opportunistic.",
"Limited diagnostic and molecular infrastructure in rural and smaller cities.",
"Palliative care services uneven, with opioid accessibility challenges.",
"Out-of-pocket costs remain high due to gaps in reimbursement and limited no-cost access.",
"Workforce shortages in oncology and gastroenterology outside metropolitan centers."
],

            "Opportunities": 
                ["Expansion of biomarker testing (CLDN18.2, FGFR2b) to enable targeted therapy.",
"Pilot regional screening initiatives in high-incidence areas.",
"Strengthening palliative care through regulatory reforms and telemedicine.",
"Increased participation in global clinical trials for gastric cancer.",
"Public awareness campaigns targeting high-risk populations."
],

            "Threats": 
                ["Rising incidence and late-stage diagnosis burdening the health system.",
"Economic and budgetary constraints may limit adoption of novel targeted therapies.",
"Geographic disparities could widen without investment in rural oncology infrastructure.",
"Workforce attrition and uneven distribution of trained specialists."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Strong tertiary network in major cities; rural access remains limited."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "Biomarker testing available in tertiary hospitals; limited in peripheries."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies widely available in cancer centers; inequities by geography."},
            "Research_Funding": {"score": "3/5", "disc": "Active research, but limited funding compared to Western Europe."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Moderate efforts; low participation in screening due to lack of organized program."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival, better in urban regions due to earlier access to treatment."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic endoscopy/PSA; no structured national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available in major centers, but uneven coverage and opioid challenges."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Commonly tested in advanced/metastatic cases."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Increasingly available in tertiary hospitals."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Widely used in advanced gastric cancer."},
            "CLDN18.2": {"score": "40%", "disc": "Limited to select research/advanced facilities."},
            "FGFR2b": {"score": "30%", "disc": "Early adoption, mainly in academic hospitals."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well adopted in major cancer centers."},
            "Feasibility": {"score": "4/5", "disc": "Feasible in tertiary hospitals; limited in small centers."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Aligned with ESMO and NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National guidelines updated, smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Strong alignment in tertiary settings."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; advanced therapies often excluded."},
            "No-cost_Access": {"score": "2/5", "disc": "Patients face high out-of-pocket costs for targeted therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No national program; opportunistic endoscopy in high-risk patients, mainly urban hospitals."}
        }
    },


    {
        "id": 191,
        "cancer_type": "gastric",
        "country": "Rwanda",
        "country_shortForm": "RW",
        "introduction": "Gastric cancer care in Rwanda is in an early stage of development, with very limited infrastructure, diagnostics, and access to specialized treatment. Tertiary centers are few, and rural populations face major barriers to care. Molecular biomarker testing and advanced diagnostics are largely unavailable outside research or pilot programs. Clinical guideline adoption is minimal, and population-based screening programs do not exist. Public awareness is low, and palliative care services are scarce. Overall, gastric cancer care in Rwanda shows low maturity, with significant gaps across all pillars of cancer care.",
        "swot_analysis": {
            "Strengths":
                ["Some nascent tertiary care facilities exist for oncology.",
"Awareness of international treatment standards is emerging among specialized staff."
],

            "Weaknesses":
                ["Very limited access to specialized centers and molecular diagnostics.",
"No national screening program; early detection is rare.",
"Palliative care and opioid availability are insufficient.",
"Rural and socioeconomically disadvantaged populations face major barriers.",
"Financial burden is high; reimbursement and no-cost access are minimal."
],

            "Opportunities": 
                ["Develop national screening programs for high-risk populations.",
"Expand infrastructure for molecular diagnostics and specialized care.",
"Increase public health awareness and early detection initiatives.",
"Leverage telemedicine for oncology expertise in underserved regions."
],

            "Threats": 
                ["Rising cancer incidence may overwhelm limited healthcare infrastructure.",
"Budgetary and workforce constraints restrict adoption of advanced care.",
"Inequities between urban and rural populations may worsen outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Very few specialized centers; rural areas largely underserved."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Minimal infrastructure; advanced biomarkers rarely available."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Limited access to standard therapies; concentrated in few centers."},
            "Research_Funding": {"score": "1/5", "disc": "Very low; limited local studies."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Minimal public awareness; few campaigns."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Low survival due to late diagnosis and limited treatment."},
            "Early_Detection": {"score": "1/5", "disc": "No systematic screening; diagnosis mostly at advanced stages."},
            "Palliative_Care": {"score": "1/5", "disc": "Scarce services; limited opioid access."}
        },
        "biomarkers": {
            "HER2":{"score": "10%", "disc": "Very limited; mostly in research settings."},
            "MSI_H/dMMR": {"score": "5%", "disc": "Rarely tested."},
            "PDL_1_CPS>1": {"score": "5%", "disc": "Minimal access."},
            "CLDN18.2": {"score": "1%", "disc": "Almost nonexistent."},
            "FGFR2b": {"score": "1%", "disc": "Almost nonexistent."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Very limited; mostly theoretical."},
            "Feasibility": {"score": "1/5", "disc": "Integration into practice largely infeasible."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Minimal adoption; few alignments."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Rarely updated or applied."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Not systematically applied."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal coverage under public schemes."},
            "No-cost_Access": {"score": "1/5", "disc": "Most patients pay out-of-pocket; no subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "0/5", "disc": "No organized screening; no infrastructure."}
        }
    },


    {
        "id": 192,
        "cancer_type": "gastric",
        "country": "Saudi Arabia",
        "country_shortForm": "SA",
        "introduction": "Gastric cancer incidence in Saudi Arabia is relatively low compared to global averages, but early detection and equitable access to care remain limited. Specialized cancer centers are concentrated in major urban areas, while rural access is weak. Advanced diagnostics and molecular testing are available in select tertiary and private hospitals. Clinical guidelines exist and are moderately implemented in tertiary hospitals, though smaller centers may struggle to keep pace with updates. Public awareness is limited, and no national screening program exists; testing is largely opportunistic. Reimbursement is partial, leading to some out-of-pocket expenses. Overall, gastric cancer care shows moderate maturity with gaps in screening, awareness, and equitable service distribution.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers available in major cities (Riyadh, Jeddah, Dammam).",
"Access to standard therapies (surgery, chemotherapy, radiotherapy) in tertiary hospitals.",
"National clinical guidelines exist and are implemented in higher-tier hospitals.",
"Molecular biomarker testing (HER2, MSI-H, PD-L1) available in select centers."
],

            "Weaknesses":
                ["Limited access to advanced molecular testing outside urban hubs.",
"Opportunistic, not systematic, screening.",
"Low public awareness; cultural and social barriers affect early detection.",
"Palliative care services unevenly distributed, with limited rural coverage.",
"Out-of-pocket costs remain significant for advanced therapies."
],

            "Opportunities": 
                ["Expand molecular diagnostics and biomarker testing to more centers.",
"Strengthen public health campaigns to raise awareness and encourage early detection.",
"Introduce pilot population-based screening programs for high-risk groups.",
"Leverage telemedicine to support rural oncology care.",
"Participate in international clinical trials for advanced gastric cancer therapies."
],

            "Threats": 
                ["Rising incidence of gastric cancer in high-risk populations may stress healthcare resources.",
"Inequities between private and public sector access could persist or worsen.",
"Budgetary constraints may limit adoption of advanced targeted therapies.",
"Workforce shortages in oncology and gastroenterology, particularly outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Available in major cities; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b available in select tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in urban tertiary hospitals; inequities exist in rural regions."},
            "Research_Funding": {"score": "2/5", "disc": "Modest research activity; mostly academic or hospital-led studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Limited national awareness; social barriers reduce uptake."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival due to partial early detection."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic testing; no organized national screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in tertiary hospitals; rural coverage limited."}
        },
        "biomarkers": {
            "HER2":{"score": "60%", "disc": "Widely tested in select tertiary centers."},
            "MSI_H/dMMR": {"score": "50%", "disc": "Testing available in tertiary hospitals."},
            "PDL_1_CPS>1": {"score": "50%", "disc": "Available in specialized centers."},
            "CLDN18.2": {"score": "30%", "disc": "Limited access, mostly in research or private hospitals."},
            "FGFR2b": {"score": "25%", "disc": "Rarely available outside research centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines implemented in tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in well-equipped hospitals; smaller centers may struggle."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Moderate alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "Updates adopted in tertiary centers; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Partial integration, mostly for advanced care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; some therapies require out-of-pocket payment."},
            "No-cost_Access": {"score": "2/5", "disc": "Limited subsidy programs; patients face financial burden."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No national program; limited testing mainly in private hospitals."}
        }
    },


    {
        "id": 193,
        "cancer_type": "gastric",
        "country": "Serbia",
        "country_shortForm": "RS",
        "introduction": "Gastric cancer care in Serbia is moderately mature, with established tertiary centers offering standard treatments and some access to molecular diagnostics. Clinical guidelines are fairly well implemented, particularly in higher-tier hospitals, and awareness campaigns exist but are limited. Screening is largely opportunistic or risk-based, with no organized national program. Reimbursement and no-cost access are partial, leading to some out-of-pocket burden. Research activity is modest, with limited participation in international trials.",
        "swot_analysis": {
            "Strengths":
                ["Specialized tertiary centers available in major cities.",
"Standard treatment options (surgery, chemotherapy, targeted therapy) accessible in urban hospitals.",
"Clinical guidelines in place and largely followed in higher-tier centers.",
"Some molecular biomarker testing available (HER2, MSI-H/dMMR, PD-L1)."
],

            "Weaknesses":
                ["Limited access to genetic/molecular testing outside tertiary centers.",
"Research funding and local studies are modest.",
"Screening programs are mostly opportunistic; no population-level program.",
"Awareness campaigns are limited in reach.",
"Rural populations face access challenges."
],

            "Opportunities": 
                ["Expand molecular diagnostic infrastructure to secondary hospitals.",
"Increase public awareness campaigns to promote early detection.",
"Develop pilot population-based screening programs in high-risk groups.",
"Encourage participation in international clinical trials.",
"Strengthen palliative care networks."
],

            "Threats": 
                ["Rising incidence may strain urban hospital capacity.",
"Budget constraints may limit access to advanced diagnostics or targeted therapies.",
"Inequity between urban and rural healthcare facilities.",
"Workforce shortages in oncology and specialized care."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Available in major cities; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Limited; HER2, MSI-H/dMMR, PD-L1 testing available in select centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; inequities in rural areas."},
            "Research_Funding": {"score": "2/5", "disc": "Modest; limited local studies and clinical trial participation."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Some efforts exist; reach and impact are limited."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate; outcomes better in urban tertiary hospitals."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic or risk-based screening; no national program."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in major centers; rural coverage limited."}
        },
        "biomarkers": {
            "HER2":{"score": "70%", "disc": "Widely used in tertiary centers for therapy selection."},
            "MSI_H/dMMR": {"score": "60%", "disc": "Available in selected centers; limited nationwide."},
            "PDL_1_CPS>1": {"score": "60%", "disc": "Available but not universally applied."},
            "CLDN18.2": {"score": "40%", "disc": "Emerging biomarker; limited availability."},
            "FGFR2b": {"score": "30%", "disc": "Rarely available; select research/clinical settings."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Well-implemented in tertiary centers."},
            "Feasibility": {"score": "4/5", "disc": "High in well-equipped hospitals; moderate in smaller centers."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Largely aligned with ESMO; partial local adaptation."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers update guidelines; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Mostly integrated, especially for advanced cases."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Partial coverage; gaps for targeted therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket costs common; limited subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "--", "disc": "No national program; risk-based hospital screening only."}
        }
    },


    {
        "id": 194,
        "cancer_type": "gastric",
        "country": "Singapore",
        "country_shortForm": "SG",
        "introduction": "Singapore demonstrates a high level of maturity in gastric cancer care, supported by advanced healthcare infrastructure, widespread access to diagnostics, and well-implemented clinical guidelines. Specialized centers are concentrated in major hospitals, with strong integration of molecular testing and targeted therapies. Population-level gastric cancer screening is not implemented, but high-risk groups receive appropriate endoscopic surveillance. Awareness campaigns, research activity, and palliative care services are robust, contributing to high survival rates. Reimbursement is moderate, with some out-of-pocket costs, but coverage for essential care is widely available. Overall, Singapore exhibits a well-developed gastric cancer care system with strong outcomes, though national screening remains a gap.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers and tertiary hospitals providing comprehensive gastric cancer care.",
"Advanced molecular and biomarker testing widely available (HER2, MSI-H/dMMR, PD-L1).",
"Clinical guidelines fully implemented and aligned with international standards (ESMO/NCCN).",
"Strong research infrastructure with local and international collaborations.",
"Palliative care integrated across tertiary hospitals."
],

            "Weaknesses":
                ["No population-wide gastric cancer screening program; only high-risk H. pylori testing and surveillance.",
"Moderate reimbursement coverage for some targeted therapies; some out-of-pocket costs persist."
],

            "Opportunities": 
                ["Expand screening programs to include population-level risk stratification.",
"Increase public awareness of gastric cancer and early detection strategies.",
"Strengthen integration of novel biomarkers and targeted therapies in clinical practice."
],

            "Threats": 
                ["Rising gastric cancer incidence due to aging population may increase healthcare demand.",
"High treatment costs for advanced therapies could limit access for some patients.",
"Dependence on tertiary centers may limit access in less urbanized regions."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Comprehensive cancer centers available in major hospitals."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing fully integrated (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b)."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced therapies widely available."},
            "Research_Funding": {"score": "4/5", "disc": "Strong research programs; active clinical trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Public campaigns present; high awareness among high-risk groups."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and advanced care."},
            "Early_Detection": {"score": "5/5", "disc": "Opportunistic high-risk H. pylori testing and endoscopic surveillance."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive palliative care integrated in tertiary centers."}
        },
        "biomarkers": {
            "HER2":{"score": "80%", "disc": "Widely tested for therapy guidance."},
            "MSI_H/dMMR": {"score": "75%", "disc": "Routinely tested in advanced cases."},
            "PDL_1_CPS>1": {"score": "75%", "disc": "Commonly applied for immunotherapy eligibility."},
            "CLDN18.2": {"score": "50%", "disc": "Emerging biomarker; moderate adoption."},
            "FGFR2b": {"score": "40%", "disc": "Limited but growing availability."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Fully integrated in all tertiary hospitals."},
            "Feasibility": {"score": "5/5", "disc": "Guidelines feasible across institutions."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Aligned with ESMO/NCCN recommendations."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "National centers promptly adopt updates."},
            "ESMO_Guidelines": {"score": "4/5", "disc": "Strong adoption, particularly for advanced/metastatic disease."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Moderate coverage; some out-of-pocket expenses."},
            "No-cost_Access": {"score": "3/5", "disc": "Subsidies available; not fully free."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No population program; high-risk testing in place."}
        }
    },


    {
        "id": 195,
        "cancer_type": "gastric",
        "country": "South Africa",
        "country_shortForm": "ZA",
        "introduction": "Gastric cancer is less common than prostate and breast cancer in South Africa but is associated with high mortality due to late-stage detection and limited access to early diagnostic programs. Endoscopic capacity is concentrated in tertiary centers, while rural areas face major diagnostic delays. Molecular biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is limited and largely confined to private or research facilities. Treatment is available in tertiary hospitals, including surgery, chemotherapy, and palliative care, though disparities persist. National guidelines exist but are less robust compared to higher-burden cancers. Public reimbursement is partial, leading to high out-of-pocket expenses for advanced therapies. Awareness remains low, and no national screening program exists. Overall, gastric cancer care in South Africa demonstrates moderate maturity (level 3), with major gaps in early detection, biomarker access, and equitable distribution of services.",
        "swot_analysis": {
            "Strengths":
                ["Availability of endoscopy and surgical oncology in tertiary hospitals.",
"Access to chemotherapy and some targeted therapies in private and select public facilities.",
"National cancer guidelines exist, partially aligned with international recommendations.",
"Academic and research institutions contribute to regional gastric cancer data."
],

            "Weaknesses":
                ["No organized screening program for gastric cancer.",
"Biomarker utilization (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b) very limited.",
"Late-stage presentation common, reducing survival rates.",
"Weak palliative care integration and opioid availability challenges.",
"Rural populations face delays in diagnosis and lack access to advanced care.",
"Financial burden high due to limited reimbursement for targeted therapies."
],

            "Opportunities": 
                ["Expand endoscopic capacity and training, especially in rural areas.",
"Introduce pilot early detection programs in high-risk groups.",
"Improve access to HER2 and MSI testing to enable targeted treatment.",
"Strengthen palliative care services and integrate with primary health.",
"Leverage tele-oncology for rural outreach.",
"Expand participation in international gastric cancer clinical trials."
],

            "Threats": 
                ["Rising burden of late-stage cases due to lack of screening.",
"Healthcare workforce shortages, especially gastroenterologists and oncologists.",
"Budgetary constraints limiting adoption of newer targeted therapies.",
"Disparities between private and public sector access may worsen.",
"Competing health priorities may reduce focus on gastric cancer."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Gastric cancer care concentrated in tertiary centers; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "HER2 and MSI testing available in select urban/private labs; others rarely accessible."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Surgery, chemotherapy available in tertiary hospitals; access to targeted therapies limited."},
            "Research_Funding": {"score": "2/5", "disc": "Modest; limited gastric-specific studies."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Low public awareness; no major campaigns."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "2/5", "disc": "Survival below global average due to late-stage presentation."},
            "Early_Detection": {"score": "2/5", "disc": "No national screening; diagnosis often incidental or symptomatic."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available in urban centers but weak in rural areas; opioid access limited."}
        },
        "biomarkers": {
            "HER2":{"score": "50%", "disc": "Available in tertiary/private centers; not universal."},
            "MSI_H/dMMR": {"score": "40%", "disc": "Some access in research/private labs."},
            "PDL_1_CPS>1": {"score": "40%", "disc": "Limited testing capacity."},
            "CLDN18.2": {"score": "20%", "disc": "Rare; limited to research."},
            "FGFR2b": {"score": "15%", "disc": "Minimal access, mostly experimental settings."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines exist but weaker compared to prostate/breast cancer."},
            "Feasibility": {"score": "3/5", "disc": "Implementable in tertiary centers; limited in district hospitals."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with NCCN/ESMO."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers keep pace; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Partially integrated, mainly for advanced care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited public coverage; advanced therapies mostly out-of-pocket."},
            "No-cost_Access": {"score": "2/5", "disc": "Financial burden high; subsidies limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "None", "disc": "No gastric cancer screening program; diagnosis opportunistic."}
        }
    },


    {
        "id": 196,
        "cancer_type": "gastric",
        "country": "South Korea",
        "country_shortForm": "KR",
        "introduction": "South Korea has one of the most advanced gastric cancer care ecosystems globally, with early detection programs, widespread access to diagnostics, and high-quality treatment pathways. The country has a national gastric cancer screening program (endoscopy or UGIS every 2 years starting at age 50), resulting in high early detection rates. Specialized cancer centers are available nationwide, with equitable access across regions. Molecular biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is routine, and treatment aligns closely with international guidelines (ESMO/NCCN). Public insurance and reimbursement programs ensure limited out-of-pocket costs, supporting universal access. Patient survival rates are among the highest globally, reflecting strong integration of early detection, treatment, and supportive care.",
        "swot_analysis": {
            "Strengths":
                ["National screening program with high coverage and adherence.",
"Widespread availability of specialized cancer centers across urban and regional areas.",
"High-quality treatment access including surgery, chemotherapy, targeted therapy, and immunotherapy.",
"Robust research and clinical trial ecosystem.",
"Strong alignment with international clinical guidelines and systematic guideline updates."
],

            "Weaknesses":
                ["Some regional disparities in access to cutting-edge molecular diagnostics, though minimal.",
"Continuous need for workforce expansion to maintain high patient throughput."
],

            "Opportunities": 
                ["Integration of emerging biomarkers (CLDN18.2, FGFR2b) into routine care.",
"Expansion of digital health and tele-oncology platforms.",
"International collaboration for rare gastric cancer subtypes and innovative therapies."
],

            "Threats": 
                ["Rising healthcare costs associated with advanced therapies.",
"Risk of over-diagnosis or overtreatment from intensive screening."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Well-distributed high-quality cancer centers nationwide."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Biomarker testing routinely available in tertiary and secondary hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Comprehensive therapies including surgery, chemo, targeted, and immunotherapy."},
            "Research_Funding": {"score": "5/5", "disc": "Strong national and international research programs."},
            "Awareness_Campaigns": {"score": "5/5", "disc": "High public awareness; supported by government initiatives."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival due to early detection and advanced treatment."},
            "Early_Detection": {"score": "5/5", "disc": "National screening program ensures early diagnosis."},
            "Palliative_Care": {"score": "5/5", "disc": "Accessible and well-integrated into cancer care pathways."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Routinely tested for targeted therapy eligibility."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Widely tested for immunotherapy decisions."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Integrated into immunotherapy decision-making."},
            "CLDN18.2": {"score": "60%", "disc": "Available for select targeted therapies."},
            "FGFR2b": {"score": "50%", "disc": "Tested in specialized centers for targeted treatment."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "4/5", "disc": "Strong implementation across centers."},
            "Feasibility": {"score": "4/5", "disc": "Easily implemented in hospitals with sufficient resources."},
            "Adoption_International_Guideline": {"score": "4/5", "disc": "Closely aligned with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers adopt updates; continual improvement ongoing."},
            "ESMO_Guidelines": {"score": "3/5", "disc": "Integrated for both early-stage and metastatic disease."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Broad coverage under national insurance."},
            "No-cost_Access": {"score": "3/5", "disc": "Limited out-of-pocket costs due to public insurance schemes."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "National program: endoscopy or UGIS every 2 years from age 50.", "disc": "--"}
        }
    },


    {
        "id": 197,
        "cancer_type": "gastric",
        "country": "Spain",
        "country_shortForm": "ES",
        "introduction": "Gastric cancer in Spain is moderately well-managed, with advanced diagnostics, treatment availability, and clinical guideline implementation concentrated in tertiary and specialized centers. National population-based screening does not exist; early detection is opportunistic, mainly through endoscopic surveillance in high-risk individuals. Molecular biomarker testing is well-integrated in specialized centers but limited in smaller hospitals. Reimbursement exists for standard therapies, but no-cost access is partial. Overall, gastric cancer care shows moderate maturity with gaps in nationwide screening, equitable access in rural regions, and palliative care coverage.",
        "swot_analysis": {
            "Strengths":
                ["Established specialized centers in major urban areas.",
"Broad access to standard therapies (surgery, chemotherapy, targeted therapy).",
"Strong integration of molecular biomarker testing (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b).",
"National clinical guidelines widely implemented in tertiary centers.",
"Research infrastructure supports clinical trials and innovation."
],

            "Weaknesses":
                ["No population-level screening program; detection relies on opportunistic monitoring of high-risk patients.",
"Rural and smaller centers have limited access to molecular diagnostics.",
"Palliative care coverage varies regionally.",
"Financial burden exists for advanced therapies not fully covered by reimbursement."
],

            "Opportunities": 
                ["Expand biomarker testing to regional hospitals.",
"Develop structured early detection programs for high-risk groups.",
"Enhance palliative care networks and equitable access.",
"Increase public awareness and patient education campaigns.",
"Encourage Spanish patient participation in international clinical trials."
],

            "Threats": 
                ["Rising incidence among aging population may strain specialized centers.",
"Budget constraints could limit adoption of advanced therapies.",
"Regional disparities may persist between urban and rural areas.",
"Late-stage diagnoses remain common without organized screening."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Advanced centers exist in major urban areas; smaller hospitals have limited capacity."},
            "Genetic_Molecular_Testing": {"score": "4/5", "disc": "HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b well integrated in specialized centers; limited in smaller hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "4/5", "disc": "Standard therapies widely available; some regional disparities."},
            "Research_Funding": {"score": "4/5", "disc": "Active clinical trials and translational research."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Moderate awareness campaigns; some gaps in rural outreach."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Survival comparable to EU standards; earlier detection improves outcomes in tertiary centers."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic detection in high-risk groups; no national screening program."},
            "Palliative_Care": {"score": "4/5", "disc": "Services available in tertiary hospitals; regional variability exists."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Standard in metastatic/recurrent cases."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Widely tested in tertiary centers."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Used to guide immunotherapy."},
            "CLDN18.2": {"score": "70%", "disc": "Increasing use for targeted therapy."},
            "FGFR2b": {"score": "55%", "disc": "Available in select specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Guidelines fully implemented in tertiary centers."},
            "Feasibility": {"score": "5/5", "disc": "Integration feasible in well-equipped hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Rapid adoption of guideline updates in tertiary centers."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated in clinical practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Standard therapies reimbursed; advanced therapies partially covered."},
            "No-cost_Access": {"score": "3/5", "disc": "Partial subsidies; out-of-pocket costs remain for select therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "Limited to high-risk monitoring; no population-level program."}
        }
    },


    {
        "id": 198,
        "cancer_type": "gastric",
        "country": "Sweden",
        "country_shortForm": "SE",
        "introduction": "Gastric cancer in Sweden has relatively well-established care pathways, benefiting from a robust healthcare infrastructure, high-quality tertiary centers, and strong research capabilities. Early detection is largely opportunistic, but awareness and guideline-driven management are well implemented. Access to molecular diagnostics (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is high in specialized centers. Palliative care and supportive services are comprehensive, though some gaps remain in rural areas. Screening is limited to high-risk clinical groups; no population-level national program exists. Overall, gastric cancer care in Sweden demonstrates high maturity, with strong infrastructure, advanced diagnostics, and integrated care pathways.",
        "swot_analysis": {
            "Strengths":
                ["High-quality specialized cancer centers across major regions.",
"Advanced molecular diagnostic capabilities widely available.",
"Strong adherence to national and international clinical guidelines (ESMO/NCCN).",
"Comprehensive treatment access, including surgery, chemotherapy, targeted therapy, and immunotherapy.",
"Well-integrated palliative care and supportive services."
],

            "Weaknesses":
                ["No organized national gastric cancer screening program; relies on high-risk group identification.",
"Limited rural access to specialized diagnostics and treatments in some areas.",
"Some advanced therapies may require prior authorization, leading to delays."
],

            "Opportunities": 
                ["Expand population-level screening for high-risk groups to improve early detection.",
"Increase public awareness campaigns focused on early gastric cancer symptoms.",
"Integrate novel biomarkers and targeted therapies more broadly in community hospitals."
],

            "Threats": 
                ["Rising incidence of advanced gastric cancer could challenge healthcare resources.",
"Disparities in access between urban tertiary centers and smaller hospitals.",
"Budget constraints may affect uptake of new targeted therapies."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Strong coverage in major regions, minor gaps in rural areas."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced biomarker testing widely available in specialized centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Comprehensive therapies including surgery, chemo, targeted, and immunotherapy."},
            "Research_Funding": {"score": "5/5", "disc": "Strong support for national and international gastric cancer studies."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "National campaigns exist, room to expand early detection outreach."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival relative to global benchmarks due to early intervention."},
            "Early_Detection": {"score": "4/5", "disc": "Opportunistic and high-risk screening; no population-level program."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive, well-integrated services including rural outreach."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Widely tested and integrated into treatment planning."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Routinely assessed for immunotherapy eligibility."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Broadly used for therapy selection."},
            "CLDN18.2": {"score": "70%", "disc": "Available in specialized centers; integration ongoing."},
            "FGFR2b": {"score": "55%", "disc": "Limited to select research and tertiary centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Fully integrated in national cancer pathways."},
            "Feasibility": {"score": "5/5", "disc": "Easily implemented across most centers."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "Regular adoption of updated guidelines."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully implemented in practice."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "Partial coverage; some therapies require approval."},
            "No-cost_Access": {"score": "3/5", "disc": "Available through national insurance; minor out-of-pocket costs for some treatments."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No national screening; limited to high-risk clinical groups."}
        }
    },


    {
        "id": 199,
        "cancer_type": "gastric",
        "country": "Syria",
        "country_shortForm": "SY",
        "introduction": "Gastric cancer care in Syria is severely limited due to ongoing conflict, disrupted health infrastructure, and low access to diagnostics and treatment. Specialized centers are rare, mainly concentrated in major cities, while rural areas have minimal or no access. Screening programs are non-existent. Clinical guidelines are largely absent or poorly implemented. Research and awareness activities are minimal. Out-of-pocket costs remain high, with limited reimbursement or no-cost access. Overall, gastric cancer care in Syria shows very low maturity, with critical gaps across all pillars of care.",
        "swot_analysis": {
            "Strengths":
                ["Minimal, though some tertiary hospitals in major cities maintain basic oncology services."],

            "Weaknesses":
                ["Very limited access to specialized centers and advanced diagnostics.",
"No organized screening or early detection programs.",
"Clinical guideline implementation is almost nonexistent.",
"Palliative care availability is very low; opioid access is restricted.",
"Rural populations face severe access barriers.",
"Financial burden is high with minimal insurance coverage."
],

            "Opportunities": 
                ["Establish basic oncology services in urban centers.",
"Introduce pilot early detection initiatives in high-risk populations.",
"Improve palliative care networks and training for healthcare professionals.",
"Partner with international organizations to rebuild infrastructure and support access to essential therapies."
],

            "Threats": 
                ["Ongoing conflict and instability limit healthcare rebuilding efforts.",
"Limited government funding for cancer care.",
"Unequal access between urban and rural populations.",
"Late-stage diagnosis remains prevalent, affecting survival outcomes."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Very few specialized centers; concentrated in major cities."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Almost no infrastructure; molecular testing extremely limited."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Minimal access to surgery, chemotherapy, or radiotherapy; mostly in urban centers."},
            "Research_Funding": {"score": "1/5", "disc": "Negligible research activity due to conflict and resource constraints."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Public awareness and education campaigns nearly absent."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Survival is very low due to late diagnosis and limited care."},
            "Early_Detection": {"score": "1/5", "disc": "No organized screening; detection occurs mostly at advanced stages."},
            "Palliative_Care": {"score": "1/5", "disc": "Very limited services; opioid access and rural coverage are major challenges."}
        },
        "biomarkers": {
            "HER2":{"score": "20%", "disc": "Rarely available; limited to select urban facilities."},
            "MSI_H/dMMR": {"score": "10%", "disc": "Minimal access, mostly research-based."},
            "PDL_1_CPS>1": {"score": "10%", "disc": "Rarely performed."},
            "CLDN18.2": {"score": "5%", "disc": "Extremely limited."},
            "FGFR2b": {"score": "5%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Guidelines poorly implemented; mostly absent outside tertiary centers."},
            "Feasibility": {"score": "1/5", "disc": "Integration into clinical practice severely limited."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Very limited adoption of ESMO/NCCN guidelines."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Almost no engagement with updates."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Rarely implemented."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal; most therapies require out-of-pocket payment."},
            "No-cost_Access": {"score": "1/5", "disc": "Very limited; high financial burden for patients."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No screening", "disc": "Screening programs do not exist; care affected by conflict."}
        }
    },


    {
        "id": 200,
        "cancer_type": "gastric",
        "country": "Thailand",
        "country_shortForm": "TH",
        "introduction": "Gastric cancer is a significant health concern in Thailand, with moderate incidence and mortality rates. Early detection remains limited due to the absence of a nationwide screening program, although pilot H. pylori-based initiatives exist. Specialized treatment centers are available in major cities, but access in rural areas is restricted. Standard treatment options (surgery, chemotherapy, targeted therapy) are available in tertiary hospitals. Molecular biomarker testing (HER2, MSI-H/dMMR, PD-L1, CLDN18.2, FGFR2b) is available but not widespread. Clinical guidelines exist and are partially implemented, with moderate alignment to international standards. Reimbursement and no-cost access remain limited, resulting in some out-of-pocket burden. Public awareness is growing, but community uptake is variable.",
        "swot_analysis": {
            "Strengths":
                ["Specialized centers in major cities with access to standard gastric cancer therapies.",
"Clinical guidelines exist and are implemented in tertiary hospitals.",
"Growing research interest, including molecular profiling.",
"Some pilot programs for early detection (H. pylori-based)."
],

            "Weaknesses":
                ["Lack of a national population-based gastric cancer screening program.",
"Limited biomarker testing outside urban centers.",
"Rural populations face access barriers to specialized care.",
"Out-of-pocket costs remain high for some therapies."
],

            "Opportunities": 
                ["Expand molecular diagnostics (HER2, MSI, PD-L1) to broader populations.",
"Strengthen pilot early detection programs and evaluate nationwide scaling.",
"Leverage telemedicine to improve rural access.",
"Increase public awareness campaigns targeting high-risk groups.",
"Promote inclusion in international clinical trials."
],

            "Threats": 
                ["Rising gastric cancer incidence could strain healthcare resources.",
"Budgetary limitations may restrict access to targeted therapies.",
"Disparities between urban and rural populations may persist.",
"Workforce shortages in oncology and pathology in non-urban areas."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Available in major cities; limited rural access."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "HER2, MSI, PD-L1, CLDN18.2, FGFR2b testing available but not widespread."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies (surgery, chemo, targeted) available in tertiary hospitals; rural inequity persists."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate funding; local studies contribute to regional data."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some campaigns; uptake variable, especially in underserved regions."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate outcomes; late-stage diagnosis common in rural areas."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic detection; pilot H. pylori screening programs in place."},
            "Palliative_Care": {"score": "3/5", "disc": "Available in tertiary hospitals; rural access limited."}
        },
        "biomarkers": {
            "HER2":{"score": "60%", "disc": "Most common molecular biomarker tested."},
            "MSI_H/dMMR": {"score": "50%", "disc": "Moderate availability in tertiary centers."},
            "PDL_1_CPS>1": {"score": "50%", "disc": "Partially implemented; mostly urban hospitals."},
            "CLDN18.2": {"score": "30%", "disc": "Limited access, mostly research/urban centers."},
            "FGFR2b": {"score": "20%", "disc": "Very limited, primarily in specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines present; implemented in tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Feasible in urban hospitals; smaller centers face challenges."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Partial alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers adopt updates; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Integrated partially, mainly for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Limited; coverage gaps for advanced therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Some patients incur out-of-pocket costs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No national program; pilot H. pylori-based programs exist."}
        }
    },


    {
        "id": 201,
        "cancer_type": "gastric",
        "country": "UAE",
        "country_shortForm": "AE",
        "introduction": "Gastric cancer in the UAE is relatively rare compared to other cancers but presents challenges in early detection and access to advanced care. Specialized centers exist in major urban hubs, but rural and smaller city access remains limited. Diagnostic infrastructure, including endoscopy and molecular testing, is available mainly in tertiary/private hospitals. Standard treatments such as surgery, chemotherapy, and targeted therapy are accessible, though cost and insurance coverage can limit uptake. Awareness campaigns are moderate, with sporadic screening programs in private facilities but no organized national program. Clinical guidelines are partially implemented with alignment to international recommendations. Overall, gastric cancer care in the UAE shows moderate maturity, with strengths in treatment availability and guideline adherence, but gaps in systematic early detection, biomarker utilization, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major cities with access to advanced surgery, chemotherapy, and targeted therapy.",
"Diagnostic infrastructure (endoscopy, imaging, molecular testing) available in tertiary hospitals.",
"Clinical guidelines in place, partially aligned with international standards.",
"Research activity emerging, particularly in molecular profiling."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics in smaller cities and rural areas.",
"Biomarker testing (e.g., HER2, MSI, PD-L1) not universally available.",
"No organized population-based screening; detection relies on opportunistic check-ups.",
"Palliative care coverage is inconsistent, with rural access challenges.",
"High out-of-pocket costs despite insurance coverage; limited no-cost access programs."
],

            "Opportunities": 
                ["Expand molecular diagnostics (HER2, MSI, PD-L1) to more centers for precision therapy.",
"Develop national early detection initiatives, particularly for high-risk populations.",
"Strengthen palliative care networks and training.",
"Increase public awareness campaigns and community outreach.",
"Encourage participation in international clinical trials."
],

            "Threats": 
                ["Rising incidence of advanced-stage diagnosis due to lack of organized screening.",
"High cost of targeted therapies may limit equitable access.",
"Unequal distribution of specialized care between urban and rural areas.",
"Workforce shortages in oncology and gastroenterology outside major centers."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers in major cities; limited rural access."},
            "Genetic_Molecular_Testing": {"score": "3/5", "disc": "Advanced biomarker testing available mainly in tertiary/private hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; rural access limited."},
            "Research_Funding": {"score": "3/5", "disc": "Moderate research activity in molecular profiling; local contributions emerging."},
            "Awareness_Campaigns": {"score": "3/5", "disc": "Some awareness efforts; public knowledge remains moderate."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Survival comparable to regional standards; late-stage diagnosis still occurs."},
            "Early_Detection": {"score": "3/5", "disc": "Opportunistic detection; no national screening program."},
            "Palliative_Care": {"score": "3/5", "disc": "Services available but unevenly distributed."}
        },
        "biomarkers": {
            "HER2":{"score": "60%", "disc": "Tested in most tertiary/private centers."},
            "MSI_H/dMMR": {"score": "50%", "disc": "Moderate availability in specialized centers."},
            "PDL_1_CPS>1": {"score": "50%", "disc": "Testing available but not standardized."},
            "CLDN18.2": {"score": "30%", "disc": "Limited access in select centers."},
            "FGFR2b": {"score": "25%", "disc": "Minimal availability, mainly in research settings."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "3/5", "disc": "Guidelines partially implemented in tertiary hospitals."},
            "Feasibility": {"score": "3/5", "disc": "Practical in well-equipped hospitals; limited in smaller centers."},
            "Adoption_International_Guideline": {"score": "3/5", "disc": "Some alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "2/3", "disc": "National centers adopt updates; smaller hospitals lag."},
            "ESMO_Guidelines": {"score": "2/5", "disc": "Partially integrated, especially for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Insurance coverage exists but gaps remain for advanced therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "Out-of-pocket costs remain high; limited subsidy programs."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "No organized national screening; some private hospital programs exist."}
        }
    },


    {
        "id": 202,
        "cancer_type": "gastric",
        "country": "Uganda",
        "country_shortForm": "UG",
        "introduction": "Gastric cancer care in Uganda is at an early stage of development, with very limited infrastructure, diagnostics, and treatment options. Specialized cancer centers are concentrated in a few urban hospitals, leaving rural populations with minimal access. Molecular testing is largely unavailable outside research settings. Clinical guidelines exist but are poorly implemented, and reimbursement is minimal, resulting in high out-of-pocket costs. Screening is virtually nonexistent. Overall, gastric cancer care in Uganda demonstrates low maturity, with major gaps across all pillars.",
        "swot_analysis": {
            "Strengths":
                ["Presence of a few tertiary hospitals in Kampala and major urban centers.",
"Basic treatment modalities (surgery, chemotherapy) available in select centers."
],

            "Weaknesses":
                ["Very limited access to specialized care outside urban hubs.",
"Molecular biomarker testing largely unavailable.",
"Clinical guidelines poorly implemented.",
"Screening and early detection programs are absent.",
"Palliative care is minimal, with inadequate opioid availability.",
"High out-of-pocket costs due to minimal insurance coverage."
],

            "Opportunities": 
                ["Develop national awareness campaigns on gastric cancer.",
"Expand oncology training and telemedicine for rural regions.",
"Pilot organized early detection and screening programs.",
"Introduce molecular testing to guide targeted therapies."
],

            "Threats": 
                ["Rising incidence may overwhelm already limited health infrastructure.",
"Budgetary constraints restrict access to advanced therapies.",
"Rural populations may remain underserved.",
"Workforce shortages in oncology and pathology."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "1/5", "disc": "Few tertiary hospitals; rural areas largely unserved."},
            "Genetic_Molecular_Testing": {"score": "1/5", "disc": "Very limited; mostly research-based, no routine testing."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "1/5", "disc": "Standard surgery/chemotherapy in select urban centers only."},
            "Research_Funding": {"score": "1/5", "disc": "Minimal local studies or funding."},
            "Awareness_Campaigns": {"score": "1/5", "disc": "Very limited public health campaigns."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "1/5", "disc": "Low survival due to late-stage presentation."},
            "Early_Detection": {"score": "1/5", "disc": "No organized screening; diagnosis mostly symptomatic."},
            "Palliative_Care": {"score": "1/5", "disc": "Minimal services; opioid availability is a challenge."}
        },
        "biomarkers": {
            "HER2":{"score": "10%", "disc": "Very limited access, mostly research settings."},
            "MSI_H/dMMR": {"score": "5%", "disc": "Rarely available."},
            "PDL_1_CPS>1": {"score": "5%", "disc": "Minimal access."},
            "CLDN18.2": {"score": "1%", "disc": "Almost nonexistent."},
            "FGFR2b": {"score": "1%", "disc": "Almost nonexistent."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "1/5", "disc": "Poorly applied in most centers."},
            "Feasibility": {"score": "1/5", "disc": "Limited by resources and expertise."},
            "Adoption_International_Guideline": {"score": "1/5", "disc": "Rarely followed outside tertiary centers."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Minimal uptake."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Very limited integration."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "1/5", "disc": "Minimal insurance coverage; most costs out-of-pocket."},
            "No-cost_Access": {"score": "1/5", "disc": "Very limited; mostly private or donor support."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "No screening program", "disc": "No organized gastric cancer screening exists."}
        }
    },


    {
        "id": 203,
        "cancer_type": "gastric",
        "country": "United Kingdom",
        "country_shortForm": "GB",
        "introduction": "Gastric cancer in the United Kingdom is relatively uncommon compared to East Asia, but diagnosis often occurs at an advanced stage due to lack of population-level screening. Specialized cancer centers with multidisciplinary teams exist in major cities, and advanced diagnostics, including molecular profiling, are widely available in tertiary hospitals. Clinical guidelines are well established and closely aligned with international standards (ESMO/NCCN). Treatment access is generally equitable, though some geographic variability exists. Reimbursement and subsidized care are broadly available through the NHS. Early detection remains limited due to the absence of organized national screening programs. Overall, gastric cancer care in the UK shows high maturity, with strong infrastructure, treatment access, guideline implementation, and research integration.",
        "swot_analysis": {
            "Strengths":
                ["Well-established specialized cancer centers with multidisciplinary teams.",
"High availability of molecular diagnostics and targeted therapy testing.",
"Strong alignment with international clinical guidelines (ESMO/NCCN).",
"Broad public coverage through NHS, minimizing out-of-pocket costs.",
"Active research programs and participation in international clinical trials."
],

            "Weaknesses":
                ["No population-based gastric cancer screening program.",
"Detection often occurs at an advanced stage.",
"Geographic disparities in access to some specialized therapies."
],

            "Opportunities": 
                ["Develop pilot programs for targeted screening in high-risk populations.",
"Expand public awareness campaigns on gastric cancer symptoms.",
"Integrate emerging molecular biomarkers for personalized treatment."
],

            "Threats": 
                ["Rising incidence of gastric cancer in certain ethnic groups.",
"Budgetary constraints may limit adoption of new targeted therapies.",
"Workforce shortages in gastroenterology and oncology."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "4/5", "disc": "Specialized centers exist in major cities with multidisciplinary teams."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Advanced molecular diagnostics widely available; strong infrastructure."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard and advanced therapies accessible across NHS hospitals."},
            "Research_Funding": {"score": "5/5", "disc": "Active participation in clinical trials and research programs."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Campaigns exist but general population awareness remains moderate."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "5/5", "disc": "High survival relative to global benchmarks due to quality care."},
            "Early_Detection": {"score": "3/5", "disc": "Detection often late; no national screening program."},
            "Palliative_Care": {"score": "5/5", "disc": "Comprehensive palliative services widely accessible."}
        },
        "biomarkers": {
            "HER2":{"score": "90%", "disc": "Routine testing for targeted therapy eligibility."},
            "MSI_H/dMMR": {"score": "85%", "disc": "Broadly implemented in tertiary centers."},
            "PDL_1_CPS>1": {"score": "85%", "disc": "Used for immunotherapy decision-making."},
            "CLDN18.2": {"score": "70%", "disc": "Available in select centers for targeted therapy."},
            "FGFR2b": {"score": "55%", "disc": "Limited to research and specialized centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "Widely followed in NHS hospitals."},
            "Feasibility": {"score": "5/5", "disc": "Fully feasible across well-equipped hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Full alignment with ESMO/NCCN."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "National centers promptly adopt updates."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Fully integrated into clinical care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "3/5", "disc": "NHS provides coverage; private insurance optional."},
            "No-cost_Access": {"score": "3/5", "disc": "Low out-of-pocket costs due to NHS."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "2/5", "disc": "No organized national screening; not recommended for general population."}
        }
    },


    {
        "id": 204,
        "cancer_type": "gastric",
        "country": "United States",
        "country_shortForm": "US",
        "introduction": "Gastric cancer in the United States is relatively uncommon compared to East Asia but carries high mortality when diagnosed late. Specialized centers and tertiary hospitals provide advanced care, with access to endoscopy, surgery, systemic therapies, and targeted treatments. Screening is not population-based; it is limited to high-risk groups (e.g., familial syndromes, immigrants from high-incidence countries). Molecular profiling and biomarker-guided therapies are increasingly integrated in clinical practice. Clinical guidelines (NCCN, ASCO) are widely implemented in academic and tertiary centers. Reimbursement exists for most standard therapies, though access to novel or high-cost therapies may involve out-of-pocket expenses. Overall, gastric cancer care in the U.S. shows high maturity, with gaps primarily in organized screening for average-risk populations.",
        "swot_analysis": {
            "Strengths":
                ["Advanced, specialized cancer centers with multidisciplinary gastric cancer programs.",
"Access to standard and novel systemic therapies (chemotherapy, targeted therapy, immunotherapy).",
"Widespread adoption of evidence-based clinical guidelines (NCCN, ASCO).",
"Advanced diagnostics and molecular profiling available in many tertiary hospitals."
],

            "Weaknesses":
                ["No organized national screening for average-risk population; diagnosis often occurs at advanced stages.",
"Rural populations may experience delays in accessing specialized care.",
"High costs for certain therapies may pose financial barriers despite insurance coverage."
],

            "Opportunities": 
                ["Expand risk-stratified early detection programs for high-risk populations.",
"Broaden access to molecular biomarker testing for targeted therapies.",
"Leverage telemedicine for gastroenterology and oncology consultation in underserved regions."
],

            "Threats": 
                ["Rising incidence in certain demographic subgroups may challenge healthcare resources.",
"Health inequities may persist between urban and rural populations.",
"Novel therapies may exacerbate financial burden and access disparities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "5/5", "disc": "Advanced cancer centers with multidisciplinary gastric cancer programs widely available in urban areas."},
            "Genetic_Molecular_Testing": {"score": "5/5", "disc": "Broad molecular profiling and biomarker testing accessible in tertiary hospitals."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "5/5", "disc": "Standard therapies widely available; targeted therapies increasingly accessible."},
            "Research_Funding": {"score": "5/5", "disc": "Strong clinical research and participation in international trials."},
            "Awareness_Campaigns": {"score": "4/5", "disc": "Awareness exists but limited public knowledge due to low incidence in general population."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "4/5", "disc": "Survival relatively high for early-stage detection; late-stage outcomes remain poor."},
            "Early_Detection": {"score": "3/5", "disc": "Screening limited to high-risk individuals; no national population-level program."},
            "Palliative_Care": {"score": "4/5", "disc": "Palliative care integrated in cancer centers; supportive services widely available."}
        },
        "biomarkers": {
            "HER2":{"score": "%", "disc": "Routinely tested in advanced cases for targeted therapy."},
            "MSI_H/dMMR": {"score": "%", "disc": "Frequently assessed to guide immunotherapy."},
            "PDL_1_CPS>1": {"score": "%", "disc": "Standard practice in metastatic setting."},
            "CLDN18.2": {"score": "%", "disc": "Emerging biomarker; available in specialized centers."},
            "FGFR2b": {"score": "%", "disc": "Limited access; used in select trials or tertiary centers."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "5/5", "disc": "NCCN/ASCO guidelines widely followed."},
            "Feasibility": {"score": "5/5", "disc": "Fully feasible in well-resourced hospitals."},
            "Adoption_International_Guideline": {"score": "5/5", "disc": "Strong alignment with international standards."},
            "Engagement_with_Updates": {"score": "3/3", "disc": "High adoption of updated guidelines in tertiary centers."},
            "ESMO_Guidelines": {"score": "5/5", "disc": "Integrated for advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "4/5", "disc": "Most standard therapies reimbursed; high-cost drugs may require prior authorization."},
            "No-cost_Access": {"score": "3/5", "disc": "Some out-of-pocket expenses for novel therapies."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "Opportunistic only", "disc": "Screening limited to high-risk groups; no population-level program."}
        }
    },


    {
        "id": 205,
        "cancer_type": "gastric",
        "country": "Vietnam",
        "country_shortForm": "VN",
        "introduction": "Gastric cancer remains a significant health burden in Vietnam, with high incidence in urban and rural populations. Access to specialized care is concentrated in major cities, while rural areas face limited diagnostics and treatment availability. Molecular testing for targeted therapy is emerging but still restricted to select centers. Clinical guidelines exist but are variably implemented, and public awareness remains low. Screening is largely absent, though pilot H. pylori initiatives exist in some cities. Overall, gastric cancer care in Vietnam shows moderate maturity with gaps in early detection, guideline adoption, and equitable access.",
        "swot_analysis": {
            "Strengths":
                ["Specialized cancer centers in major cities provide access to standard treatment modalities.",
"Some infrastructure for molecular diagnostics (HER2, MSI-H, PD-L1) exists.",
"Clinical guidelines available, with partial implementation in tertiary hospitals.",
"Pilot H. pylori initiatives for early detection in select urban centers."
],

            "Weaknesses":
                ["Limited access to advanced diagnostics outside urban hubs.",
"Molecular biomarker utilization is low and not systematic.",
"National screening program absent; early detection largely opportunistic.",
"Awareness campaigns are minimal; low public knowledge and engagement.",
"Palliative care services are underdeveloped, especially in rural regions.",
"Out-of-pocket costs remain high due to limited reimbursement."
],

            "Opportunities": 
                ["Expand molecular testing infrastructure and access to targeted therapies.",
"Develop systematic early detection programs for high-risk populations.",
"Increase public health awareness and community education campaigns.",
"Strengthen palliative care networks and integrate opioids more widely.",
"Leverage telemedicine to support rural cancer care delivery.",
"Encourage participation in international clinical trials."
],

            "Threats": 
                ["Rising gastric cancer incidence may strain existing health system capacity.",
"Budget constraints may limit adoption of advanced diagnostics and therapies.",
"Urban-rural disparities in care may worsen without targeted interventions.",
"Workforce shortages in oncology and gastroenterology outside major cities."
]
        },
        "infrastructure": {
            "Specialized_Centers": {"score": "3/5", "disc": "Specialized centers exist in major cities; rural access limited."},
            "Genetic_Molecular_Testing": {"score": "2/5", "disc": "Limited infrastructure; biomarkers (HER2, MSI-H, PD-L1, CLDN18.2, FGFR2b) available in select centers."}
        },
        "treatment_funding_awareness": {
            "Treatment_Access": {"score": "3/5", "disc": "Standard therapies available in tertiary hospitals; rural inequities exist."},
            "Research_Funding": {"score": "2/5", "disc": "Modest research activity; local studies contribute partially to data."},
            "Awareness_Campaigns": {"score": "2/5", "disc": "Limited campaigns; low public engagement and awareness."}
        },
        "survival_rates": {
            "Survival_Rates": {"score": "3/5", "disc": "Moderate survival; late-stage presentation common."},
            "Early_Detection": {"score": "2/5", "disc": "Opportunistic or pilot detection initiatives; no national screening."},
            "Palliative_Care": {"score": "2/5", "disc": "Limited access, particularly outside urban centers."}
        },
        "biomarkers": {
            "HER2":{"score": "40%", "disc": "Available in select tertiary centers."},
            "MSI_H/dMMR": {"score": "30%", "disc": "Limited availability."},
            "PDL_1_CPS>1": {"score": "30%", "disc": "Used selectively in urban centers."},
            "CLDN18.2": {"score": "20%", "disc": "Very limited access."},
            "FGFR2b": {"score": "15%", "disc": "Minimal access."}
        },
        "clinical_guidelines": {
            "Implementation": {"score": "2/5", "disc": "Guidelines exist but implementation is partial."},
            "Feasibility": {"score": "2/5", "disc": "Feasible in tertiary hospitals; limited in smaller centers."},
            "Adoption_International_Guideline": {"score": "2/5", "disc": "Partial alignment with ESMO/NCCN standards."},
            "Engagement_with_Updates": {"score": "1/3", "disc": "Limited adoption of updates outside major hospitals."},
            "ESMO_Guidelines": {"score": "1/5", "disc": "Minimal integration beyond advanced/metastatic care."}
        },
        "reimbursement": {
            "Reimbursement_Coverage": {"score": "2/5", "disc": "Some coverage exists; gaps for advanced therapies."},
            "No-cost_Access": {"score": "2/5", "disc": "High out-of-pocket burden persists; subsidy limited."}
        },
        "cancer_screening": {
            "National_Screening": {"score": "N/A", "disc": "No national program; pilot H. pylori initiatives in urban centers."}
        }
    }
]